/*
 * Руйшійна версія текстової гри "Та заради справедливошти!"
 * 
 * Автор: Іво Сайвс ( ivo.sives@gmail.com )
 * 
 * VI.2025
 * 
 * Не для злих цілей.
 * 
 * Ichthus
 * 
 */

import java.awt.*;
import java.awt.event.*;
import javax.swing.*;
import javax.swing.event.*;
import javax.swing.event.HyperlinkEvent;
import javax.swing.event.ChangeEvent;
import javax.swing.event.ChangeListener;
import javax.swing.text.*;
import javax.sound.sampled.*;
import java.awt.image.*;
import javax.imageio.ImageIO;
import java.util.HashMap;
import java.util.Map;
import java.lang.reflect.Field;
import java.lang.reflect.Modifier;

import java.io.File;
import java.io.IOException;
import java.net.URI;
import java.util.*;
import java.io.*;
import java.nio.file.*;
import java.time.LocalDateTime;
import java.time.format.DateTimeFormatter;

//An AWT GUI program inherits from the top-level container java.awt.Frame
//NB: подібні проєкти чутливі до обмеження 65 KB в Java: окремий метод не повинен перевищувати обсяг в 65 КБ даних, отже, якщо передбачається 2-3+ тис. рядків на один метод, краще розбити його на дрібніші.
public class TaZaradySpravedlyvoshty extends Frame implements ListSelectionListener, ActionListener {
	
BtnListener btnList;

//Опціональна панель для текстового поля фіксованої ширини. Якщо задіяти цю панель, текст (опис локації) буде вирівнюватися по центру на задану ширину при будь-якому розмірі вікна гри.
//JPanel panelbne_pole_tekstu=new JPanel();

//Остання локація може бути з запасом. Максимально кнопок: це фактична кількість кнопок +1 (0 "кнопка" це поточна локація)
//У двовимірний масив переноситься зміст карти локацій (mapalokiw.txt)
final int OSTLOK=100, MAXBTNS=8;
final int[][] lokaciji=new int[OSTLOK][MAXBTNS];

//Важлива змінна, що маркує поточну локацію (на якій знаходиться ГГ)
int potochna_loka;

boolean osb_i_ekshen=false, randomOp2=false, stawky_zrobleno=false, napriamu=false;

Window TinbowaPanelb;

private static ChasMuzyky chas_muz;
private Clip clip;

private static final Map<String, BufferedImage> cache=new HashMap<>();

boolean loc_start_boo=false, loc_lis_boo=false, loc_ferma_boo=false, loc_brama_boo=false, loc_misto_boo=false, loc_bazar_boo=false, loc_uriadkw_boo=false;
int loc_start_int=0, loc_lis_int=0, loc_ferma_int=0, loc_ferma_lich=0, loc_brama_int=0, loc_misto_int=0, loc_uriadkw_int=0;

int baseLvlXp=250;

int midiaky=0;			int midiaky_tmp=0;			int midb_tmp=0; //тримає кількість монет; тмп тримає зароблену суму вперше щоб потім плюсувати її до загалової
int lyzardy=0;			int lyzardy_tmp=0;
int fbjordy=0;			int fbjordy_tmp=0;
int med=0;				int med_tmp=0;
int pirja=0;			int pirja_tmp=0;
int chorni_dijamanty=0; int chorni_dijamanty_tmp=0;
int rozhevi_perly=0; 	int rozhevi_perly_tmp=0;
int perepel_jaicja=0;	int perepel_jaicja_tmp=0;

//0 позамістя; 1 ліс; 2 ферма; 3 буцегарня; 4 brama; 5 ойкуменополіс; 6 "галайдель"; 7 урядовий квартал; 8 портовий район; 9 квасдім; 10 пляж; 11 оселя диму; 12 базар; 13 Склотара Склотаренка і Ко; 14 фортеця справедливости
//Назви локацій повинні відповідати індексу з kontent.txt, проміжні індекси, що не використовуються повинні бути порожніми.
String[] locs={"", "Позамістя", "", "Продавлений ліс", "Перекособочена фарма", "", "", "", "", "", "", "", "Буцегарня", "Міська брама", "Позамістя", "", "", "", "", "", "", "", "Ойкуменополіс", "Мотель 'Галайдель'", "Урядовий квартал", "Портовий район", "Квасдім", "Пляж", "Оселя диму", "Базар", "Склотара Склотаренка і Ко", "Фортеця Справедливошчи"};

//Custom button text * 0-1
Object[] opti={"Так","Ні"};

//функціонал текстового поля на старті
JTextField pole_imeni=new JTextField(20);
JButton godytbsia_knp=new JButton("Годиться");
String[] imia_geroia=new String[1];
JPanel poleVvodu=new JPanel();
          
//службові змінні
static int kosmichnyj_chas=0; static int kosmichni_knopky=0; static String kosmichnyj_text="";
ArrayList<Integer> perevirka_kilbkosty=new ArrayList<>(50);
int outrujnyk_tmp=0; int zzz=0; int blukaty_mistom_knp=3; int summa_prygod=0; int loc_misto_b_int=0; int knyga=-1;
int nakupyw=0; static int jaTut=-1; int shliahetna_promova=0; int smihowynna_promova=0; static int rndRich=-1;
String journalTmp=""; String zillja=""; String eleks="";
int critChance_gg=0; int critChance_mob=0; int zillja_int=-1; int eleks_int=-1;
int terpecb=0, wizit_k_lorduprotektoru=2;
int rivenb=0, poshkoda=0, prybutok=0, wagoma_korystb_o=0; int buw_na_fermi=0; int denb_na_budiakah=0, dni_na_farmi=0; int buw_u_lisi=0; int sproba_hruskitu=0; int lisowa_kazka=-1, lisowyj_pryz=-1, liwsowyj_pryz=-1, lisowyj_kush=-1, lisowyj_kush2=-1;
int lichbba_zahodiw=0;
int fenix_ml=0, bolotnyj_skytalecb_ml=0, kwas_kh=0, midb_jokera=0, midb_jokera_minus=0, lyzardy_jokera=0, peremoga=0, noweyj_denb=1, wagoma_korystb_kg=0;
int oz_gg_tmp=0;
int newrazlywyj_c=0, litalbnyj_c=0, zagalbnakorystb_c=0, univer_z_c=0, zagalbnakorystb_c_tmp=0, kwasalo_c=0;
int knopky_tmp=0, knopky_tmp_son=0;
int otrujnyj_ukus=0, wognedyh=0, slyzepljuj=0;
int noweykolir1=0, noweykolir2=0, noweykolir3=0;
boolean testxp=false; boolean theend=false; boolean zalizni_zuby=false; boolean dymnyk_porizak=false; boolean znaje_pro_towar=false; boolean fenix=false; boolean nazad=false;
boolean panaceo_minus_znyzhka=false; boolean kincewa_zupynka=false; boolean poblukaw_mistom=false; boolean probudytelb=false;
boolean robota_na_skladi=false; boolean znaje_pro_sklad=false; boolean sumnyj_neznajomecb=false; boolean kvasdim_zakryto=false; boolean pljazh=false; boolean port_gotov=false; boolean panaceo_done=false;
boolean cina_kwasu=false; boolean rukawycia2=false; boolean rukawychnyj_peremykach=false;
boolean perehwat6=false, perehwat7=true, perehwat_lisu=false, ja_do_lisu=false, perehwat_fort=false; boolean natomistb_prodawaty=false; boolean pomidor=false; boolean vaBank=false; boolean graemo_na_lyzardy=false; boolean graemo_na_fbjordy=false;
boolean prograw_shtany=false; boolean graemo_na_rechi=false; boolean graemo_na_shtany=false; boolean minusLyzardy=false; boolean minusFbjourdy=false; boolean naWyhod=false;
boolean reguliator_perenapravlennia=false; boolean peredumaw_graty_na_shtany=false; boolean peredumaw_graty_na_shtany2=false; boolean perma_gra_na_rechi=false;
boolean treba_perepustka=false; boolean specialnyj=false; boolean na_wyhid=false;
boolean inv_zer0=false; boolean idemo_dali=false; boolean denb_na_budiakah_boo=true; boolean start_loc_boo=false; boolean buw_u_misti=false;
boolean podwijnyj_strybok=false; boolean tresh=true, ja_do_pozamistia=false; boolean bij=false;
boolean promowa_do_kwasopijciw=false, promowa_do_ojkumenopolisian=false, daw_proshaku27=false, daw_proshaku48=false, wmywsia=false, osoblywyj_denb=false, osoblywyj_denb1=false;
boolean buw_na_bazari=false, buw_na_bazari1=false, buw_u_sklotarenka=false, bez_sklotary=false, buw_w_uriadkw=false, buw_u_lordaprotektora=false;
boolean motelb6=false, ekzamen_skla=false;
boolean nabir_grybiw=false, prodazh_grybiw=false;
boolean fort_prosto_rozdywliajusia=false, fort_robota=false;
boolean wulychna_stricha=false;
boolean wypyw_elek_korysti_o=false, elek_korysti_pershyj=false;
boolean fintheendandgg=false;
boolean hrustkyj_bonus=false, osheleshuwachx2=false, sonjokera=false, znaje_zirky=false, smittia_na_stawku=false;
boolean newrazlywyj=false, litalbnyj=false, zagalbnakorystb=false, univer_z=false, kwasalo=false;
boolean wystawna_rich=false, pochatok_wystawy=false;
boolean otrujnyj_ukus_boo=false, otrujnyj_ukus_persh=false, wognedyh_boo=false, slyzepljuj_boo=false;
boolean shyrokepole=false;
boolean nowey_kolir=false, prosto_zmnia_kolboru=false;
boolean spaty_chy_ne_spaty=false;
boolean pershyj_raz_u_moteli=true;
static boolean chas_myzyky_b=false;
String fajl="zhurnal_ojkumenopolisu.txt"; String lakperepustka="", hrustkyj_bonus_s="", osheleshuwachx2_s="", zalizni_zuby_s="", dni_na_farmi_s="";
String audiofon="";
String zobrazh="";
String globalbnyj_journal="";
String[] znaje_zirky_m=new String[250];

//спецітеми
boolean misiachne_nasinnia=false, rukawycia_dino=false, sitka_karbon=false, lynwa_upokor=false, neprytomnyk=false, osheleshuwach=false;
int rukawycia_dino_lic=(int)(5*Math.random()), sitka_karbon_lic=(int)(5*Math.random()), lynwa_upokor_lic=(int)(5*Math.random()), neprytomnyk_lic=(int)(5*Math.random()), osheleshuwach_lic=(int)(5*Math.random());

//контроль кнопок
boolean[] odiag={false, false, false, false, false};
boolean[] gavy5={false, false, false, false, false};
boolean[] kvasdim3={false, false, false};
boolean[] shynkvas7={false, false, false, false, false, false, false};
boolean[] panaceo7={false, false, false, false, false, false, false};
boolean[] panaceo7_2={false, false, false, false, false, false, false};
boolean[] panaceo7_3={false, false, false, false, false, false, false};
boolean[] panaceo7_robymo_elek={false, false, false, false, false, false, false};
boolean[] panaceo7_3_opysowyj={false, false, false, false, false, false, false};
boolean[] bazar7={false, false, false, false, false, false, false};
boolean[] bazar7_kwasnyk={false, false, false};
boolean[] bazar7_dymnyk={false, false, false};
boolean[] bazar7_towary={false, false, false, false, false, false, false};
boolean[] bazar7_knyzhenko={false, false, false, false, false, false, false};
boolean[] bazar7_zbrojiak={false, false, false, false, false, false, false};
boolean[] bazar7_sklotarenko={false, false, false, false, false, false, false};
boolean[] bazar7_sklotarenko_dynamichnyj={false, false, false, false, false, false, false};
boolean[] lord_protektor={false, false, false, false, false, false, false};

boolean critGG_boo=false; boolean critMob_boo=false; boolean dozvilUrjadowyjKvrtl=false; //поки що неактивна змінна, не знаю чи буде вона задіяна?!
static int urn_gg=0; static int urn_mob=0;
static int vybranyjItem=0;
static int bazoKrit_mob=4; static int bazoKrit_gg=2; //модифікатори крита: для моба більше,цебто його дмг множиться на 4, а гг на 2
int denb=5; //базовий лічильник до завершення гри на 0
String[] bvg={"б", "в", "г", "ґ", "д", "ж", "з", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ", "ь"};
String[] aeje={"а", "е", "є", "і", "ї", "й", "о", "у", "ю", "я"};
String[] zirNums={"Альфа", "Бета", "Гамма", "Дельта", "Епсілон", "Тау", "Дзета", "Ета", "Тета", "Йота", "Каппа", "Лямбда", "Мю", "Ню", "Ксі", "Омікрон", "Пі", "Ро", "Сигма", "Іпсилон", "Фі", "Хі", "Псі", "Омега", "Дигамма", "Стигма", "Коппа", "Сампі", "Хета", "Шо", "Сан"};
//14
String[] koloda={"Двійка", "Трійка", "Четвірка", "П'ятірка", "Шістка", "Сімка", "Вісімка", "Дев'ятка", "Десятка", "Валет", "Дама", "Король", "Туз", "Джокер"};
String[] koloda_znaky={"Треф", "Бубен", "Пік", "Черв"};
//кущі
String[] kushi={"вовчих ", "лисячих ", "крукових ", "єнотових ", "барсукових ", "качконосових ", "гробольских ", "трутеневих ", "шаблервачних ", "психопатичних ", "неочевидних ", "очевидних ", "врівноважених ", "драгонячих ", "зимних ", "літяних ", "водновидових ", "напівпрозористих ", "бульбашкових ", "райдужновеселкових ", "порожньобездонних ", "гарновродливих ", "запашистих ", "розкидистих ", "незрівнянних ", "собачих ", "котячих ", "китячих ", "паралаксових ", "шістнадцятибітових ", "різнобарвистих ", "лелекових ", "далекових ", "незворушних "};
String[] kushi2={"ягід", "грибів", "лискунчиків", "солодких ватів", "квітів", "шпичаків", "каштанів", "ліанів", "травиць", "відзеркалень", "конусів", "сфероїдів", "вапняків", "гранулярів", "прецезентів", "золотистих листів", "паркуляріїв", "свадвадів", "торчлітів", "прешотів", "сріблястих насінь", "смарагдистів", "рубнидів", "ойкуменів", "мерзодушників", "граквачів", "субдубів"};
//рівні 0-34
String[] riwni={"Без труда нема плода.", "Стереженого Бог стереже.", "Water drops on burning rocks.", "По відрубанню голови за волоссям не плачуть.", "Горить хата, хай горить і сарай! ", "Хто дарма не витрачає, тому завжди вистачає.", "Скажи дурню камінь з води витягти, він цілу річку відром зачне черпати.", "Смішно козі, що срака в грязі.", "Хто з псами лягає, той з блохами встає.", "Не любить правди, як пес мила.", "Який кінь, така й кульбака.", "Що було, то мохом поросло.", "І золоті вудила коневі не милі.", "Чужими руками добре гада ловити.", "На городі бузина, а в Києві дядько.", "Найміть мене обідати.", "Намолов сім мішків гречаної вовни.", "На людях Ілля, а вдома — свиня.", "З кривого дерева — крива і тінь.", "Не хвали дня перед вечором.", "Не завжди так складається, як сподівається.", "Холодного заліза, кажуть, не вкуєш.", "Як добрі будемо, то вже Бог погодить, що й нам розпогодиться.", "Що Бог не дасть, усе в торбу.", "Сказано — швидко робиться, тут і там коробиться.", "Жадоба мішки рве.", "А на ті хитрощі є в мене незгірші мудрощі.", "Де ж ти чув, щоб у домі вішальника та згадували про вірьовку?", "Компромис — це шлях до безпринципности.", "My advice falls into deaf ears. ", "Найгідніше змагання — змагання в чоловічности.", "З тим, хто відкидає основи, немає чого сперечатися.", "Ворон ворону ніколи ока не виклює.", "Qui ne risque ne pagne."};

//постійні
int oz_gg=100;
//0 vovk; 1 лис; 2 вепр; 3 гробол; 4 лют. копач; 5 лют.-лют. копач; 6 горбач-берс.; 7 трупороб; 8 сомнамбула; 9 мотельниця; 10 шаблервач; 11 психоп. псивілок; 12 лютоскаженик; 13 безум. вухастик; 14 незрозум. препре; 15 сайвак столютий; 16 граквак; 17 шостилап. пащень; 18 кирпидон; 19 жахарик мерзовидний; 20 зненацк. проносник; 21 коробайрус; 22 смердюч. 100км; 23 гарбруз зеленог.; 24 плюхало болотне; 25 дупловий виглядач; 26 по-ногам-наступач; 27 вайло переломлений-хвіст; 28 ненажерний канібало; 29 мутногляд. плещивець
String[] mob_names={"Скажений вовк", "Навіснілий лис", "Ненормальний вепр", "Гробол", "Лютий копач", "Лютий-лютий копач", "Горбач-берсеркер", "Трупороб", "Сомнамбула", "Мотельниця", "Шаблервач", "Психопатичний псивілок", "Лютоскаженик", "Безумний вухастик", "Незрозумілий препре", "Сайвак столютий", "Граквак", "Шостилапий пащень", "Кирпидон", "Жахарик мерзовидний", "Зненацький проносник", "Коронобайрус", "Смердючник стокілометровий", "Гарбруз зеленогнилий", "Плюхало болотне", "Дупловий виглядач", "По-ногам-наступач", "Вайло переломлений-хвіст", "Ненажерник канібало", "Мутноглядний плєщивець"};
int[] mob_urns={4, 5, 6, 9, 19, 19, 46, 6, 10, 1, 11, 10, 12, 9, 8, 13, 6, 14, 11, 5, 15, 7, 10, 4, 2, 3, 4, 8, 10, 3};
int[] mob_hps={24, 30, 44, 59, 118, 118, 137, 49, 70, 50, 60, 30, 55, 22, 80, 100, 51, 85, 74, 70, 19, 20, 100, 13, 10, 14, 17, 31, 46, 28};
//маркер, визначає початок бою з конкретним мобом, по закінченю значення моба в цьому масиві фальсується
boolean[] mob_boj=new boolean[mob_names.length];

boolean firstStart=true; //потрібно для видалення порожнього значення зі списку дропу (в інвентарі)

//Далі важливі масиви: перший вміщує назви ітемів, індекси цих ітемів також використовуються в реальних умовах для маніпуляцій з відповідними ітемами.
//Другий і 4-й потрібні для відображення опису ітема в інвентарі, розмір цих масивів повинен бути не менше реальної кількости ітемів.
//3-й масив містить пошкоди кожного ітема, навіть якщо це не зброя. Важливо! Усі ітеми повинні мати значення пошкоди, але ітемів з пошкодою >0 має бути не більше, аніж є слотів на "поясі", тобто в подвійній панелі вибору ітему.
//0 руки; 1 дрюк; 2 е. дрюк; 3 л. дрюк; 4 миль. сол.; 5 нехворай; 6 мідяки; 7 Отруйник; 8 Мармурові кульки; 9 ціпок із яблуком; 10 ланцюг; 11 ядерний сонях; 12 протуберанцій; 13 криштальник; 14 золотовій; 15 скві аві ваі; 16 лизарди; 17 фьйорди; 18 вусики трупороба; 19 борода шапка; 20 підземний гном; 21 камінь-скорпіонів; 22 фуга-геге; 23 люмінісцентник; 24 Вбрання 1-го клясу; 25 Вбрання 2-го клясу; 26 Вбрання 3-го клясу; 27 Вбрання S-клясу
//28 лік. посібник; 29 про сон; 30 літання; 31 нічого не робити; 32 все знаю; 33 конституція; 34 квасало; 35 місячне насіння; 36 рукавиця диноз.; 37 сітка з карб.; 38 упокор. линва; 39 непритомник
//40 елек. ліку; 41 елек. сну; 42 елек. літу; 43 елек. загал. корист.; 44 елек. універс. знан.; 45 елек. корист. ойкумен.; 46 елек. квасала; 47 мед; 48 смерек. діжка квасу; 49 пір'я золот. павича
//50 чорні діяманти; 51 рожеві перли; 52 перепілч. яйця; 53 квітка жирогону; 54 діряв. чобіт (лів.); 55 злам. єкскальбюр; 56 пенсне без стекол; 57 стекла без пенсне; 58 діряв. чобіт (прав.)
//59 лакована перпустка; 60 ошелешувач
String[] items={"Руки-ноги", "Телескопичний дрючок", "(Е) Телескопічний дрючок", "(Л) Телескопічний дрючок", "Мильна соломинка", "Нехворай", "Мідяки", "Отруйник",
	 "Мармурові кульки", "Ціпок із яблуком", "Ланцюг", "Ядерний сонях", "Протуберанцій", "Криштальник", "Золотовій", "Скві аві ваі", 
	 "Лизарди", "Фьйорди", "Вусики трупоробів", "Бородата шапка", "Підземний гном", "Камінь-скорпіонів", "Фуга-геге", "Люмінісцентник", 
	 "Вбрання 1-го клясу", "Вбрання 2-го клясу", "Вбрання 3-го клясу", "Вбрання S-клясу", "'Лікувальний посібник'", "'Про сон і хропіння'", "'Як літати і не платити за дороги. Реальний досвід літуна'", "'Як я все кинув напризволяще і став найкориснішим у місті'", 
	 "'Я все знаю і тепер можу спокійно спати'", "'Конституція Ойкуменополісу'", "'Квасало без обмежень і побоченів'", "Місячне насіння", "Рукавиця динозавра", "Карбонатрієва сітка", "Упокорювальна линва", "Непритомник",
	 "Еліксир Ліку", "Еліксир Сну", "Еліксир Літу", "Еліксир Загальної користі", "Еліксир Універсального знання", "Еліксир Користі Ойкуменополісу", "Еліксир Квасала",
	 "Мед", "Смерекова діжка квасу", "Пір'я золотого павича", "Чорні діяманти", "Рожеві перли", "Перепілчені яйця", "Квітка жирогону",
	 "Дірявий чобіт (лівий)", "Зламаний Єкскальбюр", "Пенсне без стекол", "Стекла без пенсне", "Дірявий чобіт (правий)", "Лакована перепустка", "Ошелешувач"};
boolean[] items_boo=new boolean[100]; //ітеми які отримує гравець відмічаються в цьому масиві по тому індексу, в якому вони заносяться до інвентаря безпосередньо, це важливо для виводу опису ітемів в інвентарі, тому що інакше доведеться прив'язувати кожний ітем до конкретної позиції
//0-59
int[] items_urn={2, 9, 11, 13, 12, 0, 0, 0, 0, 0, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
int[] items_eter=new int[100]; //етерний масив який тримає на етерних індексах (що відповідають позиції в інвентарі) — реальні індекси об'єктів, це потрібно для виводу опису конкретних ітемів

//Описи ітемів починаються з нульового, хоча в моєму прикладі 0-й опис відповідає 1 індексу масиву ітемів, тому в масиві описів на 0 індексі пробіл.
String item0="Випростовується на довжину руки, зроблений з дуба, має залізні клепки. Легко поміщується у кишені. Наносить 1-5 пошкоджень.";
String item1="Вельми схожий на дубовий дрючок, тільки цей з чорного дерева, має тридцять дві мідні клепки, пречудово відполірований. Наносить до 8 пошкоджень.";
String item2="Краща з відомих науці розкладана палиця з червоного дерева. Її вкрай важко зламати, оскільки сегменти додатково скріплені залізними кільцями. Також вона довша на один сегмент і наносить більше пошкоджень: до 10.";
String item3="Паличка вміщується на долоні, не має серцевини, гладка, жовта, пахне трояндами. Випускає за видув до сотні бульбашок різного діяметру. Унікальна властивість: може дезорієнтувати супротивника (пропускає хід). Максимальна пошкода 9.";
String item4="Має чудодійну властивість миттєво збавляти будь-які хвороби та закривати будь-якенні рани. Перед застосуванням обов'язково зверніться до лікаря, пам'ятайте: самолікування може нашкодити вам і не тільки вам, всім абсолютно!";
String item5="Зелені тонкі маленькі (з ніготь) мідні монети, мають найнижчу в анархійстві ціну. Сотня таких дорівнює одній залізній монеті. У вашій кишені наразі:\n";
String item6="Це улюблена рослина трупоробів, з неї вони збирають труйний нектар та перероблюють його в отруту для своїх жал. Та маючи вміння, отруйник можебно перетворити на щось корисне для чоловіка.";
String item7="Дві натерті кам'яні (з мармуру) білі кульки із дорогоцінними вітіями в текстурі. Попри твердість можуть виявитися крихкими. Помагають у пониженні стресу (якщо крутити в руці), та у злагоджені контрактів (як додаткова пропозиція).";
String item8="Зроблений із міцних порід дерева, має затерту інтарсію червоних прямокутних плашок, а також мідне навершя подібне до яблука. Маючи відповідний одяг можна видобути з образу додаткові бали враження або просто обміняти на хліб чи продати. Для бійок не годящий.";
String item9="Вживаний, місцями іржавий залізний ланцюг, йо' можна носити на плечі або на шиї, обмотатися по стану замість паска. Наносить близько 22 одиниць шкоди.";
String item10="Мініатюрний сонях із напівпрозорим чорним насінням. За легендою, такі ростуть на островах Внутрішнього океану, або як його ще називають: Океан пару, бо з його поверхні постійно випаровується вода, адже над океаном висить планетарне розжарене ядро.";
String item11="Металево-помаранчева рослина з асиметричними червоними листочками, приємно пахне, но жалить шкіру виділенням захисного соку. Легенда повістує про північні краї, де ночами трапляється Райдужні розстріски, нібито ці розстріски протріскують небесне склепіння й крізь ті зазори падають звізди із Протуберанціями.";
String item12="Зовсім не схожий на рослину: в нього тверде криштальне прозоре стебло, заповнене бірюзовою рідиною, а листя синє, потрійне. Має характерний ментоловий запах. Сторожили розказують про хриштальні печери глибоко під землею, точніше: під морями, тільки там ростуть Криштальники, а про їх властивости невідомо нікому, окрім найпосвяченіших альхеміків королівства.";
String item13="Цей квітчастий ліан із гроном ягід всередині містить кристалізований золотий цукрод, тому його так і назвали. Відомо, що сей ліан росте в Золотих пустелях, та де є ті пустелі — ніхто не знає. Кажуть лишень один альхемік знав те  — Золотовій Аугуст, та одного ранку він пішов в бік світанку та зник назавжди. Коштує карколомних грошей.";
String item14="Мало хто з живих альхеміків бачив цю рослину не в підручниках, а в натурі, за переданнями, Скві аві ваі наділена унікальними властивостями, одна з них: подовження життя на 10,000 років, але є лише один шанс з 10,000 на вдалу трансморфізацію. Рослина має три великі жовті квітки та безліч рожевого листя, в кожній квітці ще безліч дрібних квіток, а в тіх ще дрібніші, отже одний Скві аві ваі вміщує близько 10,000 квіток. Важко оцінити його ціну.";
String item15="Поправді золота монета в півпальця діаметром і в півнігтя товщиною, має рифлений кант, на лицьовому боці вигравійована вогнедиха ящірка, а потильному боці корона. Наразі у тя є:\n";
String item16="Невелика платинова монета із діагональним заглибленням, заповненим золотом, з одного боку розділення мається кредо короля: 'Жерить моє лівно', а з иншого його знак влади — м'ясницький ніж. На звороті гравюра левової голови. Це надзвичайно рідкісна та цінна монета, у тебе є:\n";
String item17="Кисло-солодкі гриби, жовтенькі на високій ніжці, якщо переїси — осліпнеш. Використовуються в кулінарії та альхемії.";
String item18="Рідкісний гриб, не має  смаку і запаху та жадної зареєстрованої користі, но чомусь викликає невідривну залежність. Ціниться в альхеміків.";
String item19="В народі ці гриби звуть брунатними топінамбурами, варять 24 години під закритою кришкою щоб позбутися отруйности. Іноді застосовуються в альхемічних рецептах.";
String item20="Всередині сього чорно-жовтого грибу є смертельне жало, і в кожному грибі воно розташоване деінде. Зазвичай вкидується до альхемічного відвару з протиотрутними складниками.";
String item21="Роздуті, бульбашкові гриби, бувають отруйними. Дорогі і рідкісні. Ціняться екстремалами, самогубцями, а також альхеміками. Смак невиразний. Незалежно од способу приготування існує 50% вірогідність померти на місці в тяжких муках.";
String item22="Напівпрозорі галюциногенні гриби, легко засвоюються організмом, але не виводяться, один з побоченів — відвалювання нирок. Користуються попитом здебільшого в альхеміків.";
String item23="Добротне плаття, складене з груботканої однотонної сорочки й таких самих ногавиць, але темнішої барви. В таких платтях гуляє простолюд в Портовому районі, іноді у Верхньому місті. Без спеціяльного пропуску до Урядового кварталу в такому вбранні не пропустять.";
String item24="Хороше плаття з двох речей: світла сорочка із тонкої тканини і темніші ногавиці з щільної тканини, здатні витримати довготривале сидіння на одному місці, або навіть падіння у них на бруківку. Тільки заможні портовики носять такі плаття, но до Урядового кварталу в ньому не пустять, хіба що маєш спецпропуск.";
String item25="Двошарова сорочка з шевйоту, із підпахівниками, перловими ґудзиками й викроєними манжетами із потрійною золотистою стьожкою, доповнюється чорними лляними штанами із паском та олов'яною бляхою з зображенням морського коника, та лакованими туфлями, підбитими, прошитими, й проклеєними, з великою металевою декоративною пряжкою. Такі одяги мають в гардеробах багатії Ойкуменополіса і носять їх по буденним справам, а на вікенд одягаються в S-кляс. В цьому одязі без проблем пропустять до Урядового кварталу.";
String item26="Плаття складається з трьох предметів: атласно-шовково-батистової сорочки з трьома шарами і підпахівниками з внутрішніми стьожками (щоб не муляли і не подразнювали шкіру), мережевим візерунком на манжетах з підкладкою, золотими ґудзиками із офортованою лінійною текстурою, та високим коміром до вух, прикрашений ледь помітним рослинним орнаментом; штани з конче щільної матерії, яка витримує кілювання, й приємною на дотик підкладкою; туфлі з десяти видів матеріялів, зокрема червоного негнійного дерева, залізних пластинок, бавовняних устілок, поверхня цих туфлів відганяє вологу, а ще вони світяться у темряві. В таких шатах ладники особисто проведуть тебе через Урядовий квартал до будь-якого візиту.";
String item27="Відомий на всьому Південному узбережжі та в околицях Чорнохмар'я автор бестселерів Ш. І. Роботенко написав цей твір за один вечір і став знаменито відомим серед медицинських наукових кол й поза ними. Містить рецепт приготування лікувального еліксиру.";
String item28="В книзі автор Ш. І. Роботенко розмірковує над природою сну: що таке сон, навіщо чоловік спить, чому спати краще за все ніччю та в темному приміщенні, як сон впливає на розумові та психо-фізичний стан організму, а також розглядає один з розладів дотичних сну — хропіння. Містить рецепт альхемічного еліксиру від хропіння.";
String item29="Поважний літун з багаторічним стажем — Ш. І. Роботенко, розповідає невигадану історію свого літального життя, ділиться враженнями од ширяння попід хмарами, надає поради щодо грошових заощаджень стосовно наземного транспорті. Містить альхемічний рецепт еліксиру літання.";
String item30="Ш. І. Роботенко у захоплюваній манері розказує про власний досвід професійного байдикування, під час якого йому вдалося посісти найвище становище в рідному місті і отримати нагороду мера. Містить альхемічний рецепт еліксиру загальної корисності.";
String item31="Важко переоцінити літературні здобутки Ш. І. Роботенка, серед яких є і така видатна робота з переліком масиву інформації, що починається числом Пі. Містить альхемічний рецепт панорамного знання.";
String item32="Автор відомих бестселерів Ш. І. Роботенко був залучений до роботи над складанням першої конституції Ойкуменополісу, чим приніс місту та краю неоціненну поміч. Містить рецепт еліксиру суттєвої допомоги Ойкуменополісу.";
String item33="Одного разу Ш. І. Роботенко, автор цієї книги, провів ґрунтовний дослід фестивалів і ярмарків, висновки аналітичної праці представлено в форматі таблиць, статистики, графіків, а також практичних порад. Містить альхемічний рецепт еліксиру квасалового харчування.";
String item34="Раз на рік збирають місячне насіння у Вовчих лісах, відбувається це посеред літа глибокою ніччю, затим, оброблені певним чином, оволодівають здатністю лускатися прямо у повітрі, водночас по вітру розсіюється димна хмарка, будь-яка звірина вдихнувши той випил, миттєво засинає. Майже на наносить фізичної шкоди.";
String item35="Майстри знайшли спосіб відтворити природну цупкість гроболової шкіри, для цього вони поєднали декілька видів волон кори жовтого дерева, та соку ґуамової квітки. Ці рукавиці ідеально пасують до ловів дрібного звіра. Майже не наносить шкоди.";
String item36="Напрочуд міцна сітка для лову звіра, птаха і риби. Є свідоцтва про успішні лови гробола у карбонатрієву сітку, деякі рибалки хизувалися, що упіймали двох акул такою сіткою. Також відоме повідомлення Елуза Клара, який стверджував, буцім власноруч зловив грифона з-за допомогою карбонатрієвої сітки. Майже не наносить шкоди.";
String item37="Линва вироблена з двох рослин: Комотозник і Шпичанк, та просочена соком кактусів Айго. Здатна упокорити будь-якого звіра, навіть покритого товстою шерстю. Практично не наносить шкоди.";
String item38="Унікальна річ, про яку мріють мисливці на гроболів та ядерних тролів. Достеменно невідомо механіка дії Непритомника, та хто і коли його виробив. Кажуть в світі є не більше 20 таких дзеркал. Майже не наносить фізичної шкоди.";
String item39="Майже прозора рідина без смаку і запаху, виробляється з-за допомогою базових альхемічних приладів, головним інгредієнтом є Нехворай.";
String item40="Мутна рідина з кисло-солодким запахом і така сама на смак. Якщо виготовлена правильно та з якісних компонентів, здатна занурити чоловіка у сон щонайменше на 8 годин.";
String item41="Голуба рідина, має солодкуватий присмак та ментолово-солоний запах. Впливає на бозони Ґігса, через що атомна структура невагоміє.";
String item42="Помаранчева рідина, гостра на смак, відгонить аміяком, надихає чоловіка на звершення і дієвість, робить його найкориснішим в суспільстві, водночас дозволяє нічого не робити. Довкола цього напою існує чимало мітифікацій, бо достоту ніхто не вміє правильного його виготовити, лишень наймайстерніший з наймайстерніших альхеміків здатен коректно змішати інгредієнти.";
String item43="Золотава рідина зі сріблястим смаком, дарує універсальне знання, яке, за свідоцтвами, відкривається лише у найглибших глибинах найміцнішого сну, на жаль, дістати з таких глибин те знання ще нікому не вдавалося.";
String item44="Рідина кольорів ойкуменополіського прапору: пурпурно-біло-зелено-жовтого, помагає чоловікові осягнути найкращі шляхи суспільно-економічного розвитку міста.";
String item45="Дуже схожа на квас рідина, жирна на смак, наділює чоловіка здатністю пити квас щонайменше тиждень без наслідків, а також їсти в цей ж час сало хоч і кілограмами також без наслідків. Користувачі Квасала зазвичай скаржаться на вторинну витратність еліксиру: усі їхні заощадження трансформуються на квас і сало. Квасники і саловари всіляко заохочують своїх клієнтів до споживання цього еліксиру.";
String item46="Як відомо, мед не псується, тому невідомо скільки років, або століть, чи навіть тисячоліть цьому медові, та виглядає він лепсько: жовтистий, в'язкий, без домішок і бджіл. Маєш в кишенях:\n";
String item47="Такі діжки робляться в лісах Смерековійстя, се містерний продукт, унікальність його полягає в тому, що діжка вміє стискатися разом із вмістом о сантиметричних розмірів.";
String item48="Хтось вважає їх навдивовижу рідкісними, бо ніяких золотих павичів не існує в природі! А хтось навпаки, викидає такі пір'я у сміття, на гній, бо не знає куди їх більше дівати! Та не кожен знає, що пір'я павича звичайного перетворюються на золоті за певних умов. Володієш:\n";
String item49="Білі діяманти всім відомі, але чорні ніхто не знає тому і практичної цінности вони не мають. Застосовуються хіба що в альхемічних рецептах, чи в площадній грі у ковпачки. Маєш таких:\n";
String item50="Білі перли ціняться найвище, а от рожеві дуже рідкісні й тому вони в Ойкуменополісі нікому не потрібні. Зазвичай тут використовують їх в альхемічних рецептах чи у ярмаркових іграх на ставку. Маєш їх:\n";
String item51="Найдивніші яйця в природі: їх діяметр усього 10 міліметрів, але з такого яйця вилуплюється пташеня, що зростає за рік у птаха з розмахом крилів 10 метрів. Маєш штуків:\n";
String item52="Неповторна властивість цих квітів: збавляти жир, зазвичай достатньо трьох квіток Жирогону, щоб зібрати тридцять тон жиру. Використовується в альхемії та хемії.";
String item53="Хто тільки не носив сей чобіт! При детальному огляді можна виявити, що носили йо' не тільки на лівій, а й на правій нозі. Та однаково річ ця покинута тут багато років, можливо, багато десятків років через те, що має ваду: величезну дірку у місці великого пальця.";
String item54="Колись цей меч зносив голови вогнедихим драконам і триголовим гірським тролям, а зараз нікому не потрібний валяється у грязюці в цьому лісові. Точніше: те, що від нього лишилося. Далебі, ніхто не візьметься запевнити автентичність цього Єкскальбюра, від часів, коли він був ще цілим, створено безліченно копій. Дехто каже, що саме копії і розкидано по всьому світові поламаними навпіл, а оригінал храниться в потаємних катакомбах незламним.";
String item55="Цей чудернацький прилад допомагає покращити зір, але без стекол він абсолютно безпотрібний. Хіба що вдавати з себе окулярія.";
String item56="Сі чудернацькі стекла пасують до пенсне і покращують зір, але без пенсне вони абсолютно безпотрібні. Та і, пролежавши тут багато часу, ці стекла розтяглися під дією сонця, тож прилаштувати у пенсне їх вже не вийде, а коли б й вдалося, бачити крізь них буде незручно, бо зображення викривлене.";
String item57="Хто тільки не носив сей чобіт! При детальному огляді можна виявити, що носили йо' не тільки на правій, а й на лівій нозі. Та однаково річ ця покинута тут багато років, можливо, багато десятків років через те, що має ваду: величезну дірку у місці великого пальця.";
String item58=null;
String item59="Схожий на невеличкий кубик пристрій із різними кнопками, важельками, перемикачами, засувками і кружальцями на кожній грані, річ унікальна своїм ошелешувальним ефектом, який здатна вчинити на супротивника або самого користувальника пристроєм.";

String[] items_descr={"", item0, item1, item2, item3, item4, item5, item6, item7, item8, item9, item10, item11, item12, item13, item14, item15, item16, item17, item18, item19, item20, item21, item22, item23, item24, item25, item26, item27, item28, item29, item30, item31, item32, item33, item34, item35, item36, item37, item38, item39, item40, item41, item42, item43, item44, item45, item46, item47, item48, item49, item50, item51, item52, item53, item54, item55, item56, item57, item58, item59};

//ТЕКСТОВИЙ БЛОК>>> 
//Рядки активно використовувались в моїй грі, тут це здебільшого не потрібно, оскільки всі описи зберігаються в зовнішньому файлі, але інтерактивні локації, типу картярської гри "Сон джокера" можна обслуговувати внутрішніми рядками.
String s_="<html><body style='font-family: Plain; font-size: 14px; background-color:#FFFFDE; margin:10;'>Створення гри було натхненне 'Готикою 2. Крукова ніч'. Перед вами клясична фентезійна історія із елементами RPG. Се інтерактивна новеля, ось як грати: читаєш опис, обираєш варіянт дії; така схема є спрощеною, у польових умовах доводитиметься приймати додаткові рішення, наприклад взаємодіяти із інвентарем, предметами.<br/><br/>Початково ігру було створено у 2013 р., доповнено, покращено та українізовано в 2024-25 рр.<br/><br/>Автор: Іво Сайвс ( <style='font-family: monospaced; font-size:14px;'><a href='mailto:ivo.sives@gmail.com'>ivo.sives@gmail.com</a></style> | <style='font-family: monospaced; font-size:14px;'><a href='https://buymeacoffee.com/oihivpouli'>buymeacoffee.com\\oihivpouli</a></style> ).<br/><br/>Ichthus</body></html>";
JEditorPane startowaPanelb=new JEditorPane("text/html", s_);
String progru="<html><body style='font-family: Plain; font-size: 14px; background-color:#FFFFDE; margin:10;'>Створення гри було натхненне 'Готикою 2. Крукова ніч'. Цей квест перший у серії з 4-х. Перед вами клясична фентезійна історія із елементами RPG. Се інтерактивна новеля, ось як грати: читаєш опис, обираєш варіянт дії; така схема є спрощеною, у польових умовах доводитеметься приймати додаткові рішення, наприклад взаємодіяти із інвентарем, предметами.<br/><br/><hr/><br/>Початково ігру було створено у 2013 р., доповнено, покращено та українізовано в 2024-25 рр.<br/><br/><hr/><br/>Автор: Іво Сайвс.<br/>Написати мні на пошту (вражіння од гри, свої думки, відгук, сигналізувати про помилку, пропозиції): <style='font-family: monospaced; font-size:14px;'><a href='mailto:ivo.sives@gmail.com'>ivo.sives@gmail.com</a></style><br/>Підтримати авторські проєкти грошима: <style='font-family: monospaced; font-size:14px;'><a href='https://buymeacoffee.com/oihivpouli'>buymeacoffee.com\\oihivpouli</a></style><br/><br/><hr/><br/>Всі картинки створені ChatGPT, деякі були відредаговані вручну.<br/><br/><hr/><br/>v.1.1R<br/><ul style='font-family: monospaced; font-size:12px;'><li>Виправлено баг з безконечною грою на штани у 'Сні джокера';</li><li>заповнений порожній перехід на 5 кнопку опісля тотального програшу у 'Сні джокеру';</li><li>оптимізовано стартову локацію 'Позамістя', одноразові операції більше не виконуються повторно при заході на локу;</li><li>оптимізовано відображення малюнків, тепер вони читаються однократно з диску, а потім з кешу;</li><li>поправлено орфографію.</li></ul><br/><hr/><br/>Ichthus</body></html>";
JEditorPane progruPanelb=new JEditorPane("text/html", progru);
        
String s="Створення гри було натхненне 'Готикою 2. Крукова ніч'. Перед вами клясична фентезійна історія із елементами RPG. Це інтерактивна новела, ось як грати: читаєш опис, обираєш варіянт дії; це спрощена схема, у польових умовах доводитиметься приймати додаткові рішення, наприклад взаємодіяти із інвентарем, предметами.\n\nПочатково ігру було створено у 2013 р., доповнено, покращено та українізовано в 2024-25 рр.\n\nАвтор: Іво Сайвс ( ivo.sives@gmail.com | buymeacoffee.com\\oihivpouli ).\n\nIchthus";
String s2="Сюжет. Уяви що ті заважає спати таке хропіння, що штукатурка сиплеться зі стін, ситуація не з приємних, але що зробиш? Людина хіба винна? Вона мирно собі дивиться сни й навіть не підозрює що псує інтер'єр, нерви та сон прибічних. Головна сцена розгортається в безоплатному готелі для трудяг і пришельців Ойкуменополісу — немаленького портового міста в своєму королівстві.\n Бідак-хропун за своє хропіння дістає духопеликів од мотельників і опиняється під бордюром хідника навпроти готелю.\n\nТут біля Ойкуменополіса майже героїчно з'являється Головний Герой, себто — ти.\nВідомостей про головного героя мало, лише його ім'я, вік та зовню ж бо він має невизначені:";
String loc_start1="Опісля зустрічі із таємничим незнайомцем, який розповів останні новини Ойкуменополісу та фарми Горбача, побідкався на злісних гоблінів, та подарував ті (з жалости) Телескопічний дрючок, наостанок побажав мирної дороги й щойно ти блимнув сховався з поля зору.\nТи рушив далі, попід скеляною аркою, поміж кипарисів й сосен, що хитаються тут з прадавніх часів, йшов ти пильною стежкою, підбиваючи камінці, доки не вийшов на відкритий простір: стежка біжить далі між валунів і корчів, кудись до кам'яних стін Ойкуменополісу, вздовж літають гігантські комахи, а праворуч галявина, за якою розмістилася Горбачева фарма, ліворуч темні хащі лісу.\n\n1. Йти стежкою до міської брами\n2. Простувати галявиною до фарми\n3. Зануритися в ліс";

String loc_uriadowyj_kwartal7_habarnyky2="Лорд-протектор поклав обидві руки на катедру, дивився перед собою та ніц не бачив — міркував. Тоді сказав: 'Маєш рацію, "+imia_geroia[0]+", справді така політика в силі позбавити нас працелюбних, розумних, або як ти сказав 'талановитих' людий, які в перспективі принесуть значно більше користі, аніж можна було очікувати. Та водночас ми стикаємося і з певними ризиками, вільний вхід здатен привабити кримінальників, отож, чи набудемо ми тоді, а чи втратимо? Я винесу це питання на обговорення ради'.\n\n1. 'Був радий зробити ваше місто дійсно багатшим'";
String loc_uriadowyj_kwartal7_dymnyk_sheraz="Ти не втомлювався викладати про шкоду куріння та наводити  приклади негідної поведінки в публічному місці — посеред базару, на Димникових килимах, коли люди практично забували про себе у спробі відокремитися од реальности, в якій вони продовжують бути членами суспільства, членами людської цивілізації, і, відповідно, повинні поводитися як члени цивілізованого суспільства, а не пускати бульби носом під скамною.\n\nЛорд-протектор на це сказав так: 'Іще раз дякую за твоє дбання про порядність нашого міста і адекватність містян, "+imia_geroia[0]+", але будь певен, усе під контролем, я чудово ознайомлений із базарними активностями, Димник — наш чоловік, він провадить програму по виокремленню податливих до чутливих залежностей громадян, затим ми проведемо з ними освітню бесіду та залучимо до курсу соціяльної реінтеграції. Той дим, що вони вдихають не є наркотичним, усі ефекти, які досягають курці є суто плацебними, нешкідливими'.\n\n1. 'Був радий допомогти'\n2. 'В мене лишаються питання щодо етичности таких 'програм'";
String loc_uriadowyj_kwartal7_dymnyk2="Лорд-протектор трохи нахилився вперед, тінь від нього торкнулася тебе на мить, тоді він сперся на ліву ногу і сказав: 'Авжеж, ми на раді довго обговорювали це питання, і врешті вирішили поступитися етичністю заради суспільного блага, та й не тільки поспільство матиме зиск з того, а й ці бідаки, бо ж їх ніхто не кидає, навпаки, ми спробуємо зробити з них свідомих громадян. Але твоє обурення буде зараховане до голосів проти подібних кампаній, я повідомлю про це на прийдешній нараді. Цілком можливо, твій аргумент, "+imia_geroia[0]+", і реакція стане тієї вагою, що схиляє шальці терезів на свій бік'.\n\n1. 'Дякую за можебність бути почутим'";
String loc_uriadowyj_kwartal7_kwasnyk_sheraz="Бувши в місті ти чимало бачив і чув про квас і квасників, про квасдім та базарні квасні будні, про столи з квасом і квас під столами. Иноді бувало вражіння, що деякі люди просто одержимі квасом, що п'ють йо' вони не заради гідрації тіла чи тамування спраги, а заради якоїсь компетенції, заради ефектів з-поза меж тілесних потреб. Ці думки ти наново виклав перед лордом-протектором нічого не приховавши, тоді він сказав: 'Таке положення квасу в Ойкуменополісові, "+imia_geroia[0]+", повторюю — продумане високою радою, все це спеціяльно спляновано для уздоровлення майбутніх поколінь, адже нині ми досліджуємо психофізичний вплив цього напою на вільному, як то кажуть наші мудрагелі, полі. Ми не обмежуємо споживання цього продукту і робимо висновки, та незабаром ці висновки стануть в основі генеральної доповіді, яка і вирішить подальшу долю квасу в нашому городі'.\n\n1. 'Це мені нетрудно'\n2. 'Такі соціяльні експерименти добром не скінчаються'";
String loc_uriadowyj_kwartal7_wyhid_="З Фортеці справедливошсти тя виводив той ж службовник у зеленому, що і проводив до кабінету міського голови, вже на порозі парадних дверів службовник тихим, запевняючим голосом сказав: 'Твій допуск, пане "+imia_geroia[0]+", до Урядового кварталу онулюється на 125 років, такі правила'. Тоді він зачинив двері, а ладник, що спостерігав за сценою збоку, опинився поруч і прохав тя спокійно виходити з кварталу.\n\n1. Спокійно виходити з кварталу";
String loc_lis_buw_ending_midb="Се було сутужніше аніж здавалося, але ти упокорив %ІМЯМОБА! Він завищав та кинувся назад до куща %ІМЯКУЩА, там він звернеться клубочком та стане невидимим доки не залиже ран. Ну а ти на місці бою знайшов дещо цікаве: %ІМЯІТЕМА — чудово, чи не так? Не треба гайнувати час на базарні торгування: гроші вже в кишені.\n\n1. Рухатися далі\n2. Вертатися поки можна";
String loc_lis_buw_ending="Се було сутужніше аніж здавалося, але ти упокорив %ІМЯМОБА! Він завищав та кинувся назад до куща %ІМЯКУЩА, там він звернеться клубочком та стане невидимим доки не залиже ран. Ну а ти на місці бою знайшов дещо цікаве: %ІМЯІТЕМА — скидається на унікальну річ, хтозна чи знадобиться вона ті у повсякденні, в будь-якому разі на базарі за неї можебно виручити якісь мідяки.\n\n1. Рухатися далі\n2. Вертатися поки можна";
String loc_lis_buw_ending_smittia="Се було сутужніше аніж здавалося, але ти упокорив %ІМЯМОБА! Він завищав та кинувся назад до куща %ІМЯКУЩА, там він звернеться клубочком та стане невидимим доки не залиже ран. Ну а ти на місці бою знайшов дещо 'цікаве': %ІМЯІТЕМА — скидається на... якесь сміття?! Навряд чи хтось запропонує за це і один зламаний мідяк.\n\n1. Рухатися далі\n2. Вертатися поки можна";
String loc_lis2_vovk="Це було не так просто, як здавалося, але ти упокорив "+mob_names[0]+"! Він завищав та кинувся назад до вовчих ягід, там він звернеться клубочком та стане невидимим доки не залиже ран. Ну а ти на місці бою знайшов дещо цікаве: "+items[1]+" — це епічна версія того дрючка, що ті подарував Ковалорн. Чудово! Ця штука відрізняється вищою щільністю матеріяла, вона твердіше, на ній більше клепок, і вона приємніше лежить в руці.\n\n1. Рухатися далі\n2. Вертатися поки можна";
String loc_lis3_lys="Не встигши зробити ще удар, лише замахнувшися, лис все зрозумів та підібгавши хвоста втік. Така йому буде навука на все життя: не флуоресцентувати перед очі чоловікові у темному лісі, не дратувати колбочки й палички людини. Це лис запам'ятає й передасть через ДНК (або через байки) нащадкам. Там, де крутився лис ви помітили блиск... о! — та це ж "+items[3]+"! Найкраща версія розкладаної палки з посиленими металевим кільцеванням сегментами."+"\nТим часом ви просувалися далі в ліс, бо назад шляху більше нема, дерева заступили шляхи вертання: тільки вперед, все, або нічого!\n\n1. Все! Або нічого! Вперед!";
String loc_lis4_vepr="Останній твій удар остаточно переконав дурне створіння відчепитися од тя, враз ти відчув полегшення, як то бува, коли нарешті з волосся удається витягти реп'ях. "+mob_names[2]+" заскавулів як собака та кинувся в листяну свою халабуду, розмітав її на всі боки та побіг далі: до нори ганьби, де знаходять прихисток усі зганьблені вепри, там йому життя і повіку. Ну а ти на місці кленової халабуди відшукав дивовижний артефакт: "+items[4]+"! Це пола паличка з мильного дерева, під дією зволоженого повітря випускає гроно переливчастих мильних бульбашок, що дезорієнтують противника.\nЛишився один крок до лісового дна. Тебе підхоплює вогкий вітер, змішаний із духом пожухлого листя, та штовхає вперед.\n\n1. Штовхатися вперед. На зустріч пригодам! На дно!";
String loc_lis5_grobol="Се було наче уві сні!.. Та може то й був сон? Інакше як тобі вдалося вижити в цьому марафоні смерті?! В цьому змаганні за виживання?! В цій боротьбі за місце на осонні харчового ланцюжка?!.. В Хоринісі, кажуть є альхеміки, вчені мужі, можеш потім у них спитатися про всі ці філософії, а поки що помилуйся як накиває п'ятами гробол: він осоромлений і ображений, тепер його всі будуть шпиняти за цю поразку, вивірки стануть кидатися по ньому жолудями, а хробаки лоскотати між пальців, гробол не втече од полум'яного сорому і всепробивної ганьби, доведеться йому никатися лісами до скону віку, така вже доля жорстоких хижаків!\nУважно озирнувшися, ти помітив на ліжакові гробола красиву траву: смарагдова, вона вилискувала в мороці голубими смужками, що перетікали поміж волокнами, як перетікає вода під кригою. Безумовно, тобі пощастило знайти "+items[5]+"! Це рідкісна лікарська рослина, але користатися нею тре' вміти.\nПід травою був камінь, а під каменем колода, під колодою дошка, а під дошкою коріння, ти розкрив коріння, і під ним виявив криштальну лінзу, а під нею полотняну завісу, а під нею ковану ляду із кільцем, потягнувши за кільце: підняв ляду й прочинив хід до підземного котиння, так було списано по табличці поруч: 'Котиться звідси, вам тутонь робить нема що!' Далебі вертатися не можна, попереду відвісна 10-кілометрова скеля, лишається стрибати отуди, в підземність...\n\n1. Стрибати, а що робити? І не таке бувало!";

//ТЕКСТОВИЙ БЛОК<<<

String invdesctext="Твої кишені наразі порожні";

String journal1="11.VI.1349: Якимось незбагненний чином я потрапив на острів. Із цим ще треба буде розбиратися, ну а поки що необхідно знайти притулок, ферму або місто, я не в тій формі щоб битися з гоблінами, та й вечерею мракоріса стати не хочеться.";
String journal2="+ Я хтів просто прогулятися лісом, назбирати шишок та послухати співи голубів, але зіштовхнувсі з безпримірною агресією диких тварин! Втім я зумів вибратися звідти живим й навіть із лутом!";
String journal3="+ Я погодився працювати на полі у Горбача і заробив за день декілька мідяків. Обідали солоною водою, що ж, краще аніж нічого. Тепер маю хоч якісь гроші. І на жаль, мозолі.";
String journal4="+ Вирішив не випробовувати долю на сій фермі та накивав п'ятами. Надто вже там всі, а чи підозрілі, а чи своєрідні. Так чи інак, я не вписуюсь в їхню тусовку.";
String journal5="+ Мене неправильно зрозуміли! Я буду всі ці 15 по 15 років і дальші 30 по 30, і скільки б їх ще не було, стану писати прокуророві та суддям, я доможуся передчасного звільнення!";
String journal6="+ Жорстокий світ із закритими кордонами і брамами, дрючками і решітками, покарами і вироками! Чому все так складно?! Я просто хотів у город, я не бажав нікому зла!";
String journal7="+ Я переступив поріг Ойкуменополіса, як поріг рідної домівки, тепер маю знайти притулок на ніч, не буду ж я спати на скамнах?! Мені стидно те, після тих виплат, що я вчинив на брамі.";
String journal8="+ Зустрівсі мені якийсь сонний дивак та розповів чи то бувальщину, чи то небувальщину, дістати те я не зумів, але маю дослідити теє, адже справи справедливошти мої фаворитні та неоминенні моїй принциповошсти. В мя є 5 днів до завершення інвестиґування.";
String journal9="+ Як то бува потрапляє під ногу мох, коли ти босий, чи під руку попуга, коли поговорити нема із ким, так мні втрапився мотель 'Галайдель' — безоплатний прихисток для всіх блукал, оплачується установа з муніципальних грошей, отже, кожен тут на рівних правах, навіть я!";
String journal10="+ На жаль багато людий обходяться без культури і тому їх нема чим стримати, вони здатні безпідставно на тя напасти, і щоб відчути сором з того, чують лише пиху. Та такі унікуми найчастіше втрапляють у свої ж тенета агресивности. Так сталося із мотельницею, що не мала змоги стримати емоції і обпеклася ними ж.";
String journal11="+ До жалю чимало людий водиться власними, а то й чужинними емоціями, з чого бува досада. Так сталося у 'Галайделі', мотельниця зустріла мя не посмішкою муніципальної службовниці, але портовою лайкою. Така провокація мя зачепила і я відповів симетрично. Надіюсь мотельниця взяла урок цим інцидентом, бо я узяв.";
String journal12="+ Я витримав покару і тепер вільний на всі боки.";
String journal13="+ Dixi.";
String journal14="+ Я не збираюся приставати на сі його умови, ще чого! Краще сидітиму в цій ямі, на-таке!";
String journal15="+ Мені вдалося розкрити загадку хропуна, який не хропить. Виявляється, він не хропить тоді, коли спить на бруківці! Треба розказати про це лорд-протектору.";
String journal16="+ Відчуваю як моя голова побільшала, як в неї втислося 1550 назв зірок над Ойкуменополісом, які видніють з опівночі та до світанку. Не знаю за віщо мні ця інформація, але хай буде.";
String journal17="+ Не знаю чому, але я вставив собі два ряди нержавних залізних зубів.";
String journal18="+ Я відсапав наче той тур за десятьох чоловіків, носив мішки, ящики і коробки в порту, за те пан Коморник великодушно нагородив мя сорок вісьма мідними монетами.";
String journal19="+ Мене не влаштували умови Коморника на складовську працю, він бажав запрягти мене на 24 години із двома перервами по 2 хвилини і заплатити за це непотребство 48 мідяків, хай сам тягає свої мішки та ящики!";
String journal20="+ Коморник схоже оскаженів од гандлів, пробував заярмити мене на цілу добу із двома 2-хвилинними 'перервами' за 48 мідяків! Думав я буду йому яком, тягатиму ящики і коробки зі склотарою за жменю монеток?! Ще чого! Я висказав цьому Скруджеві все що думаю про нього у відвертій формі.";
String journal21="+ Я дізнався чимало нового про всесвіт всередині квасдому, це унікальне місце, що відкидає реальність!";
String journal22="+ У квасдомі мене побили за правду! Прикро за таких людий...";
String journal23="+ У квасдомі мене сильно побили за відмову випити квас. Що за люди!";
String journal24="+ Ладник допоміг поставити квасдомівців на місце. Надіюсь вони усвідомили прикрість власних вчинків!";
String journal25="+ Прогулявся по пляжу, натрапив на якусь халабуду під скелею, все там засмічено мушлями, посудом, цурками. Дивно.";
String journal26="+ Добра була пригода у портові, я чимало дізнався про побут ойкуменополісян, про те як вони працюють і відпочивають. Не менше я взнав й про себе.";
String journal27="+ З дитинства не люблю густий дим!";
String journal28="+ Я вирішив вилити той пекельний напій, що спартолив Панацео йому в обличчя. Хтозна, може це врятувало мні життя.";
String journal29="+ Я все ж наважився випити ліки Панацео, і хоч одразу мені було смертельно сутужно, та потім відпустило і я знову дихав вільно та почувся живим.";
String journal30="+ Альхемік Панацео платить хороші гроші за рослини, якщо мні пощастить знайти:\n1. Нехворай (90)\n2. Отруйник (50)\n3. Ядерний сонях (250)\n4. Протуберанцій (300)\n5. Криштальник (10 лз)\n6. Золотовій (10 фй)\n7. Скві аві ваі (100 фй)\nТо зможу розбагатіти!";
String journal31="+ Панацео хотів був поставити на мені дослід, але я відмовився, життя та здоровля дорожчі за якісь мідяки!";
String journal32="+ Я вирішив не розповідати нікому про кінець світу, за який каже Панацео.";
String journal33="+ Я прийшов на базар і одразу пригадав староминулу мудрість: 'якщо довго вдивлятися у базар, базар вдивлятиметься у тебе'.";
String journal34="+ Не знаю чи це щось означує, та пан Квасник, щоправда у пориванні гніву, сказав мені, що справедливість я можу знайти там 'де ростуть квіти'. ";
String journal35="+ Було ж в мя передчуття: не підходити до тих столів!";
String journal36="+ Мні стало відомо де шукати в цьому місті справедливошти: там де ростуть квіти. Так сказав пан Квасник, щоправда не знаю наскільки йому можна довіряти. ";
String journal37="+ Схоже пан Димник із містером Порізаком випускає кишки всім надто розумним, хто розкрив їхні брудні маніпуляції зі здоровлям містян. Лорду-протектору се має бути цікавим.";
String journal38="+ Складно достукатися до людей навіть з помосту шибениці.";
String journal39="+ Я отримав ексклюзивну перепустку, з якою мене мають допустити до Урядового кварталу хай би там що!";
String journal40="+ Пляшник Склотаренко платить чималі гроші за склотару, коли мі пощастить знайти:\n1. Лікувальний еліксир (400)\n2. Еліксир сну (600)\n3. Літальний еліксир (850)\n4. Еліксир Корисности (1300)\n5. Еліксир Універсального знання (520 лз)\n6. Еліксир Користі Ойкуменополісові (800 лз)\n7. Еліксир Квасало (905 фй)\nТо зможу розбагатіти!";
String journal41="+ Альхемік Панацео здатен придбати 6 різних грибів набором за 1350 лизардів:\n1. Вусики трупороба\n2. Бородата шапка\n3. Підземний гном\n4. Камінь-скорпіонів\n5. Фуга-геге\n6. Люмінісцентник";
String journal42="+ Нарешті я потрапив до Урядового кварталу! Що ж, подивимося що тут за архітектури та люди...";
String journal43="+ Осьо вона яка — оселя справедливости Ойкуменополісу, саме тут засідає лорд-протектор, намісник і володар цього міста, що ж, зараз усе й вирішиться, або пан, або пропав!";
String journal44="+ Я недостатньо підготувавсі до стрічі із лордом-протектором, червонокостюмний службовник пояснив: наступна спроба стане вирішальною.";
String journal45="+ Мені вдалося переконати лорда-протектора виступити на моєму боці і захистити нещасного галайду. Начальник пообіцяв вже завтра владнати сю справу.";
String journal46="+ Сомнамбуличний галайда нарешті знайшов спокій, тепер і мні буде спокійно спати.";

//Для квестів існує дві гілки: в першій квести помічені до виконання, а в другій виконані, масиві для них також різняться.
String quest1="□ Потрапити до Ойкуменополіса.";
String quest1x="√ Потрапити до Ойкуменополіса.";
String quest2="\n□ Знайти притулок 'Галайдель'.";
String quest2x="\n√ Знайти притулок 'Галайдель'.";
String quest3="\n□ Помогти сомнамбуличному галайдові.";
String quest3x="\n√ Помогти сомнамбуличному галайдові.";
String quest4="\n□ Вчинити Ойкуменополісу вагому користь.";
String quest4x="\n√ Вчинити Ойкуменополісу вагому користь.";
String quest5="\n□ Розкрити звірства альхеміка проти людей.";
String quest5x="\n√ Розкрити звірства альхеміка проти людей.";
String quest6="\n□ Доповісти лорду-протектору про кінець світу від Панацео.";
String quest6x="\n√ Доповісти лорду-протектору про кінець світу від Панацео.";
String quest7="\n□ Дістатися Урядового кварталу.";
String quest7x="\n√ Дістатися Урядового кварталу.";

String[] quests={quest1, quest2, quest3, quest4, quest5, quest6, quest7};
String[] questsx={quest1x, quest2x, quest3x, quest4x, quest5x, quest6x, quest7x};
boolean[] quests_boo={false, false, false, false, false, false, false};
boolean[] questsX_boo={false, false, false, false, false, false, false};

//Елементи "поясу" на якому вибірається зброя
JRadioButton kvadromitkaPD1=new JRadioButton("", false);
JRadioButton kvadromitkaPD2=new JRadioButton("", false);
JRadioButton kvadromitkaPD3=new JRadioButton("", false);
JRadioButton kvadromitkaPD4=new JRadioButton("", false);
JRadioButton kvadromitkaPD5=new JRadioButton("", false);
JRadioButton kvadromitkaPD6=new JRadioButton("", false);
JRadioButton kvadromitkaPD7=new JRadioButton("", false);
JRadioButton kvadromitkaPD8=new JRadioButton("", false);
JRadioButton kvadromitkaPD9=new JRadioButton("", false);
JRadioButton kvadromitkaPD10=new JRadioButton("", false);

ButtonGroup radioGroup=new ButtonGroup();

JPanel poleD1_panel=new JPanel(new GridLayout());
JPanel poleD2_panel=new JPanel(new GridLayout());
//всі операції з мітками можна проводити через елементи масиву, це необхідно заради оптимізації щоб уникнути непотрібного коду: просто заганяєш масив в цикл і робиш що треба.
JRadioButton[] km_nazvy={kvadromitkaPD1, kvadromitkaPD2, kvadromitkaPD3, kvadromitkaPD4, kvadromitkaPD5, kvadromitkaPD6, kvadromitkaPD7, kvadromitkaPD8, kvadromitkaPD9, kvadromitkaPD10};

DefaultListModel belt_model=new DefaultListModel(); //відповідає за маніпуляції з елементами списку
JList belt_list=new JList(belt_model); //безпосередньо лист, який використовує модельний обжект для відображення елементів
JPanel belt_panel=new JPanel(new GridLayout());

JProgressBar lvlbar=new JProgressBar(0, 100);
JPanel lvlbar_panel=new JPanel(new GridLayout());
JProgressBar hpbar=new JProgressBar(0, oz_gg);
JPanel hpbar_panel=new JPanel(new GridLayout());
JProgressBar hpbar_mob=new JProgressBar(0, 100);
JPanel hpbar_panel_mob=new JPanel(new GridLayout());

JLabel loter=new JLabel("Поточна локація: "+locs[0],JLabel.CENTER);
JPanel loter_panel=new JPanel(new GridLayout());

//текстові поля додаються в скрольну область
JTextArea wide_field=new JTextArea(); //тут можна здати два розміри для rows,columns, але якщо користується скольне поле із вказанням піксельних або яких там розмірів, тут можна йти повз. Йти далі тут тре ще тому, що при вказанні ровсів,колумнів — ініціюється скролбар без контенту, тобто тексту в полі тексту може не бути, чи два слова, але верт. скролбар все одно з'являється, тому що ровси-солумни
//JTextArea inv_field=new JTextArea();
JTextArea invdesc_field=new JTextArea(); //текстове поле для відображення опису елементу інвентарного списку
JTextArea quest_field=new JTextArea();
JTextArea journal_field=new JTextArea();
JTextArea cog_field=new JTextArea();
JTextArea ggbb_f=new JTextArea();

DefaultListModel invlistmodel=new DefaultListModel(); //відповідає за маніпуляції з елементами списку: remove(); getSize();
JList inv_fieldlist=new JList(invlistmodel); //безпосередньо лист, який використовує модельний обжект для відображення елементів

//скрольна область для вкладок, має містити якийсь контент, обжект для відображення
JScrollPane areaScrollPane=new JScrollPane(startowaPanelb); //саме сюди — в скрольне поле має додаватися поле тексту
JScrollPane invScrollArea=new JScrollPane(inv_fieldlist); //лист міститься в скрольному контейнері (цьому), і вже цей конт. додається до розділеного (спліт) контейнеру рядком нижче, в такому разі при збільшенні листа: з'являється скрол
JSplitPane invArea=new JSplitPane(JSplitPane.HORIZONTAL_SPLIT,invScrollArea,invdesc_field); //першим компонентом має бути лист, а другий, певно, текстфілд для відображення обраного пункту списку
JScrollPane questArea=new JScrollPane(quest_field);
JScrollPane journalArea=new JScrollPane(journal_field);
JScrollPane settingsArea=new JScrollPane(progruPanelb);
JScrollPane ggbb_a=new JScrollPane(ggbb_f);

JButton btn1=new JButton(null, null);
JButton btn2=new JButton(null, null);
JButton btn3=new JButton(null, null);
JButton btn4=new JButton(null, null);
JButton btn5=new JButton(null, null);
JButton btn6=new JButton(null, null);
JButton btn7=new JButton(null, null);

JPanel btn_panel=new JPanel(new GridLayout());

JButton[] btns_arr={btn1, btn2, btn3, btn4, btn5, btn6, btn7};
Boolean[] btns_arr_boo={false, false, false, false, false, false, false,};

JTabbedPane tabbedPane=new JTabbedPane();

//BTNS NAMES
String start0="Почнімо!";

	// Define an inner class to handle WindowEvent of this Frame
	//Відстежує стан вікна гри
	public class VikonnyjNagliadach implements WindowListener {
      // Called back upon clicking close-window button
      @Override
      public void windowClosing(WindowEvent evt) {
         System.exit(0);  // Terminate the program
      }

      // Not Used, BUT need to provide an empty body to compile.
      @Override public void windowOpened(WindowEvent evt) {}
      @Override public void windowClosed(WindowEvent evt) {}
      // For Debugging
      @Override public void windowIconified(WindowEvent evt) { //System.out.println("Window Iconified");
		   }
      @Override public void windowDeiconified(WindowEvent evt) { //System.out.println("Window Deiconified"); 
		  }
      @Override public void windowActivated(WindowEvent evt) {Zatemnennia(false); if(chas_myzyky_b){chas_muz.play(audiofon, 0.1f, true);} }
      @Override public void windowDeactivated(WindowEvent evt) {Zatemnennia(true); if(chas_myzyky_b){chas_muz.pause();}} }

//*************************************************************************************************
// Constructor to setup the GUI components and event handlers
	public TaZaradySpravedlyvoshty() {
			
		//є масиви що поєднані суттю справи, критично важливо мати їх без розмірових помилок
		////System.out.println("mob_names len: "+mob_names.length+" | mob_urn len: "+mob_urns.length+" | mob_hps len: "+mob_hps.length+" | mob_boj len: "+mob_boj.length);
		
		setLayout(new BoxLayout(this, BoxLayout.PAGE_AXIS)); // "super" frame sets to FlowLayout
		
		wide_field.setEditable(false);	//текст не можна редагувати
		wide_field.setFont(new Font("Serif",Font.PLAIN, 20)); //Font.ITALIC, PLAIN | Serif, SansSerif, Monospaced, DialogInput, Dialog
		wide_field.setMargin(new Insets(10,10,10,10));	//відступ тексту з усіх боків
		wide_field.setWrapStyleWord(true); // setWrapStyleWord(true) | setLineWrap
		wide_field.setLineWrap(true);	//перенос рядків
		startowaPanelb.setEditable(false);
		startowaPanelb.setOpaque(true);
		wide_field.setBackground(Color.WHITE);	//колір тла
		wide_field.setForeground(Color.BLACK); //колір тексту
		//Параметр стосується фіксованої ширини текстового поля, актуальний тільки якщо використовувати панель panelbne_pole_tekstu
		//wide_field.setMaximumSize(new Dimension(435, Integer.MAX_VALUE));
		quest_field.setLineWrap(true);
		quest_field.setEditable(false);
		quest_field.setBackground(Color.BLUE);
		quest_field.setForeground(new Color(255, 255, 255));
		quest_field.setFont(new Font("SansSerif",Font.PLAIN, 16));
		journal_field.setLineWrap(true);
		journal_field.setEditable(false);
		journal_field.setFont(new Font("Serif",Font.PLAIN, 16));
		journal_field.setBackground(new Color(255,230,235));
		
		//настроювання списку інвентаря
		inv_fieldlist.setSelectionMode(ListSelectionModel.SINGLE_SELECTION);
		inv_fieldlist.setLayoutOrientation(JList.HORIZONTAL_WRAP); //VERTICAL_WRAP HORIZONTAL_WRAP
		inv_fieldlist.setVisibleRowCount(-1); //з таким значення відображається макс. кіль. елементів
		inv_fieldlist.setBackground(Color.YELLOW);
		inv_fieldlist.setForeground(new Color(0, 0, 0));
		inv_fieldlist.addListSelectionListener(this);
		
		//настроювання поля опису елементу інвентарю
		invdesc_field.setEditable(false);
		invdesc_field.setFont(new Font("Monospaced",Font.PLAIN, 14));
		invdesc_field.setLineWrap(true);	
		invdesc_field.setBackground(Color.ORANGE);
		invdesc_field.setForeground(new Color(0, 0, 0));
		invdesc_field.setText(invdesctext);
		
		invlistmodel.addElement(""); //порожній для ініціялізації списку, щоб працював пошук по списку на прийомі дропу
		
		//настроювання поля опцій
		progruPanelb.setEditable(false);
		progruPanelb.setOpaque(true);
		/*progruPanelb.setFont(new Font("Sans-Serif",Font.PLAIN, 14));
		progruPanelb.setLineWrap(true);	
		progruPanelb.setBackground(Color.LIGHT_GRAY);
		progruPanelb.setForeground(new Color(0, 0, 0));
		progruPanelb.setText("Поле опцій");*/
		
		//areaScrollPane.setVerticalScrollBarPolicy(JScrollPane.VERTICAL_SCROLLBAR_AS_NEEDED);
		areaScrollPane.setPreferredSize(new Dimension(475, 660));
		invScrollArea.setPreferredSize(new Dimension(475, 660));
		//invArea.setPreferredSize(new Dimension(475,660));
		invArea.setOneTouchExpandable(true);
		invArea.setDividerLocation(225);
		//invArea.setResizeWeight(1);
		//Provide minimum sizes for the two components in the split pane
		Dimension minimumSize=new Dimension(100, 0);
		inv_fieldlist.setMinimumSize(minimumSize);
		invdesc_field.setMinimumSize(minimumSize);
		
		//додавання кнопок: тітул, значок, контент, опис
		//мнемонік: місце в своєму якомусь там масиві, назва кнопки-комбінації, напр.: KeyEvent.VK_1 це ALT+1
		tabbedPane.addTab("Вистава", null, areaScrollPane,"Та заради справедливошти! | Alt+1");
		tabbedPane.setMnemonicAt(0, KeyEvent.VK_1);
		tabbedPane.addTab("Кишені", null, invArea,"Твій крам | Alt+2");
		tabbedPane.setMnemonicAt(1, KeyEvent.VK_2);
		//tabbedPane.addTab("Мапа", null, mapArea,"Де я є?! | Alt+3");
		//tabbedPane.setMnemonicAt(2, KeyEvent.VK_3);
		tabbedPane.addTab("Квести", null, questArea,"Ціль життя, мета буття | Alt+3");
		tabbedPane.setMnemonicAt(2, KeyEvent.VK_3);
		tabbedPane.addTab("Журнал", null, journalArea,"Твої записки | Alt+4");
		tabbedPane.setMnemonicAt(3, KeyEvent.VK_4);
		tabbedPane.addTab("Про гру", null, settingsArea,"Хто та що | Alt+5");
		tabbedPane.setMnemonicAt(4, KeyEvent.VK_5);
		
		//Ця штука слідкує за вкладками, коли перемикаєшся не на Виставну: кнопки вимикаються, водночас запам'ятовується порядок кнопок, щоб потім відновити на Виставі їх правильно, приміром: 1-офф, 2-офф, 3-он, 4-он
		tabbedPane.addChangeListener(new ChangeListener() {
            @Override
            public void stateChanged(ChangeEvent e) {
                JTabbedPane sourceTabbedPane=(JTabbedPane) e.getSource();
                int selectedIndex=sourceTabbedPane.getSelectedIndex();
                //System.out.println("Вибрано вкладку: " + selectedIndex);
                
                if(pochatok_wystawy){
					if(selectedIndex!=0){
						if(!wystawna_rich){
							for(int i=0; i<btns_arr.length; i++){if(btns_arr[i].isEnabled()){btns_arr_boo[i]=true;}}
								wystawna_rich=true;
								knopky(0);}}
						else{//System.out.println("knopky_tmp else: " + knopky_tmp); 
							wystawna_rich=false; 
							for(int i=0; i<btns_arr.length; i++){if(btns_arr_boo[i]){btns_arr[i].setEnabled(true); btns_arr_boo[i]=false;} else{btns_arr[i].setEnabled(false);} }} } }});
						
		add(tabbedPane); //до фрейму додається скрольне поле, в яке вже додано поле текстове	

		poleD1_panel.add(kvadromitkaPD1); poleD1_panel.add(kvadromitkaPD2); poleD1_panel.add(kvadromitkaPD3); poleD1_panel.add(kvadromitkaPD4);
		poleD1_panel.add(kvadromitkaPD5);
		//kvadromitkaPD1.setBackground(null);
		//kvadromitkaPD1.setForeground(new Color(0,0,0));
		//poleD1_panel.setBorder(BorderFactory.createLineBorder(Color.BLACK, 2));
		//kvadromitkaPD1.setToolTipText("Click this button to disable the middle button.");
		
		poleD2_panel.add(kvadromitkaPD6); poleD2_panel.add(kvadromitkaPD7); poleD2_panel.add(kvadromitkaPD8); poleD2_panel.add(kvadromitkaPD9);
		poleD2_panel.add(kvadromitkaPD10);
		//kvadromitkaPD2.setBackground(new Color(255,255,0));
		//kvadromitkaPD2.setForeground(new Color(0,0,0));
		
		//add(poleD1_panel); add(poleD2_panel);
		
		kvadromitkaPD1.addActionListener(this);
		kvadromitkaPD2.addActionListener(this);
		kvadromitkaPD3.addActionListener(this);
		kvadromitkaPD4.addActionListener(this);
		kvadromitkaPD5.addActionListener(this);
		kvadromitkaPD6.addActionListener(this);
		kvadromitkaPD7.addActionListener(this);
		kvadromitkaPD8.addActionListener(this);
		kvadromitkaPD9.addActionListener(this);
		kvadromitkaPD10.addActionListener(this);
		
		radioGroup.add(kvadromitkaPD1);
		radioGroup.add(kvadromitkaPD2);
		radioGroup.add(kvadromitkaPD3);
		radioGroup.add(kvadromitkaPD4);
		radioGroup.add(kvadromitkaPD5);
		radioGroup.add(kvadromitkaPD6);
		radioGroup.add(kvadromitkaPD7);
		radioGroup.add(kvadromitkaPD8);
		radioGroup.add(kvadromitkaPD9);
		radioGroup.add(kvadromitkaPD10);
		
		for(int i=0; i<km_nazvy.length; i++){km_nazvy[i].setEnabled(false);}

		loter.setText("");
		loter_panel.add(loter);
		//add(loter_panel);
		
		//є варіянт з відображенням досвіду на панелі у відсотках 0-100, або наочно в кількості досвіду + ХР
		//перший варіянт універсальний, тобто необмежений по суті, другий обмежений довжиною панельної смужки, адже значення досвіду (очкі ХР) може бути величезним: мільярди, трильярди тощо.
		//думаю краще все ж відсотки, а наочні значення винести до хінту або до вкладки "персонаж"
		lvlbar.setMaximum(baseLvlXp);
		lvlbar.setValue(0);
		lvlbar.setStringPainted(true);
		lvlbar.setString(lvlbar.getValue()+" ОД");
		lvlbar_panel.add(lvlbar);
		lvlbar.setToolTipText(">"+baseLvlXp+" ОД"); //можна відображати в форматі "від-до" або "до" (>1000 XP)
		//add(lvlbar_panel);
		
		hpbar.setValue(oz_gg);
		hpbar_panel.add(hpbar);
		hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ"); //можна відображати в форматі "від-до" або "до" (>1000 XP)
		//add(hpbar_panel);
		
		btnList=new BtnListener();
		
		btn1.setLabel(start0);
		btn1.setEnabled(true);
		btn2.setEnabled(false);
		btn3.setEnabled(false);
		btn4.setEnabled(false);
		btn5.setEnabled(false);
		btn6.setEnabled(false);
		btn7.setEnabled(false);
		
		//btn1.setMnemonic(KeyEvent.VK_Z);
		//btn1.setDisplayedMnemonicIndex(KeyEvent.VK_Z);

		//btn2.setMnemonic(KeyEvent.VK_Q);
		//btn2.setDisplayedMnemonicIndex(KeyEvent.VK_Q);
		btn1.setActionCommand("btn1");
		btn2.setActionCommand("btn2");
		btn3.setActionCommand("btn3");
		btn4.setActionCommand("btn4");
		btn5.setActionCommand("btn5");
		btn6.setActionCommand("btn6");
		btn7.setActionCommand("btn7");
		godytbsia_knp.setActionCommand("godytbsia_knp");
		//btn1.setLabel("1");
		btn2.setLabel("2"); 
		btn3.setLabel("3"); 
		btn4.setLabel("4"); 
		btn5.setLabel("5"); 
		btn6.setLabel("6"); 
		btn7.setLabel("7"); 
		
		btn1.addActionListener(btnList); btn2.addActionListener(btnList); btn3.addActionListener(btnList); btn4.addActionListener(btnList); btn5.addActionListener(btnList); btn6.addActionListener(btnList); btn7.addActionListener(btnList); godytbsia_knp.addActionListener(btnList);
		
		btn_panel.add(btn1);
		add(btn_panel);
        
		//special start
		poleVvodu.setLayout(new FlowLayout()); pole_imeni.setText("Геро Героєнко");
		poleVvodu.add(pole_imeni); poleVvodu.add(godytbsia_knp);

		// Додаємо обробник подій для гіперпосилань
		//На стартовій панелі (і у вкладці Про гру) є НТМЛьний текст з лінками, щоб вони були клікабельні, існує цей слухач.
        startowaPanelb.addHyperlinkListener(e -> {
            if (e.getEventType()==HyperlinkEvent.EventType.ACTIVATED) {try {Desktop.getDesktop().browse(new URI(e.getURL().toString()));} catch (Exception ex) {ex.printStackTrace();}}});
		progruPanelb.addHyperlinkListener(e -> {
            if (e.getEventType()==HyperlinkEvent.EventType.ACTIVATED) {try {Desktop.getDesktop().browse(new URI(e.getURL().toString()));} catch (Exception ex) {ex.printStackTrace();}}});
            
		chas_muz=new ChasMuzyky();
		
		//Заповнюємо масив переходів з карти локацій, з карти кнопок, з карти переходів
		//Як читати готовий масив: lokaciji[x] -- вказують на локацію, lokaciji[][x] -- вказують на кнопку
		//Особливість: на 0 кнопці завжди знаходиться значіння локації, наприклад: lokaciji[1][0] віддає 1, поточну локацію
		//Фактичні кнопки розміщені на індексах lokaciji[x][1-7]
		//Особливість 2: 0 локація завжди порожня, тобто простір lokaciji[0][0-7] займають нулі, оскільки в файлі mapalokiw.txt перший (0-й) рядок є інформаційним
		//Важливо! OSTLOK вказує на ластову локацію, і якщо фактичних локів більше, буде проблема, тому не треба забувати оновлювати OSTLOK.
		//OSTLOK можна вказати більшим за фактичну кількість локів, це впливає тільки на загальний розмір масиву, тому задля оптимізації не варто вказувати завеликі значіння, щоб масив не формувався довго.
		try (BufferedReader reader=new BufferedReader(new FileReader("mapalokiw.txt"))) {
			String riadok;
			String[] masywnyjRiadok;
			potochna_loka=0;
			for (int i=0; i<OSTLOK; i++) {riadok=reader.readLine();

				if(riadok!=null){
					
					System.out.println("riadok: "+riadok+"\ti: "+i);
					
					if(i>0){masywnyjRiadok=riadok.split("\t").clone();
										
					lokaciji[i][0]=Integer.parseInt(masywnyjRiadok[0]);
					lokaciji[i][1]=Integer.parseInt(masywnyjRiadok[1]);
					lokaciji[i][2]=Integer.parseInt(masywnyjRiadok[2]);
					lokaciji[i][3]=Integer.parseInt(masywnyjRiadok[3]);
					lokaciji[i][4]=Integer.parseInt(masywnyjRiadok[4]);
					lokaciji[i][5]=Integer.parseInt(masywnyjRiadok[5]);
					lokaciji[i][6]=Integer.parseInt(masywnyjRiadok[6]);
					lokaciji[i][7]=Integer.parseInt(masywnyjRiadok[7]);} }
				else{
					for(int y=0; y<OSTLOK; y++){
						for(int z=0; z<MAXBTNS; z++){System.out.println("lokaciji["+y+"]["+z+"]: "+lokaciji[y][z]);} }
						
						break;} } } catch (IOException e) {System.out.println("Nemozhlywo prochytaty fajl: " + e.getMessage());}
						
		//Коли вікно гри виходить з фокусу, воно затемнюється, тут можна регулювати колір затемнення.
		TinbowaPanelb=new Window(this);
		TinbowaPanelb.setBounds(getBounds());
        TinbowaPanelb.setBackground(new Color(0, 0, 0, 75)); // чорний з прозорістю
        TinbowaPanelb.setAlwaysOnTop(false);
        //TinbowaPanelb.setSize(getSize());
        //TinbowaPanelb.setLocation(getLocation());
		//TinbowaPanelb.setFocusableWindowState(false); // ← ключове!
        TinbowaPanelb.setVisible(false); // спочатку прихована
        
        // Робимо її поверх усього іншого
        //this.getLayeredPane().add(TinbowaPanelb, JLayeredPane.POPUP_LAYER);
        
		//btn1.setEnabled(false);
		setTitle("Та заради справедливошти!"); // "super" Frame sets title
		setSize(500, 580);         // "super" Frame sets initial size
		setVisible(true);          // "super" Frame shows
		setResizable(true); //Вікно гри можна розтягувати, контент буде адаптуватися відповідно (зокрема малюнок).
		addWindowListener(new VikonnyjNagliadach());}
        
	//Метод затемнення, працює автоматично.
	public void Zatemnennia(boolean pokazaty){
		TinbowaPanelb.setBounds(getBounds());
        TinbowaPanelb.setVisible(pokazaty);}
                
	//Автоматичний метод відображення картинки. Це доволі складний метод, налаштовувати який треба з обережністю.
	//По суті метод відповідає за формування опису локації, позаяк приймає текст опису і розміщує його під картинкою з відповідним до загального форматуванням
	//Кожна картинка клікабельна: коли на неї натискаєш, розкривається вікно з повнорозмірною картинкою зверху усіх вікон.
	public void MaljunkowyjEpizod(String maljunok, String text) {
		zobrazh=maljunok;

		JPanel panel=new JPanel();
		panel.setLayout(new BoxLayout(panel, BoxLayout.Y_AXIS));
		panel.setBackground(Color.WHITE);

		try {
			// === 1. Завантаження та масштабування зображення ===
			//BufferedImage oryginalbneZobrazhennia=ImageIO.read(new File(maljunok));
			BufferedImage oryginalbneZobrazhennia=this.getImage((maljunok));
			//int shyryna_mal=this.getWidth()>0?this.getWidth()-50:250; // трішки менше, щоб не торкалось країв
			int shyryna_mal=this.getWidth()-80; // трішки менше, щоб не торкалось країв
			int vysota_mal=(int)((double)oryginalbneZobrazhennia.getHeight()*shyryna_mal/oryginalbneZobrazhennia.getWidth()); // зберігаємо пропорції
			
			Image gotowyj_maljunok=oryginalbneZobrazhennia.getScaledInstance(shyryna_mal, vysota_mal, Image.SCALE_SMOOTH);

			JLabel imageLabel=new JLabel(new ImageIcon(gotowyj_maljunok));
			imageLabel.setCursor(Cursor.getPredefinedCursor(Cursor.HAND_CURSOR));
			imageLabel.setAlignmentX(Component.LEFT_ALIGNMENT);
			
			//Тиск по картинці: розгорт на фулл
			imageLabel.addMouseListener(new MouseAdapter() {
				@Override
				public void mouseClicked(MouseEvent e) {
					JFrame imageFrame=new JFrame("Огляд деталів");
					imageFrame.setDefaultCloseOperation(JFrame.DISPOSE_ON_CLOSE);
					imageFrame.setSize(oryginalbneZobrazhennia.getWidth(), oryginalbneZobrazhennia.getHeight());
					imageFrame.add(new JScrollPane(new JLabel(new ImageIcon(oryginalbneZobrazhennia))));
					imageFrame.setLocationRelativeTo(null);
					imageFrame.setAlwaysOnTop(true);
					imageFrame.setVisible(true);} });

			// Обгортка, яка фіксує ширину картинки
			JPanel imageWrapper=new JPanel(new BorderLayout());
			imageWrapper.setOpaque(false);
			imageWrapper.setMaximumSize(new Dimension(shyryna_mal, vysota_mal));
			imageWrapper.add(imageLabel, BorderLayout.WEST);
			panel.add(imageWrapper);
			panel.add(Box.createRigidArea(new Dimension(0, 10))); // відступ
			//додача тексту
			//wide_field.setAlignmentX(Component.LEFT_ALIGNMENT);
			wide_field.setMaximumSize(new Dimension(this.getWidth()-40, Integer.MAX_VALUE));
			panel.add(wide_field);} catch (Exception e) {e.printStackTrace();}

		areaScrollPane.setViewportView(panel); shyrokepole=false;}
		
	//Якщо картинки нема в кеші, то вона візьметься з диску і покладеться в кеш.
	public BufferedImage getImage(String path) throws Exception {
		if (cache.containsKey(path)) {System.out.println("вертає картинку з кешу"); 
			return cache.get(path);}
	BufferedImage oryginalbna_kartynka=ImageIO.read(getClass().getResourceAsStream("/"+path));
	cache.put(path, oryginalbna_kartynka);
	System.out.println("вертає картинку з диску"); 
	return oryginalbna_kartynka;}
    
	public void tabsSluhach(ActionEvent e) {}
	
	//Слухач визначає який ітем вибрано (vybranyjItem) в списку ітемів під час бою
	public void actionPerformed(ActionEvent e) {
		for(int i=0; i<items.length; i++){
			if(items[i].equals(e.getActionCommand())){vybranyjItem=i; break;}
			else{vybranyjItem=0;}
			for(int j=0; j<km_nazvy.length; j++){km_nazvy[j].setEnabled(false);} }}

	//This method is required by ListSelectionListener. kilDropu_materialy[iakistbDropu][indexDropu[i]]
	//Метод для інтеракції з інвентарем. Тут відбувається багато всього. Найперша функція методу: вивести опис вибраного предмету.
	//Для виводу опису використовується етерний масив items_eter, в якому зберігаються реальні індекси предметів на нереальних (тимчасових) індексах інвентаря.
	//Таким чином, для виводу опису потрібно вказати реальний індекс предмету, і якщо він є в інвентарі: опис буде показано.
	//Описи беруться з масиву описів предметів items_descr, і починаються з 1-го, а не 0-го індексу. Індекс предмета в масиві описів, звісно має відповідати реальному індексу предмета в масиві предметів.
	//Наприклад індекс Мідяків 6, в масиві описів є item5 на 6 індексі, саме він буде відображений для Мідяків в інвентарі + до нього додається кількість мідяків через відображення значення змінної midiaky.
	//В методі також спливають діалоги, якщо це особливий предмет, приміром для одягу різного клясу показується діалог, що пропонує вибрати: надягнути се вбрання, чи ні. Якщо гравець погоджується, цей предмет вилучається з інвентаря, міняється колір тексту, показується результативний діалог, що враховує локацію ГГ.
	//В методі активуються спеціяльні предмети, приміром, елексіри для бою, або допоміжні бойови речі. Так, якщо активовано Місячне насіння, misiachne_nasinnia=true і міняється колір тексту, виводиться результативний діалог, а перемикач misiachne_nasinnia буде задіяно в методі ЕкшнБою для реальних наслідків.
	//Бойові ітеми не активуються поза боєм, для цього існує спеціяльна перевірка, також в прикладі бої проти людей і звірів різняться, проти людей не можна застосувати ті предмети, які застосовуються проти звірів.
	//Деякі речі можуть мати глобальний вплив на гру, сюжет. У прикладі є Елексір вагомої користі Ойкуменополісові, коли гравець йо' випиває, то отримує +10 к "вагомій_користі_о", сума якого у фіналі гри визначає результат: wypyw_elek_korysti_o=true; wagoma_korystb_o+=10; 
	//Метод має приклад запобіжника проти повторного пиття елексіру, якщо він щойно був випитий.
    public void valueChanged(ListSelectionEvent e) {
        if (e.getValueIsAdjusting()==false) {
            //No selection
            if (inv_fieldlist.getSelectedIndex()==-1){} 
            //коли тиснеш на ітем в инвентарі
            else if(items_boo[inv_fieldlist.getSelectedIndex()]){
				//поки не наю як запускати код під час перемикання між вкладками, тому така милиця тут щоб знімати вибір з ітема в інвентарю, бо під час оновлення значення, приміром грошей, важливо ще раз натиснути на ітем щоб побачитионовлену інфу
				InventarnaPawza invDeal=new InventarnaPawza("Dynamyka inventaria");
				invDeal.start();
				
				invdesc_field.setText(items_descr[items_eter[inv_fieldlist.getSelectedIndex()]]);
				if(items_eter[inv_fieldlist.getSelectedIndex()]==6){invdesc_field.setText(invdesc_field.getText()+midiaky+".");} 
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==16){invdesc_field.setText(invdesc_field.getText()+lyzardy+".");} 
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==17){invdesc_field.setText(invdesc_field.getText()+fbjordy+".");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==27){int diag=JOptionPane.showOptionDialog(this,"Надягнути вбрання S-клясу?","Рішення S-клясу",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[27], 1); ObslugaOdiagu(4); wide_field.setForeground(new Color(0,0,110)); /*NoweyjKolir(true, 0,0,110);*/ if(jaTut!=3&jaTut!=6&jaTut!=9&jaTut!=11){JOptionPane.showMessageDialog(this,"Ти перевдягнувся прямо на вулиці, а що?\nХай всі бачать як народжується модний чоловік!\nВиглядаєш sупер!");} else{JOptionPane.showMessageDialog(this,"Ти завбачливо зайшов у приміщення щоб перевдягнутися, але тебе всі побачили.\nTа і хай бачать як народжується новий модний чоловік!\nВиглядаєш sупер!");} return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==26){int diag=JOptionPane.showOptionDialog(this,"Надягнути вбрання III клясу?","Рішення III клясу",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[26], 1); ObslugaOdiagu(3); wide_field.setForeground(new Color(110,0,50)); /*NoweyjKolir(true, 110,0,50);*/ if(jaTut!=3&jaTut!=6&jaTut!=9&jaTut!=11){JOptionPane.showMessageDialog(this,"Ти перевдягнувся прямо на вулиці, а що?\nХай всі бачать як народжується модний чоловік!\nВиглядаєш 3упер!");} else{JOptionPane.showMessageDialog(this,"Ти завбачливо зайшов у приміщення щоб перевдягнутися, але тебе всі побачили.\nTа і хай бачать як народжується новий модний чоловік!\nВиглядаєш 3упер!");} return;}}
				 else if(items_eter[inv_fieldlist.getSelectedIndex()]==25){int diag=JOptionPane.showOptionDialog(this,"Надягнути вбрання II клясу?","Рішення II клясу",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[25], 1); ObslugaOdiagu(2); wide_field.setForeground(new Color(0,110,50)); /*NoweyjKolir(true, 0,110,50);*/ if(jaTut!=3&jaTut!=6&jaTut!=9&jaTut!=11){JOptionPane.showMessageDialog(this,"Ти перевдягнувся прямо на вулиці, а що?\nХай дивляться, що вони там не бачили? Це ж не S-кляс, і навіть не 3-й!\nВиглядаєш 2упер!");} else{JOptionPane.showMessageDialog(this,"Ти завбачливо зайшов у приміщення щоб перевдягнутися, але тебе всі побачили.\nХай дивляться, що вони там не бачили? Це ж не S-кляс, і навіть не 3-й!\nВиглядаєш 2упер!");} return;}}
				 else if(items_eter[inv_fieldlist.getSelectedIndex()]==24){int diag=JOptionPane.showOptionDialog(this,"Надягнути вбрання I клясу?","Рішення I клясу",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[24], 1); ObslugaOdiagu(1); wide_field.setForeground(new Color(110,50,0)); /*NoweyjKolir(true, 110,50,0);*/ if(jaTut!=3&jaTut!=6&jaTut!=9&jaTut!=11){JOptionPane.showMessageDialog(this,"Ти перевдягнувся прямо на вулиці, а що?\nХай дивляться, що вони там не бачили? Це ж не S-кляс, і навіть не 3-й!\nВиглядаєш 1упер!");} else{JOptionPane.showMessageDialog(this,"Ти завбачливо зайшов у приміщення щоб перевдягнутися, але тебе всі побачили.\nХай дивляться, що вони там не бачили? Це ж не S-кляс, і навіть не 3-й!\nВиглядаєш 1упер!");} return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==35|items_eter[inv_fieldlist.getSelectedIndex()]==36|items_eter[inv_fieldlist.getSelectedIndex()]==37|items_eter[inv_fieldlist.getSelectedIndex()]==38|items_eter[inv_fieldlist.getSelectedIndex()]==39|items_eter[inv_fieldlist.getSelectedIndex()]==60){
					if(bij){
						if(mob_boj[4]|mob_boj[5]|mob_boj[6]|mob_boj[8]|mob_boj[9]){JOptionPane.showMessageDialog(this,"Проти людей не застосовується"); return;}
						else{if(misiachne_nasinnia|rukawycia_dino|sitka_karbon|lynwa_upokor|neprytomnyk){JOptionPane.showMessageDialog(this,"Ти вже скориставсі одним засобом!"); return;}
							else{int diag=JOptionPane.showOptionDialog(this,"Використати спеціяльний засіб?","Спецрішення",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
								if (diag==0){
									if(items_eter[inv_fieldlist.getSelectedIndex()]==35){misiachne_nasinnia=true; vydobuvanniaZInv(items[35], 1); wide_field.setBackground(new Color(235,255,230)); JOptionPane.showMessageDialog(this,"Місячне насіння розвіялося по вітру...");}
									else if(items_eter[inv_fieldlist.getSelectedIndex()]==36){rukawycia_dino=true; rukawycia_dino_lic++; if(rukawycia_dino_lic>=5){vydobuvanniaZInv(items[36], 1); rukawycia_dino_lic=(int)(5*Math.random()); JOptionPane.showMessageDialog(this,"Пальці Рукавиці динозавра повідлітали");} wide_field.setBackground(new Color(200,255,200));}
									else if(items_eter[inv_fieldlist.getSelectedIndex()]==37){sitka_karbon=true; sitka_karbon_lic++; if(sitka_karbon_lic>=5){vydobuvanniaZInv(items[37], 1); sitka_karbon_lic=(int)(5*Math.random()); JOptionPane.showMessageDialog(this,"Сітка хоч і спрацювала, но розідралася");} wide_field.setBackground(new Color(255,215,180));}
									else if(items_eter[inv_fieldlist.getSelectedIndex()]==38){lynwa_upokor=true; lynwa_upokor_lic++; if(lynwa_upokor_lic>=5){vydobuvanniaZInv(items[38], 1); lynwa_upokor_lic=(int)(5*Math.random()); JOptionPane.showMessageDialog(this,"Линва зробила свою справу, і по всьому: порвалася");} wide_field.setBackground(new Color(255,190,130));}
									else if(items_eter[inv_fieldlist.getSelectedIndex()]==39){neprytomnyk=true; neprytomnyk_lic++; if(neprytomnyk_lic>=5){vydobuvanniaZInv(items[39], 1); neprytomnyk_lic=(int)(5*Math.random()); JOptionPane.showMessageDialog(this,"Дзеркало розтріскалося й вибухнуло!");} wide_field.setBackground(new Color(200,200,200));}
									else if(items_eter[inv_fieldlist.getSelectedIndex()]==60){osheleshuwach=true; osheleshuwach_lic++; if(osheleshuwach_lic>=5){vydobuvanniaZInv(items[60], 1); osheleshuwach_lic=(int)(5*Math.random()); JOptionPane.showMessageDialog(this,"Кубик розпавсі на 8 частин, вони опали наче пелюстки та розтанули в повітрі");} wide_field.setBackground(new Color(255,120,155));}
									return;} } } }
					else{JOptionPane.showMessageDialog(this,"Актуально тільки під час бою");} }
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==47){invdesc_field.setText(invdesc_field.getText()+med+" кг.");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==49){invdesc_field.setText(invdesc_field.getText()+pirja+" штуками.");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==50){invdesc_field.setText(invdesc_field.getText()+chorni_dijamanty+".");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==51){invdesc_field.setText(invdesc_field.getText()+rozhevi_perly+" штуків.");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==52){invdesc_field.setText(invdesc_field.getText()+perepel_jaicja+".");}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==53){int diag=JOptionPane.showOptionDialog(this,"Викинути сміття?","Всьому своє місце",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[53], 1); return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==54){int diag=JOptionPane.showOptionDialog(this,"Викинути сміття?","Всьому своє місце",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[54], 1); return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==55){int diag=JOptionPane.showOptionDialog(this,"Викинути сміття?","Всьому своє місце",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[55], 1); return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==56){int diag=JOptionPane.showOptionDialog(this,"Викинути сміття?","Всьому своє місце",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[56], 1); return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==57){int diag=JOptionPane.showOptionDialog(this,"Викинути сміття?","Всьому своє місце",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[57], 1); return;}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==40){int diag=JOptionPane.showOptionDialog(this,"Побільшує здоровля на 100 одиниць за раз!","Випити лікувальний еліксир?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(hpbar.getValue()==oz_gg){JOptionPane.showMessageDialog(this,"Передозування буває шкідливим!"); return;} else{vydobuvanniaZInv(items[40], 1); JOptionPane.showMessageDialog(this,"Чудово! Як новенький!"); if((hpbar.getValue()+100)<=oz_gg){hpbar.setValue(hpbar.getValue()+100); hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ");} else if((hpbar.getValue()+100)>oz_gg){hpbar.setValue(oz_gg); hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ");} return;}}}
				 else if(items_eter[inv_fieldlist.getSelectedIndex()]==41){int diag=JOptionPane.showOptionDialog(this,imia_geroia[0]+" стане невразливим наступні 5 раундів бою.","Випити Еліксир сну?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(newrazlywyj){JOptionPane.showMessageDialog(this,"Передозування невразливістю буває шкідливим!"); return;} else{vydobuvanniaZInv(items[41], 1); newrazlywyj=true; return;}}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==42){int diag=JOptionPane.showOptionDialog(this,imia_geroia[0]+" отримає критичне натхнення в наступні 5 раундів бою.","Випити літальний еліксир?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(litalbnyj){JOptionPane.showMessageDialog(this,"Передозування літальністю буває шкідливим!"); return;} else{vydobuvanniaZInv(items[42], 1); litalbnyj=true; return;}}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==43){int diag=JOptionPane.showOptionDialog(this,imia_geroia[0]+" отримає загальну користь дропу на наступні 5 раундів бою.","Випити загальнокорисний еліксир?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(zagalbnakorystb){JOptionPane.showMessageDialog(this,"Передозування загальною користю буває шкідливим!"); return;} else{vydobuvanniaZInv(items[43], 1); zagalbnakorystb=true; return;}}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==44){int diag=JOptionPane.showOptionDialog(this,imia_geroia[0]+" матиме повищений досвід наступні 5 раундів бою.","Випити еліксир універсальних знань?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(univer_z){JOptionPane.showMessageDialog(this,"Передозування знаннями буває шкідливим!"); return;} else{vydobuvanniaZInv(items[44], 1); univer_z=true; return;}}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==45){int diag=JOptionPane.showOptionDialog(this,"Випити еліксир користі Ойкуменополісу?","Кращій еліксир для найкращого міста",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){vydobuvanniaZInv(items[45], 1); if(!elek_korysti_pershyj){elek_korysti_pershyj=true; wypyw_elek_korysti_o=true; wagoma_korystb_o+=10; JOptionPane.showMessageDialog(this,"Ти відчуваєш, що місто отримало якусь незбагненну користь..."); return;} else{JOptionPane.showMessageDialog(this,"Ти не відчуваєш, що місто отримало якусь незбагненну користь..."); return;}}}
				else if(items_eter[inv_fieldlist.getSelectedIndex()]==46){int diag=JOptionPane.showOptionDialog(this,"Шкода перетворюватиметься на користь наступні 5 раундів бою.","Випити Квасало?",JOptionPane.YES_NO_OPTION,JOptionPane.QUESTION_MESSAGE,null,opti,opti[0]);
					if (diag==0){if(kwasalo){JOptionPane.showMessageDialog(this,"Навіть передозування квасалом буває шкідливим!"); return;} else{vydobuvanniaZInv(items[46], 1); kwasalo=true; return;}}} }
             } }

	//************************************BUTTONS ACTION
	//Важливий мент: у карті кнопок (mapalokiw.txt) мають бути присутні всі наявні локації послідовно, тобто, якщо в 0 стовпчику (що відповідає за локації) є: 0, 1, 2, 3, а далі необхідно перейти на 5 локацію, хоча 4-ї фактично нема, потрібно додати 4 з нульовими значіннями, а затим 5, инакше вивід наткнеться на 0
	public class BtnListener implements ActionListener {

	@Override
	public void actionPerformed(ActionEvent evt) {
		
		if(!shyrokepole){
			//Наступний блок коменту треба розкоментувати, якщо планується зафіксувати ширину текстового поля, натомість areaScrollPane.setViewportView(wide_field); закоментувати.
			/*panelbne_pole_tekstu.setLayout(new BoxLayout(panelbne_pole_tekstu, BoxLayout.Y_AXIS));
			panelbne_pole_tekstu.setBackground(Color.WHITE);
			panelbne_pole_tekstu.add(Box.createRigidArea(new Dimension(0, 5))); // відступ
			panelbne_pole_tekstu.add(wide_field);
			areaScrollPane.setViewportView(panelbne_pole_tekstu);*/
			areaScrollPane.setViewportView(wide_field); shyrokepole=true; //System.out.println("shyrokepole zmnia viewport");
			}
		
//***BTN — 1
		//Передовсім запускається метод KontentMaker(), спираючись на карту локацій, він передає потрібну для запуску локацію в обробку, так він працює в стандартному режимі.
		//Нестандартний режим це "напряму": коли в метод передається не локація по карті (стовпчики 1-7), а конкретна локація з карти (0-й стовпчик).
		if("btn1".equals(evt.getActionCommand())){if(!firstStart){if(!napriamu){KontentMaker(lokaciji[potochna_loka][1]);} else{napriamu=false; KontentMaker(potochna_loka);} }
			//Однократний запуск вітального екрану.
			if(firstStart) {wide_field.setText(s2); firstStart=false; btn1.setLabel("1"); loc_start_boo=true; areaScrollPane.setViewportView(wide_field); remove(btn_panel); remove(hpbar_panel); remove(lvlbar_panel); remove(loter_panel); remove(poleD1_panel); remove(poleD2_panel); add(poleVvodu); revalidate();}
			//Перший запуск стартової локи, виконується однократно.
			else if(loc_start_boo&&loc_start_int==0){
				
			KontentMaker(1);
			
			if(!start_loc_boo){
			btn_panel.add(btn2); btn_panel.add(btn3); btn_panel.add(btn4); btn_panel.add(btn5); btn_panel.add(btn6); btn_panel.add(btn7);
			remove(poleVvodu); revalidate(); add(poleD1_panel); add(poleD2_panel); add(lvlbar_panel); add(hpbar_panel); add(loter_panel); add(btn_panel); revalidate();
			
			pochatok_wystawy=true;
			
			System.out.println("Нехай щастить!");
			
			start_loc_boo=true;
			addQuest(0); addJournal(journal1);
			invlistmodel.remove(0); dodachaDoInv(items[1], 1); invdesc_field.setText("");}
			
			loc_start_boo=false; loc_start_int=-1;} 
			
			System.out.println("potochna_loka: "+potochna_loka);
			
			//Ручна додача інтерактиву. Схема однакова для будь-якої кнопки: вказуємо поточну_локу, і те, що буде відбуватися на цій лоці
			//бійки на 5-й локації
			if(potochna_loka==5){BudeBijka(true);}
			//На 9-й локації, фарма, де видаються гроші за день роботи -- плюсується мідь та очки досвіду
			else if(potochna_loka==9){plusMidb(100); endingQuestu(true, 110, false, 0);}
			//Грати в карти на 11-й лоці: передавати true по завершенню, і false на початку
			else if(potochna_loka==12){BudeGra(false);} }

//***BTN — 1 : bijka
		else if("btn1_bijka".equals(evt.getActionCommand())){
			if(randomOp2){EkshnBoju(items_urn[vybranyjItem], mob_urns[lisowa_kazka], mob_names[lisowa_kazka], items[vybranyjItem], true, true, false);}
			else{EkshnBoju(items_urn[vybranyjItem], mob_urns[0], mob_names[0], items[vybranyjItem], true, true, false);} }

//***BTN — 1 : joker
		else if("btn1_joker".equals(evt.getActionCommand())){
			//Граємо в карти: вихід з гри або вхід
			if(naWyhod){naWyhod=false; BudeGra(true);}
			if(loc_misto_int==76) {if(inv_zer0){BudeGra(true);} else{loc_misto_int=70; perenapravlenniaKnpky(1);}}
			//Вхід у гру
			else if(loc_misto_int==70) {
				if(!graemo_na_shtany){
					if(!graemo_na_rechi){
						if(!graemo_na_lyzardy&&!graemo_na_fbjordy){wide_field.setText("Азартник посміхнувся так, як бува посміхається чоловік не встигши стримати од затаєної радости посмішку, передчуваючи тотальний успіх. Затим ще раз струснув колодою, гепнув єї торцем по столі, блискавично провів рукою — колода стала опахалом, тоді запропонував тобі тягнути будь-яку карту й побажав успіху.\n\n1. Тягнути навмання"); knopky(1);}
						else if(graemo_na_lyzardy){wide_field.setText("Азартник посміхнувся так, як бува посміхається чоловік не встигши стримати од затаєної радости посмішку, передчуваючи тотальний успіх. Затим сказав: 'Гра на лизарди... відповідальна та гаряча, правила будуть трохи инакшими — мінімальна ставка 10 лизардів, я ж зі свого боку ставлю 10,000 мідяків, тузи і джокери без бонусів, годиться?'\n\n1. 'Грамо!'\n2. 'Ні'"); 
							knopky(2); 
							if(lyzardy<10){btn1.setEnabled(false);}}
						else if(graemo_na_fbjordy){wide_field.setText("Азартник ніби перелякався завчувши про фьйорди, мимохіть він оглянувся, блиснув очима в сторони, стис губи, тоді розтис й сказав напівтихо: 'Ні, пане... Фйорднику, на фьйорди я не граю, вибачай'.\n\n1. 'Зіграємо на щось инше!'\n2. 'В такому разі нехай щастить і на все добре!'"); 
							knopky(2); minusFbjourdy=true; naWyhod=true; graemo_na_fbjordy=false;}
						loc_misto_int=71;}
					else{loc_misto_int=73; perenapravlenniaKnpky(3);} }
				else{wide_field.setText("Азартник посміхнувся так, як бува посміхається чоловік не встигши стримати од затаєної радости посмішку, передчуваючи тотальний успіх, похитав головою, ніби питаючись себе: 'І на що тільки люди не здатні зважитися заради відіграшу'. Затим ще раз струснув колодою, гепнув єї торцем по столі, блискавично провів рукою — колода стала опахалом, тоді запропонував тобі тягнути будь-яку карту й побажав успіху.\n\n1. Тягнути навмання"); 
					reguliator_perenapravlennia=false; loc_misto_int=71; knopky(1);} }
			//Екшен, запуск метода гри
			else if(loc_misto_int==71|loc_misto_int==75) {
				if(!peredumaw_graty_na_shtany){
					if(midiaky>0|graemo_na_shtany||!minusFbjourdy|graemo_na_rechi){
						if(!graemo_na_lyzardy){wide_field.setText("Всі карти здавалися абсолютно однаковими, їх сорочки прикрашав вигадливий дрібний геометричний орнамент: рожевий на темно-сірому тлі. Ти витяг одну карту, кинув її горілиць...");
						SonJokera graemoVjokera=new SonJokera("Azartna gra");
						graemoVjokera.start();} 
						else{wide_field.setText("Азартник виклав в звичний спосіб карти на столі, ти вдивлявся в них, ніби шукав переможну, но вони здавалися абсолютно однаковими, їх сорочки прикрашав вигадливий дрібний геометричний орнамент: рожевий на темно-сірому тлі. Руки Азартника ледь помітно тряслися. Ти витяг одну карту, кинув її горілиць...");
							SonJokera graemoVjokera=new SonJokera("Azartna gra");
							graemoVjokera.start();}}
					 else{wide_field.setText("'Чудово — сказав Азартник та додав: — а що пан має на ставку?'\n\n1. 'Пан має мідяки'\n2. 'Пан має фьйорди'\n3. 'Пан має речі'\n4. 'Пан має штани'");
						 knopky(4); loc_misto_int=73;
					if(midiaky==0){btn1.setEnabled(false);}
					if(fbjordy==0|minusFbjourdy){btn2.setEnabled(false);}
					if(invlistmodel.size()==0){btn3.setEnabled(false);}
					if(prograw_shtany|peredumaw_graty_na_shtany2){btn4.setEnabled(false);}
					
					if(!btn1.isEnabled()&&!btn2.isEnabled()&&!btn3.isEnabled()&&!btn4.isEnabled()){
						btn5.setEnabled(true); 
						if(minusFbjourdy){wide_field.append("\n5. 'Пан лишився з голою дупою та фьйордами, на які ніц не купиш і не зіграєш на них...'");}
						else{wide_field.append("\n5. 'Пан лишився з голою дупою і без сорому і без казки!'");}}} }
				else{
					if(peredumaw_graty_na_shtany){peredumaw_graty_na_shtany=false; peredumaw_graty_na_shtany2=true;}
					wide_field.setText("'Чудово — сказав Азартник та додав: — а що пан має на ставку?'\n\n1. 'Пан має мідяки'\n2. 'Пан має фьйорди'\n3. 'Пан має речі'\n4. 'Пан має штани'");
					knopky(4); loc_misto_int=73;
					if(midiaky==0){btn1.setEnabled(false);}
					if(fbjordy==0|minusFbjourdy){btn2.setEnabled(false);}
					if(invlistmodel.size()==0|minusFbjourdy&&minusLyzardy&&prograw_shtany){btn3.setEnabled(false);}
					if(prograw_shtany|peredumaw_graty_na_shtany2){btn4.setEnabled(false);}
					
					if(!btn1.isEnabled()&&!btn2.isEnabled()&&!btn3.isEnabled()&&!btn4.isEnabled()){
						btn5.setEnabled(true); 
						if(minusFbjourdy){wide_field.append("\n5. 'Пан лишився з голою дупою та фьйордами, на які ніц не купиш і не зіграєш на них...'");}
						else{wide_field.append("\n5. 'Пан лишився з голою дупою і без сорому і без казки!'");}}} }
			//Думаємо на яку річ грати
			else if(loc_misto_int==74) {loc_misto_int=73; perenapravlenniaKnpky(3);} }
						
//***BTN — 2 --
		else if("btn2".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][2]);} else{napriamu=false; KontentMaker(potochna_loka);}
			//На цільовій локації гра завершується. В карті переходів вона має бути нулем.
			if(potochna_loka==10){GgDljaGG();} }

//***BTN — 2 : bijka
		else if("btn2_bijka".equals(evt.getActionCommand())){
			if(randomOp2){EkshnBoju(items_urn[vybranyjItem], mob_urns[lisowa_kazka], mob_names[lisowa_kazka], items[vybranyjItem], false, true, false);}
			else{EkshnBoju(items_urn[vybranyjItem], mob_urns[0], mob_names[0], items[vybranyjItem], false, true, false);} }

//***BTN — 2 : joker
		else if("btn2_joker".equals(evt.getActionCommand())){//вихід з гри
			//Ойкуменополіс * Базар * азартник - не граємо на лизарди
			if(loc_misto_int==71) {
				if(!naWyhod){
				wide_field.setText("Азартник із розумінням кивнув, ще раз перетасував колоду, та спитав: 'Чи бажає пан грати далі?'\n\n1. 'Бажає'\n2. 'Не бажає'");
				knopky(2); loc_misto_int=72; graemo_na_lyzardy=false; minusLyzardy=true;} 
				else{naWyhod=false; BudeGra(true);}}
			//Ойкуменополіс * Базар * азартник - не граємо на лизарди++
			else if(loc_misto_int==72|loc_misto_int==70) {
				//System.out.println("ZAHOD: graemo_na_shtany "+graemo_na_shtany);
				if(!graemo_na_shtany){//System.out.println("IF:  "+graemo_na_shtany);
					 graemo_na_rechi=false; graemo_na_fbjordy=false; graemo_na_lyzardy=false; BudeGra(true);}
				else{//System.out.println("ELSE:"+graemo_na_shtany); 
					peredumaw_graty_na_shtany=true; graemo_na_shtany=false; loc_misto_int=71; perenapravlenniaKnpky(1);} }
			//Ойкуменополіс * Базар * азартник - граємо на фьйорди ++
			else if(loc_misto_int==73) {loc_misto_int=70; graemo_na_lyzardy=false; graemo_na_rechi=false; graemo_na_fbjordy=true; perenapravlenniaKnpky(1);}
			//Ойкуменополіс * Базар * азартник - кинути затію++
			//Коли треба завершити гру і вийти на якусь локу -- запускаємо метод гри з перемикачем true
			//Також потрібно не забути в самому методі встановити цільову локацію для виходу
			else if(loc_misto_int==75|loc_misto_int==76) {BudeGra(true);} }
		
//***BTN — 3 --
		else if("btn3".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][3]);} else{napriamu=false; KontentMaker(potochna_loka);}}

//***BTN — 3 : bijka
		else if("btn3_bijka".equals(evt.getActionCommand())){
			if(randomOp2){EkshnBoju(items_urn[vybranyjItem]+(int)(5*Math.random()), mob_urns[lisowa_kazka]+(int)(3*Math.random()), mob_names[lisowa_kazka], items[vybranyjItem], false, true, false);}
			else{EkshnBoju(items_urn[vybranyjItem]+(int)(5*Math.random()), mob_urns[0]+(int)(3*Math.random()), mob_names[0], items[vybranyjItem], false, true, false);} }

//***BTN — 3 : joker
		else if("btn3_joker".equals(evt.getActionCommand())){
			//Граємо на речі зі старту
			if(loc_misto_int==70) {perma_gra_na_rechi=true; loc_misto_int=73; perenapravlenniaKnpky(3);}
			//Беремо рандомно з кишенів річ окрім монет (виокремлюємо 3 види), в списку вибірки можуть бути виключення або спеціяльні ітеми, як сміття -- з окремою реакцією
			else if(loc_misto_int==73) {
				knopky(2);
				boolean[] trymonety={false, false, false}; int tmpMonety=0; graemo_na_rechi=true;
				
				if(invlistmodel.size()!=0){
					
					if(inv_fieldlist.getNextMatch(items[6], 0, javax.swing.text.Position.Bias.Forward)!=-1){trymonety[0]=true; tmpMonety++;}
					if(inv_fieldlist.getNextMatch(items[16], 0, javax.swing.text.Position.Bias.Forward)!=-1){trymonety[1]=true; tmpMonety++;}
					if(inv_fieldlist.getNextMatch(items[17], 0, javax.swing.text.Position.Bias.Forward)!=-1){trymonety[2]=true; tmpMonety++;}
					
					if(tmpMonety!=invlistmodel.size()){
						int indxTmp=-1;
						for(int i=0; i>-1; i++){
							rndRich=(int)((items.length-1)*Math.random());
							if(rndRich!=6&&rndRich!=16&&rndRich!=17){
								indxTmp=inv_fieldlist.getNextMatch(items[rndRich], 0, javax.swing.text.Position.Bias.Forward);
								if(rndRich==54|rndRich==55|rndRich==56|rndRich==57|rndRich==58){System.out.println("rndRich: "+rndRich+"\titems[rndRich: "+items[rndRich]); smittia_na_stawku=true;}
								if(indxTmp!=-1){
									System.out.println("smittia_na_stawku: "+smittia_na_stawku);
									if(!smittia_na_stawku){System.out.println("звичайна річ"); wide_field.setText("Азартник поглядів на те, що ти тримав у руках, і сказав: 'Ти пропонуєш мені на ставку "+items[rndRich]+", лепська річ, завши про таку снив! Граємо?!'\n\n1. Грати\n2. Кинути затію");}
									else{System.out.println("граємо на сміття"); smittia_na_stawku=false; wide_field.setText("Азартник поглядів на те, що ти тримав у руках, і сказав: 'Ти пропонуєш мені на ставку "+items[rndRich]+", лепська річ, хоч багато хто й вважає те за сміття, а я знаю цьому діло! Граємо?!'\n\n1. Грати\n2. Кинути затію");}
									loc_misto_int=75; break;}
								else{smittia_na_stawku=false;}}} }
								
					else{
						if(!prograw_shtany&&!peredumaw_graty_na_shtany2){wide_field.setText("Азартник спохмурнів і відказав: 'Таж, хлопче, в тя вже і нема ніц на ставку, хіба що штани свої виставиш?'\n\n1. Поставити штани\n2. Відмовитися од затії"); graemo_na_shtany=true; perma_gra_na_rechi=false;}
						else if(!prograw_shtany&&peredumaw_graty_na_shtany2){wide_field.setText("Азартник спохмурнів і відказав: 'Таж, хлопче, в тя вже і нема ніц на ставку, на штани грати не хочеш, певно сьогодні не твій день, раджу звернутись до Горбача, у нього тут ферма під стінами, він ті дасть рацію та працю, на другі штани заробиш, а тоді обов'язково і одразу приходь знову!'\n\n1. Дякувати за поради і вертати голоблі"); btn2.setEnabled(false); inv_zer0=true;}
						else if(prograw_shtany){wide_field.setText("Азартник спохмурнів і відказав: 'Таж, хлопче, в тя вже і нема ніц на ставку, навіть штани свої ти програв, певно сьогодні не твій день, раджу звернутись до Горбача, у нього тут ферма під стінами, він ті дасть рацію та працю, на штани заробиш, а тоді обов'язково і негайно приходь знову!'\n\n1. Дякувати за поради і вертати голоблі"); btn2.setEnabled(false); inv_zer0=true;}
						loc_misto_int=76;}} } }
				
//***BTN — 4 --
		else if("btn4".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][4]);} else{napriamu=false; KontentMaker(potochna_loka);}}
		
//***BTN — 4 : joker
		else if("btn4_joker".equals(evt.getActionCommand())){//Штани на кону!
			wide_field.setText("Азартник перегнувся через стіл щоб подивитися на твої штани, він оцінювально роздивлявсі їх якийсь час, затим сказав: 'Ладно, годиться! Ставки зроблено, ставок більше нуль!'\n\n1. Грати на штани\n2. Передумати");
			knopky(2); loc_misto_int=70; graemo_na_shtany=true; reguliator_perenapravlennia=true;}
		
//***BTN — 5 --
		else if("btn5".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][5]);} else{napriamu=false; KontentMaker(potochna_loka);} }

//***BTN — 5 : joker
		else if("btn5_joker".equals(evt.getActionCommand())){
			//Стартова локація
			if(loc_misto_int==1) {wide_field.setText("Пан Азартник розгладжував зелене сукно на столі, а щойно ти надійшов, Азартник схопився за карти та почав їх тасувати, хвацько він те робив, карти в нього у руках переливалися мов з води: із одної руки до иншої, поміж пальцями, він майже жонглував ними, коли хотів — витягав туза, коли хотів — джокера, схоже Азартник знає свою колоду як десятеро власних пальців, видовище се не для слабких психікою. Під шурхіт картів, Азартник сказав: 'Бачу нове обличчя, це добре, певно про мої ігри знають вже на краях всесвіту! Сьогоденний пул — 10,000 мідяків. Граємо по таким правилам: якщо випадає червона карта, ти береш дві ставки, якщо випадає чорна, я беру дві ставки, коли випадає червоний джокер, ти береш 4 ставки, а коли чорний, вибач, братику, я візьму 4 ставки, якщо випаде червоний туз, ти візьмеш 3 ставки, а якщо чорний — я 3 ставки прибираю. Все просто! Гра зветься 'Сон джойкера'. На ставку приймаю не тільки гроші, а й речі. Мінімальна ставка 100 мідяків, граємо?'\n\n1. Поставити 100 мідяків і грати\n2. 'Не сьогодні'\n3. Грати на речі");
				knopky(3); loc_misto_int=70;
				if(midiaky<100){btn1.setEnabled(false);}
				if(invlistmodel.size()==0){btn3.setEnabled(false);}}
			//Ганебний вихід без штанів
			else if(loc_misto_int==73) {loc_misto_int=4; perenapravlenniaKnpky(1);} }
		
//***BTN — 6 --
		else if("btn6".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][6]);} else{napriamu=false; KontentMaker(potochna_loka);} }
	
//***BTN — 7 --
		else if("btn7".equals(evt.getActionCommand())){if(!napriamu){KontentMaker(lokaciji[potochna_loka][7]);} else{napriamu=false; KontentMaker(potochna_loka);} }
//***BTN — special — start --
		else if("godytbsia_knp".equals(evt.getActionCommand())){imia_geroia[0]=pole_imeni.getText(); pole_imeni.setEditable(false); pole_imeni.setBackground(Color.GRAY); pole_imeni.setForeground(Color.WHITE); godytbsia_knp.setEnabled(false);
                //System.out.println("Введене ім'я: " + imia_geroia[0]);
                //Деякі ресурси потрібно ініціялізувати опісля певних подій, бо так працює ява...
                //Приміром, якщо спочатку ініціялізувати описові рядки, в яких фігурує вивід з масиву, а потім внести у цей масив значення, то в результаті отримаємо Null
                //Тому потрібно спочатку заповнити масив, а потім оголошувати змінні, в яких цей масив використовується.
                //В цьому прикладі запускається павза + оголошення ряду змінних, в яких задіяно ім'я персонажа
                //Ця подія стається опісля тиску на кнопку "Годиться", на екрані введення ім'я персонажа.
                BojowaPawza imiaPawza=new BojowaPawza("Dynamyka imeni");
				imiaPawza.start();
				item58="Лакований піперець, що не боїться ані вологи, ані бруду. Пишно прикрашений вензелями по кутах та декоративною канвою, по середині ледве розрізнюється лорд-протекторський герб з одного боку, та герб Ойкуменополісу з иншого. На лицьовому боці вказано, що тримач сієї візитівки має право на безперешкодне переміщення в межах Урядового кварталу і зазначено твоє ім'я: "+imia_geroia[0]+".";
				loc_uriadowyj_kwartal7_habarnyky2="Лорд-протектор поклав обидві руки на катедру, дивився перед собою та ніц не бачив — міркував. Тоді сказав: 'Маєш рацію, "+imia_geroia[0]+", справді така політика в силі позбавити нас працелюбних, розумних, або як ти сказав 'талановитих' людий, які в перспективі принесуть значно більше користі, аніж можна було очікувати. Та водночас ми стикаємося і з певними ризиками, вільний вхід здатен привабити кримінальників, отож, чи набудемо ми тоді, а чи втратимо? Я винесу це питання на обговорення ради'.\n\n1. 'Був радий зробити ваше місто дійсно багатшим'";
				loc_uriadowyj_kwartal7_dymnyk_sheraz="Ти не втомлювався викладати про шкоду куріння та наводити  приклади негідної поведінки в публічному місці — посеред базару, на Димникових килимах, коли люди практично забували про себе у спробі відокремитися од реальности, в якій вони продовжують бути членами суспільства, членами людської цивілізації, і, відповідно, повинні поводитися як члени цивілізованого суспільства, а не пускати бульби носом під скамною.\n\nЛорд-протектор на це сказав так: 'Іще раз дякую за твоє дбання про порядність нашого міста і адекватність містян, "+imia_geroia[0]+", але будь певен, усе під контролем, я чудово ознайомлений із базарними активностями, Димник — наш чоловік, він провадить програму по виокремленню податливих до чутливих залежностей громадян, затим ми проведемо з ними освітню бесіду та залучимо до курсу соціяльної реінтеграції. Той дим, що вони вдихають не є наркотичним, усі ефекти, які досягають курці є суто плацебними, нешкідливими'.\n\n1. 'Був радий допомогти'\n2. 'В мене лишаються питання щодо етичности таких 'програм'";
				loc_uriadowyj_kwartal7_dymnyk2="Лорд-протектор трохи нахилився вперед, тінь від нього торкнулася тебе на мить, тоді він сперся на ліву ногу і сказав: 'Авжеж, ми на раді довго обговорювали це питання, і врешті вирішили поступитися етичністю заради суспільного блага, та й не тільки поспільство матиме зиск з того, а й ці бідаки, бо ж їх ніхто не кидає, навпаки, ми спробуємо зробити з них свідомих громадян. Але твоє обурення буде зараховане до голосів проти подібних кампаній, я повідомлю про це на прийдешній нараді. Цілком можливо, твій аргумент, "+imia_geroia[0]+", і реакція стане тієї вагою, що схиляє шальці терезів на свій бік'.\n\n1. 'Дякую за можебність бути почутим'";
				loc_uriadowyj_kwartal7_kwasnyk_sheraz="Бувши в місті ти чимало бачив і чув про квас і квасників, про квасдім та базарні квасні будні, про столи з квасом і квас під столами. Иноді бувало вражіння, що деякі люди просто одержимі квасом, що п'ють йо' вони не заради гідрації тіла чи тамування спраги, а заради якоїсь компетенції, заради ефектів з-поза меж тілесних потреб. Ці думки ти наново виклав перед лордом-протектором нічого не приховавши, тоді він сказав: 'Таке положення квасу в Ойкуменополісові, "+imia_geroia[0]+", повторюю — продумане високою радою, все це спеціяльно спляновано для уздоровлення майбутніх поколінь, адже нині ми досліджуємо психофізичний вплив цього напою на вільному, як то кажуть наші мудрагелі, полі. Ми не обмежуємо споживання цього продукту і робимо висновки, та незабаром ці висновки стануть в основі генеральної доповіді, яка і вирішить подальшу долю квасу в нашому городі'.\n\n1. 'Це мені нетрудно'\n2. 'Такі соціяльні експерименти добром не скінчаються'";
				loc_uriadowyj_kwartal7_wyhid_="З Фортеці справедливошсти тя виводив той ж службовник у зеленому, що і проводив до кабінету міського голови, вже на порозі парадних дверів службовник тихим, запевняючим голосом сказав: 'Твій допуск, пане "+imia_geroia[0]+", до Урядового кварталу онулюється на 125 років, такі правила'. Тоді він зачинив двері, а ладник, що спостерігав за сценою збоку, опинився поруч і прохав тя спокійно виходити з кварталу.\n\n1. Спокійно виходити з кварталу";
				
				//System.out.println("items_descr length:"+items_descr.length);
				//тут формується опис ітему (лакована перепустка) з іменем героя і додається на передостанню позицію в масиві
				//дублювати ластову позицію не треба, бо Null не зміщує позиції, він так би мовити -- не існує, тому по суті просто заміщується на наявний тут опис і все, ластовий як був 60 так і є, а після нього нічого нема і розмір масиву до-після не міняється
				items_descr[59]=item58; //items_descr[60]=item59;
				
				/*//System.out.println("items_descr length pislia modyfikaciji:"+items_descr.length);
				
				for(int i=55; i<items_descr.length; i++){//System.out.println("items_descr["+i+"] = "+items_descr[i]);}*/}    
}	}
		
	//Сюди передається локація (lokaciia) на відображення
	//loka приймає цифру в текстовий рядок
	//kontent_fajl тримає назву файлу з контентом: з описами локацій
	//Починається читання з файлу першого рядка: до першого пробілу, тоді результат обрізається відповідно до значіння цільової локації (1 цифра, 10 дві, 100 три або більше)
	//Обрізаний результат порівнюється з цільовим, якщо відповідність відсутня, рядок без зупинок дочитується до табуляції (\t) тоді godi=false і читається новий рядок з включенням перевірок
	//Коли відповідність знайдено, цільовий рядок дочитується до табуляції та формується в текст і вноситься в поле тексту як опис локації, метод закривається break
	//Особливішсть кодування UTF-8: новий рядок на початку містить нечитабельний символ, инші кодування для кирилиці або не підтримуються в Java, або проблемні, це впливає на послідовність обрізки
	//potochna_loka потрібна для автоматизації ходу полокаціям в методі кнопок
	//Цей метод також регулює активні кнопки через метод knopky(x); а саме: цикл вишукує в тексті опису нумерацію (1. , 2. , 3. , ...) кожна відповідність плюсує tempKnps, невідповідність зупиняє пошук, tempKnps визначає кількість активних кнопок.
	//Цей метод також відображає картинку, якщо єї вписано в опис, як це працює: опис формується в три етапи: спочатку в ньому шукається нумер локації (lok#), затим до нього дописується 50 символів і в них шукається знак #, якщо він присутній, значить опис обрізається до цього знаку: так вирізняється назва картинки
	//Коли назву збережено, опис дочитується з файлу до табуляції, і об'єднується з першими 50 символами опису мінус знаки до #
	//Цей метод також запускає звук, музику, принцип аналогічний до картинки, з файлу контенту читається назва файлу до знаку @
	//Одночасно локація може містити картинку та звук, або одну картинку без звуку, або звук без картинки, в разі коли локація містить і звук і картинку, картинка має бути першою.
	//Коли гравець переходить на нову локацію її назва, що міститься в масиві locs використовується для відображення в полі "Поточне місце", щоб все працювало правильно, необхідно синхронізувати нумери цільових локацій з kontent.txt із індексами масиву locs.
	//Важливо! Опис локації в файлі kontent.txt повинен бути мінімум 50 знаків!
	public void KontentMaker(int lokaciia){
		System.out.println("KontentMaker: початок, локація: "+lokaciia);
		if(lokaciia!=0){potochna_loka=lokaciia; //lokaciji[lokaciia][0];
		System.out.println("KontentMaker всередині !=0 іфа");
		String loka=""+lokaciia;
		String kontent_fajl="kontent.txt";
        
        try (FileReader reader=new FileReader(kontent_fajl)) {
            StringBuilder buffer=new StringBuilder();
            int ch, tempKnps=0;
            boolean matchFound=false, godi=false, pershyj_riadok=true, maljunok_boo=false, zwuk_boo=false, mus_mal_boo=false;
			String tempRiadok, tempRiadok2, tempRiadok3, tempRiadok4, adresa_kontentu="", adresa_kontentu2="", tempKontent, tempKontent2;
			
            while ((ch=reader.read())!=-1) {
                if (ch==' '&&!godi) {
                    tempRiadok=buffer.toString();
                    System.out.println("Прочитано: " + tempRiadok+"\tlength(): "+tempRiadok.length());
                    
                    if(pershyj_riadok){tempRiadok=tempRiadok.substring(4); pershyj_riadok=false;}
                    else{
						if(lokaciia<10){tempRiadok=tempRiadok.substring(5);}
						else{tempRiadok=tempRiadok.substring(5,tempRiadok.length());} }
                    
                    System.out.println("tempRiadok obrizka: "+tempRiadok+"\tloka: "+loka+"\tlokaciia: "+lokaciia);

                    if (tempRiadok.equals(loka)) {
                        System.out.println("Знайдено відповідність: " + tempRiadok);
                        matchFound=true;
                        buffer.setLength(0);
                        while (ch!=-1) {if(buffer.length()<50){ch=reader.read(); buffer.append((char) ch);} else{break;}}
                        tempRiadok=buffer.toString();
                        System.out.println("Пошуки малюнку: "+tempRiadok);
                        if(tempRiadok.indexOf("#")==-1&&tempRiadok.indexOf("@")==-1){while (ch!='\t') {ch=reader.read(); buffer.append((char) ch);}
							tempRiadok=buffer.toString();}
                        else{
							if(tempRiadok.indexOf("#")>-1^tempRiadok.indexOf("@")>-1){
						System.out.println("ТІЛЬКИ МАЛЮНОК АБО ЗВУК");
								if(tempRiadok.indexOf("#")>-1){tempKontent="#";} else{tempKontent="@";}
							tempRiadok2=tempRiadok;
							System.out.println("Бекап 50 символів: "+tempRiadok2);
							tempRiadok=tempRiadok.substring(0, tempRiadok.indexOf(tempKontent));
							System.out.println("Обрізка імені малюнку: "+tempRiadok);
							if(tempKontent.equals("#")){maljunok_boo=true;} else{zwuk_boo=true;}
							adresa_kontentu=tempRiadok;
							
							buffer.setLength(0);
							while (ch!='\t') {ch=reader.read(); buffer.append((char) ch);}
							tempRiadok=tempRiadok2.substring(adresa_kontentu.length()+1, tempRiadok2.length())+buffer.toString();
							System.out.println("tempRiadok2: "+tempRiadok2);}
							
							else if(tempRiadok.indexOf("#")>-1&&tempRiadok.indexOf("@")>-1){
								System.out.println("МАЛЮНОК ТА ЗВУК");
								tempKontent="#"; tempKontent2="@";
								tempRiadok2=tempRiadok;
								System.out.println("Бекап 50 символів: "+tempRiadok2);
								tempRiadok=tempRiadok.substring(0, tempRiadok.indexOf(tempKontent)); 
								System.out.println("ФОРМУВАННЯ tempRiadok: "+tempRiadok);
								tempRiadok4=buffer.toString();
								tempRiadok3=tempRiadok4.substring(tempRiadok.length()+1, tempRiadok4.indexOf(tempKontent2));
								System.out.println("ФОРМУВАННЯ tempRiadok3: "+tempRiadok3);
								adresa_kontentu=tempRiadok; adresa_kontentu2=tempRiadok3;
								
								buffer.setLength(0);
								while (ch!='\t') {ch=reader.read(); buffer.append((char) ch);}
								tempRiadok=tempRiadok2.substring((adresa_kontentu.length()+1)+(adresa_kontentu2.length()+1), tempRiadok2.length())+buffer.toString();
								System.out.println("tempRiadok2: "+tempRiadok2);
								mus_mal_boo=true;} }
                        
                        System.out.println("відповідність дописано: " + tempRiadok);
                        //for(int i=1; i<MAXBTNS; i++){if(lokaciji[lokaciia][i]!=0){tempKnps++;} else{break;} }
                        for(int i=1; i<MAXBTNS; i++){if(tempRiadok.indexOf(i+". ")!=-1){tempKnps++;} else{break;} }
                        wide_field.setText(tempRiadok);
                        if(!locs[lokaciia].equals("")&&lokaciia!=jaTut){zminaMiscia(lokaciia);}
                        knopky(tempKnps); tempKnps=0;
                        
                        if(!mus_mal_boo){
							if(zwuk_boo){zwuk_boo=false; if(!audiofon.equals(adresa_kontentu)){chas_muz.stop(); chas_muz.play(adresa_kontentu, 0.1f, true); audiofon=adresa_kontentu;} }
							if(maljunok_boo){maljunok_boo=false; MaljunkowyjEpizod(adresa_kontentu, wide_field.getText());} }
                        else{mus_mal_boo=false; if(!audiofon.equals(adresa_kontentu2)){chas_muz.stop(); chas_muz.play(adresa_kontentu2, 0.1f, true); audiofon=adresa_kontentu2;}
							MaljunkowyjEpizod(adresa_kontentu, wide_field.getText());}
                        break;}
					else{godi=true; buffer.setLength(0);} }
					
					buffer.append((char) ch);
                    		
					if(ch=='\t'){godi=false; buffer.setLength(0);} }

            if (!matchFound) {System.out.println("Відповідність не знайдена.");} } catch (IOException e) {e.printStackTrace();} }
            
            KontrolbLok(lokaciia); KontrolbImen(lokaciia);}
	
	//Метод замінює маркери глобально (на всіх локаціях де стрічається маркер, або локально (на конкретних локаціях де стрічається маркер) -- на певні значіння, приміром, на ім'я персонажу, або назву ітему, або рандомізоване ім'я НІПу, моба тощо.
	//Навіщо це потрібно: змінні в описах зовнішнього фалу не розпізнаються як змінні, а як звичайний текст.
	public void KontrolbImen(int lokacija){
		ZaminaProcentu("~імягероя",imia_geroia[0]);
		//Приклад конкртної заміни назв на певних локаціях: в одному прикладі вставляється ім'я моба, в другому назва ітему.
		//Маркери можна використовувати будь-які свої, але треба враховувати, що не всі символи вільні, приміром + і * не можна задіяти, буде помилка regex.
		//if(lokacija==5){ZaminaProcentu("~імямоба",mob_names[0]);}
		//if(lokacija==10){ZaminaProcentu("~назваітему",items[0]);}
		}
	
	//Иноді потрібно закрити доступ на певну локацію з ключової локації, наприклад, після відвідин певної локації, гравець повертається на ключову, і на певну локацію він вже повернутися не повинен
	//Є два способи це зробити.
	//Перший: коли потрібно закрити на 1-2 локації. Вказуємо нумер локації, яку треба закрити і плюсуємо єя особистий інт
	//Тоді вказуємо ключову локацію, для кнопка на цільову локацію має бути закрита, і якщо інт плюсувався потрібну кількість разів: просто вимикаємо потрібно кнопку.
	//Другий: годящий для контролю великої кількости кнопок. Вказуємо усі локації, які можуть буть закриті, в циклі маркування обов'язково тре' вказати ключову локацію, на якій будуть вимкнені кнопки
	//Цикл маркує цільову локацію в спеціяльному булевому масиві -- цей масив потрібно створювати.
	//Тоді вказуємо клчову локацію, на якій необхідно вимикати відвідані локації, і в методі minusKnopky() -- вказуємо контрольний масив.
	public void KontrolbLok(int lokasiia){
		if(lokasiia==4){buw_na_fermi++;}
		if(lokasiia==1&&buw_na_fermi>1){btn2.setEnabled(false);}
		
		System.out.println("lokasiia: "+lokasiia);
		
		if(lokasiia==13|lokasiia==14|lokasiia==15|lokasiia==16|lokasiia==17|lokasiia==18|lokasiia==19){
			for(int i=1; i<MAXBTNS; i++){if(lokaciji[2][i]==lokasiia){System.out.println("lokaciji[2][i]: "+lokaciji[2][i]+"\ti -- "+i); lord_protektor[i-1]=true; break;}} }
		if(lokasiia==2){minusKnopky(lord_protektor);}
		//Взагалі я не раджу використовувати повний пул кнопок, себто закривати їх усі, но коли се необхідно, опісля потрібно надати гравцеві можебність вийти з "закритої" локи
		//Є два способи це зробити: простий, коли опісля перевірки усіх кнопок виявляється, що їх вимкнено, просто міняємо опис та вмикаємо потрібні кнопки.
		//Складний: зробити те саме через павзу, це дозволяє гравцеві зрозуміти, що локація закрита, тоді, в цьому прикладі через 6 секунд опис міняється та вмикається 1 кнопка, що провадить на 1 локу.
		if(potochna_loka==2&&!btn1.isEnabled()&&!btn2.isEnabled()&&!btn3.isEnabled()&&!btn4.isEnabled()&&!btn5.isEnabled()&&!btn6.isEnabled()&&!btn7.isEnabled()){
			KosmichnaPawza waitAmoment=new KosmichnaPawza("Dynamyka chasu");
			kosmichnyj_chas=6000;
			kosmichnyj_text="Панацео мимохіть захихотів, як мимохіть хихоче чоловік наперед знавши дещо, та не збиравшися те 'дещо' виказувати. Звівши з вуст посміх сказав: 'Ну що ж, на 'ні', нема й еліксиру. Приходь коли матимеш рецепт та компоненти. Щось ще?'\n\n1. 'Так'";
			kosmichni_knopky=1;
			waitAmoment.start();
			napriamu=true; potochna_loka=1;} }
	
	//Автоматичний метод, що запускає музику. Вручну тут можна змінити гучність та вибрати дію після завершення треку: крутити далі (LOOP_CONTINUOUSLY), чи баста (ДОВЕДЕТЬСЯ_ШУКАТИ_САМОМУ).
    public class ChasMuzyky {
		private Clip clip;
		private long pausePosition=0;
		private boolean isPaused=false;
		
		public void play(String shliah_muzyky, float volume, boolean loop){
			chas_myzyky_b=true;
			try {
				if (clip==null) {//File file=new File(shliah_muzyky);
				//тут можебно доведеться переробити на імпутстрім із буфером як у Часомірі
				//AudioInputStream audioStream=AudioSystem.getAudioInputStream(getClass().getResourceAsStream("/"+shliah_muzyky));
				InputStream rawInput=getClass().getResourceAsStream("/"+shliah_muzyky);
				BufferedInputStream bufferedIn=new BufferedInputStream(rawInput);
				AudioInputStream audioStream=AudioSystem.getAudioInputStream(bufferedIn);

				AudioFormat format=audioStream.getFormat();
				DataLine.Info info=new DataLine.Info(Clip.class, format);
				clip=AudioSystem.getClip();
				clip.open(audioStream);
				clip.start();
		
				// Зміна гучності
				FloatControl gainControl=(FloatControl) clip.getControl(FloatControl.Type.MASTER_GAIN);
				float dB=(float)(Math.log10(volume)*20); // Перетворення (0.0 - без звуку, 1.0 - макс)
				gainControl.setValue(dB);}
				
				if (isPaused) {clip.setMicrosecondPosition(pausePosition); // Відновлення з місця паузи
                isPaused=false;} 
                else {clip.setMicrosecondPosition(0);} //спочатку
		
		// Запуск та зациклення
		clip.start(); if(loop){clip.loop(Clip.LOOP_CONTINUOUSLY);} } catch (UnsupportedAudioFileException | IOException | LineUnavailableException e) {e.printStackTrace();} }
		
		public void pause() {
			if (clip!=null&&clip.isRunning()){
				pausePosition=clip.getMicrosecondPosition(); // Запам'ятати позицію
				clip.stop(); // Зупинити звук
				isPaused=true;}}
    
		public void stop() {
			chas_myzyky_b=false;
			if (clip!=null&&clip.isRunning()) {
				clip.stop();
				clip.close();
				clip=null;
				pausePosition=0;
				isPaused=false;} } }
    
    //Метод повністю налаштовується тут вручну, що він робить: перевіряє певні нюанси проходження гри, затим визначає поточну дату та час, створює текстовий файл у робочій теці гри з назвою, в якій ідентифікатор є час та дата
    //Тоді записує в цей файл завершальну, результативну інформацію, що характеризує штиль гри гравця.
    //Наприкінці виводить в консоль (тільки якщо присутня консоль, тобто якщо гра запускалась через консоль) повний шлях до створеного файлу.
	public void ZberezhenniaProgresu(){if(PerewirkaItemiw(59)){lakperepustka="так";} else{lakperepustka="ні";} if(hrustkyj_bonus){hrustkyj_bonus_s="так";} else{hrustkyj_bonus_s="ні";}
		if(osheleshuwachx2){osheleshuwachx2_s="так";} else{osheleshuwachx2_s="ні";} if(zalizni_zuby){zalizni_zuby_s="так";} else{zalizni_zuby_s="ні";}
		if(dni_na_farmi<2){dni_na_farmi_s="день";} else if(dni_na_farmi>4){dni_na_farmi_s="дні";} else{dni_na_farmi_s="днів";} 
		LocalDateTime currentDateTime=LocalDateTime.now();
		DateTimeFormatter formatter=DateTimeFormatter.ofPattern("yyyy-MM-dd HH;mm;ss");
		String formattedDateTime=currentDateTime.format(formatter);
		fajl="zhurnal_ojkumenopolisu--"+formattedDateTime+".txt"; File file=new File(fajl);
		try{if(file.createNewFile()){
				try(BufferedWriter writer=new BufferedWriter(new FileWriter(fajl))) {
                writer.write("Гру завершено на "+noweyj_denb+" день."); writer.newLine(); writer.newLine();
                writer.write("* * * * * * * * * * * * * * * * * * * * * * * * *"); writer.newLine(); writer.newLine();
                writer.write("Переможець: "+imia_geroia[0]+" ("+rivenb+" рів.)"); writer.newLine();
                writer.write("Має: "+midiaky+" мідяків; "+lyzardy+" лизардів; "+fbjordy+" фьйордів."); writer.newLine();
                writer.write("Здужав: "+peremoga+" лісних звірів."); writer.newLine();
                writer.write("Виграв у 'Сні Джокера': "+midb_jokera+" мідяків. Програв: "+midb_jokera_minus+" мідяків. Програв лизардів: "+lyzardy_jokera+"."); writer.newLine();
                writer.write("Випив кухлів квасу: "+kwas_kh+"."); writer.newLine();
                writer.write("Випив мілілітрів диму: "+fenix_ml+" 'Здичавілого феніксу'; "+bolotnyj_skytalecb_ml+" 'Болотного скитальця'."); writer.newLine();
                writer.write("Мав залізні зуби: "+zalizni_zuby_s+"."); writer.newLine();
                writer.write("Працював на фармі Горбача: "+dni_na_farmi+" "+dni_na_farmi_s+"."); writer.newLine();
                if(znaje_zirky){writer.write("Знає всі зірки над Ойкуменополісом: так, а саме: "); for(int i=0; i<znaje_zirky_m.length; i++){writer.write(znaje_zirky_m[i]);} writer.newLine();} 
                else{writer.write("Знає всі зірки над Ойкуменополісом: ні."); writer.newLine();}
                writer.write("Отримав з Ошелешувача Ошелешувач: "+osheleshuwachx2_s+"."); writer.newLine();
                writer.write("Знайшов хрусткий бонус: "+hrustkyj_bonus_s+"."); writer.newLine();
                writer.write("Приніс Ойкуменополісові користі: "+wagoma_korystb_kg+" кг."); writer.newLine();
                writer.write("Отримав Лаковану перепустку: "+lakperepustka+"."); writer.newLine(); writer.newLine();
                writer.write("* * * * * * * * * * * * * * * * * * * * * * * * *"); writer.newLine(); writer.newLine();
                writer.write("GG");
                System.out.println("Журнал тут: "+file.getAbsolutePath());} catch (IOException e) {System.out.println("Nemozhlywo zapysaty fajl: " + e.getMessage());} }
			else{System.out.println("Nemozhlywo stworyty fajl.");} } catch (IOException e) {System.out.println("Fajl ne stworjujetsia: " + e.getMessage());}
		}
	
	//Коли точно відомо, який текст потрібно замінити в певному описі, цей метод міняє його на цільовий
	//Наприклад: ZaminaProcentu("%НАЗВАЧАЮ", "'Ефаксен'"); або без ключів: ZaminaProcentu("Він бачив в тобі ворога", "Він побачив в тобі приятеля");
	public void ZaminaProcentu(String sho, String nasho){wide_field.setText(wide_field.getText().replaceFirst(sho, nasho));}
		
	//Коли підготовка запускається з перемикачем false: гра активується на 5 кнопках із відповідними маркерами, інтерактив настроюється саме там
	//Коли підготовка запускається з перемикачем true: гра завершується, 5 кнопок скидаються в нормальний режим, і спрацьовує перенаправлення
	//Ціль перенаправлення: автоматично натиснути кнопку із заданим параметром (поточна_лока), тобто ініціялізувати "природний" запуск локації без гри
	//Важливо! Якщо задати potochna_loka і потім перенаправити на якусь кнопку: то буде завантажена не "поточна_лока" а та, що фігурує в карті локацій і прив'язана до "поточної_локи"
	//Тому, щоб запустити точно ту локу, яку необхідно, оминаючи карту локацій, вмикаємо перемикач napriamu, це значить, що при натисканні кнопки, карта локацій буде ігноруватися, а KontentMaker завантажить ту локу, яка вказана в "поточній_лоці".
	public void BudeGra(boolean chyNi){
		if(!chyNi){btn1.setActionCommand("btn1_joker");
			btn2.setActionCommand("btn2_joker");
			btn3.setActionCommand("btn3_joker");
			btn4.setActionCommand("btn4_joker");
			btn5.setActionCommand("btn5_joker");
			
			loc_misto_int=1; perenapravlenniaKnpky(5);}
		else{btn1.setActionCommand("btn1");
			btn2.setActionCommand("btn2");
			btn3.setActionCommand("btn3");
			btn4.setActionCommand("btn4");
			btn5.setActionCommand("btn5");
			
			if(loc_misto_int==75|loc_misto_int==76){napriamu=true; potochna_loka=12;} else{napriamu=true; potochna_loka=10;} loc_misto_int=-1; perenapravlenniaKnpky(1);} }
		
	//Коли намічається бійка, передовсім необхідно уточнити: чи це буде бійка з усталеним опонентом, а чи з рандомним
	//Якщо оп рандомний, запускається помічний метод для вияснення деталів: самого опонента та нагород.
	//Якщо оп усталений, необхідно власноруч вказати деталі прямо тут.
	public void BudeBijka(boolean randomOp){
		randomOp2=randomOp;
		btn1.setActionCommand("btn1_bijka");
		btn2.setActionCommand("btn2_bijka");
		btn3.setActionCommand("btn3_bijka");
		
		if(randomOp){LisowaKazka(true);
			wide_field.setText(wide_field.getText().replaceFirst("%ІМЯМОБА", mob_names[lisowa_kazka]));
			mob_boj[lisowa_kazka]=true;
			ObslugaBoju(mob_hps[lisowa_kazka], mob_names[lisowa_kazka], 3);}
		else{wide_field.setText(wide_field.getText().replaceFirst("%ІМЯМОБА", mob_names[0])); 
			mob_boj[0]=true;
			ObslugaBoju(mob_hps[0], mob_names[0], 3);}
		
		wide_field.append("\n\n1. Полоскотати\n2. Вдарити відмашно\n3. Штрикнути");}
		
	//Метод генерує три параметри для бою, коли bij==true: ім'я моба (в діапазоні 4-9), назву куща, за яким ховається моб (складається з двох слів)
	//і приз, дроп, окрім зазначених.
	//Щодо дропу: коли випадає певний дроп, для нього генерується додаткові параметри, приміром, якщо падають Мідяки, додатково визначається їхня кількість
	//Якщо падають рожеві перли: додатково визначається скільки саме їх упало.
	//Тут потрібно задати діапазон імен мобів, у прикладі відсікаються люди, оскільки бій ведеться в лісі
	//Назва куща регулюється у відповідних масивах, це декоративний елемент
	//Затим список виключень, в якому зазначаться індекси тих ітемів (з масиву ітемів), які не повинні упасти.
	//Опісля, якщо дроп падає коректний, визначається чи це не складний дроп, що складається з двох частин
	//Якщо це складний дроп (який позначено індексами в масиві ітемів), йому визначаються додаткові параметри, залежно від конкретного дропу
	public void LisowaKazka(boolean bij){
		if(bij){
			for(int i=1; i<2147483647; i++){
				lisowa_kazka=(int)((mob_names.length-1)*Math.random());
				if(lisowa_kazka>3&&lisowa_kazka<10){i--;}
				else{//System.out.println("lisowa_kazka METOD: "+lisowa_kazka); 
					break;} }
				
			lisowyj_kush=(int)((kushi.length-1)*Math.random()); lisowyj_kush2=(int)((kushi2.length-1)*Math.random());}
			
			lisowyj_pryz=-1; liwsowyj_pryz=-1;
			for(int i=0; i<items.length; i++){lisowyj_pryz=(int)((items.length-1)*Math.random());
				//виключаю зі списку певні ітеми
				if(lisowyj_pryz!=0&&lisowyj_pryz!=1&&lisowyj_pryz!=2&&lisowyj_pryz!=3&&lisowyj_pryz!=4&&
				lisowyj_pryz!=8&&lisowyj_pryz!=9&&lisowyj_pryz!=10&&lisowyj_pryz!=16&&lisowyj_pryz!=17&&lisowyj_pryz!=24&&
				lisowyj_pryz!=25&&lisowyj_pryz!=26&&lisowyj_pryz!=27&&lisowyj_pryz!=28&&lisowyj_pryz!=29&&lisowyj_pryz!=30&&
				lisowyj_pryz!=31&&lisowyj_pryz!=32&&lisowyj_pryz!=33&&lisowyj_pryz!=34&&lisowyj_pryz!=40&&lisowyj_pryz!=41&&
				lisowyj_pryz!=42&&lisowyj_pryz!=43&&lisowyj_pryz!=44&&lisowyj_pryz!=45&&lisowyj_pryz!=46&&lisowyj_pryz!=59&&
				lisowyj_pryz!=60){
					if(lisowyj_pryz==6|lisowyj_pryz==47|lisowyj_pryz==49|lisowyj_pryz==50|lisowyj_pryz==51|lisowyj_pryz==52){
						int kilbkistb_bonusiw=(int)(10*Math.random()); if(lisowyj_pryz==6){kilbkistb_bonusiw=(int)(70*Math.random());} if(kilbkistb_bonusiw==0){kilbkistb_bonusiw=1;}
						liwsowyj_pryz=lisowyj_pryz; //для контролю додачі повторного ітему
						
						if(lisowyj_pryz==6){plusMidb(kilbkistb_bonusiw);}
						else if(lisowyj_pryz==47){med=kilbkistb_bonusiw;}
						else if(lisowyj_pryz==49){pirja=kilbkistb_bonusiw;}
						else if(lisowyj_pryz==50){chorni_dijamanty=kilbkistb_bonusiw;}
						else if(lisowyj_pryz==51){rozhevi_perly=kilbkistb_bonusiw;}
						else if(lisowyj_pryz==52){perepel_jaicja=kilbkistb_bonusiw;}} break;}
				else{i--;} } }
		
	public void ObslugaOdiagu(int odezha_index){
		for(int i=0; i<odiag.length; i++){if(i!=odezha_index){odiag[i]=false;} else{odiag[i]=true;}
			//System.out.println("odiag["+i+"] "+odiag[i]);
			} }
	//Сюди приходить кількість ОЗ моба, його ім'я, та кількість кнопок, що використовуються в бою
	//До списку зброї вносяться тільки ті ітеми з інвентаря, що мають більше 0 пошкоди
	//Важливо! Список зброї обмежено кількістю чарунок (при необхідно його можно розширити на три чи більше рядки)
	//Тому усі ітеми, що не є зброєю, повинні позначатися у масиві пошкод нулем.
	public void ObslugaBoju(int mobhp, String mobname, int btns){
		bij=true;
		int ii=0;
		//тут перевіряються ітеми, які є: і виставляються відповідно в пнель ітемів, якщо ітема нема чарунка панелі вимикається
		for(int i=0; i<items_boo.length; i++){
			if(items_boo[i]&&items_urn[items_eter[i]]!=0){
				//System.out.println("indx: "+i+"\nitems_boo["+i+"] = "+items_boo[i]+"\nitems_eter: "+items_eter[i]+"\nitems_urn = "+items_urn[items_eter[i]]);
				km_nazvy[ii].setText(items[items_eter[i]]); km_nazvy[ii].setToolTipText(items[items_eter[i]]); km_nazvy[ii].setEnabled(true); ii++;} }
		for(int i=0; i<km_nazvy.length; i++){
			if(!km_nazvy[i].isEnabled()){km_nazvy[i].setEnabled(false);}}
					
		knopky(btns);
		
		hpbar_mob.setStringPainted(true);
		hpbar_mob.setMaximum(mobhp);
		hpbar_mob.setValue(mobhp);
		hpbar_mob.setString(mobhp+" ОЗ "+mobname);
		hpbar_mob.setToolTipText(mobhp+" ОЗ "+mobname);
		hpbar_panel_mob.add(hpbar_mob);
		add(hpbar_panel_mob);
		revalidate();}
	
	//Цей метод безпосередньо відповідає за екшн бою: тут формується дмг, реалізуються спеціяльні предмети, і визначається завершення бою
	//Якщо активувати fixUrn -- на пошкоду не впливатиме жоден модифікатор, це може бути потрібно в ситуації, наприклад, коли треба "не вбити" ГГ
	//Якщо спеш ітемси не використовуються метод працює в автоматичному режимі, хіба що сюжетні бої (!randomOp2) необхідно завершувати тут вручну
	public void EkshnBoju(int max_item_urn, int max_mob_urn, String mob_name, String item_name, boolean kritShansGG, boolean kritShansMob, boolean fixUrn){
		if(fixUrn){urn_gg=(max_item_urn+poshkoda); urn_mob=max_mob_urn;}
		else{urn_gg=(int)(max_item_urn*Math.random()); //System.out.println("1 urn_gg: "+urn_gg);
			 if(urn_gg>0){urn_gg+=poshkoda; //System.out.println("2 urn_gg: "+urn_gg);
			} urn_mob=(int)(max_mob_urn*Math.random());}
		
		String[] vydUdaru_mob={"кусає", "дряпає", "шкрябає", "вдаряє", "гидко сміється", "розповідає бородатий анекдот", "наспівує моцковську мельодію", "плюється отрутою", "повторює тезиси рашиської пропаганди"};
		int indxVU_mob=(int)(vydUdaru_mob.length*Math.random());
		String[] vydUdaru_gg={"повчає", "лоскоче", "задає перцю чилі", "задає болгарського перцю", "задає духм'яного перцю", "урезонює", "сарказмує", "іронізує", "ганить", "роз'яснює", "не жартує", "духопелить", "відвішує бебехів", "подає стусана"};
		int indxVU_gg=(int)(vydUdaru_gg.length*Math.random());
		
		//еліксир літальности в дії
		if(litalbnyj){if(litalbnyj_c<5){litalbnyj_c++; kritShansGG=true;} else{litalbnyj=false; litalbnyj_c=0;}}
		critGG_boo=false; critMob_boo=false; boolean mylbnaDizo=false;
		if(kritShansGG){critChance_gg=(int)(100*Math.random()); if(litalbnyj){critChance_gg=100;} if(critChance_gg>90){urn_gg*=bazoKrit_gg; critGG_boo=true;}}
		else if(kritShansMob){critChance_mob=(int)(100*Math.random()); if(critChance_mob>95){urn_mob*=bazoKrit_mob; critMob_boo=true;}}
		//якщо вибраний ітем: мильна паличка
		if(vybranyjItem==4&&(int)(100*Math.random())>91){mylbnaDizo=true; urn_mob=0;}
		
		//спешлітемси
		if(misiachne_nasinnia){urn_mob=0; urn_gg+=(int)(2*Math.random());}
		else if(rukawycia_dino){urn_mob=0; urn_gg+=(int)(3*Math.random());}
		else if(sitka_karbon){urn_mob=0; urn_gg+=(int)(3*Math.random());}
		else if(lynwa_upokor){urn_mob=0; urn_gg+=(int)(3*Math.random());}
		else if(neprytomnyk){urn_mob=0; if((int)(100*Math.random())>=50){
			if((int)(100*Math.random())>=50){urn_gg=(hpbar_mob.getValue()/2);}
			else{urn_gg=hpbar_mob.getValue(); JOptionPane.showMessageDialog(this,"Сталося щось дивне!..");} } }
		else if(osheleshuwach){int rndOshel=(int)(100*Math.random());
			if(rndOshel==5){plusMidb(100); JOptionPane.showMessageDialog(this,"З кубика посипалися мідяки!");}
			else if(rndOshel==4){plusLyzardy(10); JOptionPane.showMessageDialog(this,"З кубика посипалися лизарди!");}
			else if(rndOshel==3){plusFbjordy(5); JOptionPane.showMessageDialog(this,"З кубика впали фьйорди!");}
			else if(rndOshel==2){urn_gg+=50; JOptionPane.showMessageDialog(this,"Цей удар обіцяє бути напівлегендарним!");}
			else if(rndOshel==1){urn_gg+=27; urn_mob+=12; JOptionPane.showMessageDialog(this,"Кубик посилив тя і спровокував звірюку");}
			else if(rndOshel>5&&rndOshel<9){dodachaDoInv(items[60], 60); JOptionPane.showMessageDialog(this,"З Ошелешувача випав ще один Ошелешувач..."); osheleshuwachx2=true;}
			else{
				if((int)(100*Math.random())>=50){
					if((int)(100*Math.random())>=50){urn_gg=(hpbar.getValue()/2); JOptionPane.showMessageDialog(this,"Статечний удар!");}
					else{urn_mob=0;}}
				else{
					if((int)(100*Math.random())>=50){
						if(hpbar.getValue()!=oz_gg){hpbar.setValue((hpbar.getValue()+((oz_gg-hpbar.getValue())/2))); JOptionPane.showMessageDialog(this,"Ти почуваєшся краще...");}
						else{endingQuestu(true, 50, false, 0); JOptionPane.showMessageDialog(this,"Зайвий досвід нікому не зашкодить");} }
					else{urn_mob=(hpbar_mob.getValue()/2); JOptionPane.showMessageDialog(this,"Упс!");} } } }
		
		//еліксири
		if(newrazlywyj){if(newrazlywyj_c<5){newrazlywyj_c++; urn_mob=0;} else{newrazlywyj=false; newrazlywyj_c=0;}}
		
		//якщо урон моба не понижується спешлами, то є вірогідність спецудару моба
		//отруйний укус діятиме кожен раунд бою, і поменшуватиметься на 5 одиниць, якщо, звісно, не будуть задіяні спешітемси
		if(urn_mob!=0){
			if(!otrujnyj_ukus_boo){
				for(int i=20; i<29; i++){if(mob_name.equals(mob_names[i])){
					if(i>25){if((int)(100*Math.random())>=50){otrujnyj_ukus_boo=true; otrujnyj_ukus=(int)(30*Math.random()); if(otrujnyj_ukus<10){otrujnyj_ukus=10;} urn_mob+=otrujnyj_ukus;} }
					else{int wogneslyz_tmp=(int)(100*Math.random()); 
						if(wogneslyz_tmp<30){wognedyh_boo=true; wognedyh=(int)(40*Math.random()); if(wognedyh<15){wognedyh=15;} urn_mob+=wognedyh;}
						else if(wogneslyz_tmp>40&&wogneslyz_tmp<80){slyzepljuj_boo=true; slyzepljuj=(int)(35*Math.random()); if(slyzepljuj<7){slyzepljuj=7;} urn_mob+=slyzepljuj;} } } } }
			else{
				if(otrujnyj_ukus>10){otrujnyj_ukus-=5; urn_mob+=otrujnyj_ukus;}
				else{otrujnyj_ukus=0; otrujnyj_ukus_boo=false;} } }
			
		//System.out.println("urn_gg: "+urn_gg+"\nurn_mob: "+urn_mob+"\ncritMob_boo: "+critMob_boo+"\ncritGG_boo: "+critGG_boo);
		if(urn_gg!=0&&urn_mob!=0){
			if(critGG_boo&&!critMob_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg+" *Крит!*");}
			else if(critMob_boo&&!critGG_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+" *Крит!*"+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg);}
			else if(critGG_boo&&critMob_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+" *Крит!*"+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg+" *Крит!*");}
			else {wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg);} }
		else if(urn_mob!=0&&critMob_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+" *Крит!*"+"\n\n"+item_name+" Промахнувсі ):");}
		else if(urn_mob!=0&&!critMob_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" "+vydUdaru_mob[indxVU_mob]+": -"+urn_mob+"\n\n"+item_name+" Промахнувсі ):");}
		else if(urn_mob==0&&urn_gg==0){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" Промахнувсі (:"+"\n\n"+item_name+" Промахнувсі ):");}
		else if(urn_mob==0&&critGG_boo){wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" Промахнувсі (:"+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg+" *Крит!*");}
		else{wide_field.setText(wide_field.getText()+"\n\n"+mob_name+" Промахнувсі (:"+"\n\n"+item_name+" "+vydUdaru_gg[indxVU_gg]+" "+mob_name+": -"+urn_gg);}
		
		if(mylbnaDizo){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" СКОНФУЖЕНИЙ!");}
		
		if(misiachne_nasinnia){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ЗАСНУВ!");}
		else if(rukawycia_dino){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" УПІЙМАНИЙ!");}
		else if(sitka_karbon){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ПОПАВСЯ!");}
		else if(lynwa_upokor){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" УПОКОРЕНИЙ!");}
		else if(neprytomnyk){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ПЕРЕМОЖЕНИЙ?!");}
		else if(osheleshuwach){wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ОШЕЛЕШЕНИЙ?!");}
		
		if(newrazlywyj){wide_field.setText(wide_field.getText()+"\n\n>>> "+imia_geroia[0]+": ЧИ ЦЕ СОН?!");}
		if(litalbnyj){wide_field.setText(wide_field.getText()+"\n\n>>> КРИТИЧНЕ НАТХНЕННЯ!");}
		if(kwasalo){wide_field.setText(wide_field.getText()+"\n\n>>> "+imia_geroia[0]+": ЩО ДЛЯ ИНЧОГО ШКОДА, ДЛЯ МЯ КОРИСНІСТЬ!'");}
		
		if(misiachne_nasinnia|rukawycia_dino|sitka_karbon|lynwa_upokor|neprytomnyk|osheleshuwach){misiachne_nasinnia=false; rukawycia_dino=false; sitka_karbon=false; lynwa_upokor=false; neprytomnyk=false; osheleshuwach=false; wide_field.setBackground(new Color(255,255,255)); inv_fieldlist.clearSelection();}
		
		if(kwasalo){
			if(hpbar.getValue()!=oz_gg){
				if((hpbar.getValue()+urn_mob)>oz_gg){hpbar.setValue(oz_gg);}
				else{hpbar.setValue(hpbar.getValue()+urn_mob); hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ");}}
			kwasalo_c++; if(kwasalo_c>4){kwasalo_c=0; kwasalo=false;}}
		else{hpbar.setValue(hpbar.getValue()-urn_mob); hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ");}
		hpbar_mob.setValue(hpbar_mob.getValue()-urn_gg); hpbar_mob.setString(hpbar_mob.getValue()+" ОЗ "+mob_name); hpbar_mob.setToolTipText(hpbar_mob.getValue()+" ОЗ "+mob_name);
		
		if(otrujnyj_ukus_boo){if(otrujnyj_ukus_persh){otrujnyj_ukus_persh=false; wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ОТРУЙНО КУСАЄ! (+"+otrujnyj_ukus+" пош.)");}
			else{wide_field.setText(wide_field.getText()+"\n\n>>> "+imia_geroia[0]+" ОТРУЄНИЙ! (+"+otrujnyj_ukus+" пош.)");} }
		else if(wognedyh_boo){wognedyh_boo=false; wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" ВОГНЕДИХ! (+"+wognedyh+" пош.)");}
		else if(slyzepljuj_boo){slyzepljuj_boo=false; wide_field.setText(wide_field.getText()+"\n\n>>> "+mob_name+" СЛИЗЕПЛЮЙ! (+"+slyzepljuj+" пош.)");}
		
		//якщо гг для ГГ
		if(hpbar.getValue()==0){GgDljaGG();}
			
		//System.out.println("EkshnBoju: buw_u_lisi: "+buw_u_lisi+", lisowa_kazka: "+lisowa_kazka);
			
		//якщо був у лісі, ініціялізується окремий ендінг, натомість база не зачіпає бої окремі од лісу, тобто ті, які не входять до пулу "лісової казки"
		if(randomOp2){if(mob_boj[lisowa_kazka]&&hpbar_mob.getValue()==0){knopky(2);
			if(liwsowyj_pryz!=-1&&PerewirkaItemiw(liwsowyj_pryz)){if(lisowyj_pryz==6){endingBoju(loc_lis_buw_ending_midb, mob_hps[lisowa_kazka], false, -1);} else{endingBoju(loc_lis_buw_ending, mob_hps[lisowa_kazka], false, -1);}}
			else{if(lisowyj_pryz>53){endingBoju(loc_lis_buw_ending_smittia, mob_hps[lisowa_kazka], true, lisowyj_pryz);} else{endingBoju(loc_lis_buw_ending, mob_hps[lisowa_kazka], true, lisowyj_pryz);} }
			ZaminaProcentu("%ІМЯМОБА", mob_names[lisowa_kazka]); ZaminaProcentu("%ІМЯКУЩА", kushi[lisowyj_kush]+kushi2[lisowyj_kush2]); ZaminaProcentu("%ІМЯІТЕМА", items[lisowyj_pryz]);
			mob_boj[lisowa_kazka]=false;} }
		else{
			//отримує Е. телескоп. дрюч.: далі бій з навіснілим лисом (1) або верт (2).
			if(mob_boj[0]&&hpbar_mob.getValue()==0){endingBoju(loc_lis2_vovk, mob_hps[0], true, 2); loc_lis_int=3; mob_boj[0]=false; btn2.setEnabled(true);}
			//отримує Л. телескоп. дрюч.: далі бій з ненорм. вепрем (1)
			else if(mob_boj[1]&&hpbar_mob.getValue()==0){endingBoju(loc_lis3_lys, mob_hps[1], true, 3); loc_lis_int=5; mob_boj[1]=false;}
			//отримує Л. телескоп. дрюч.: далі бій з гроболом (1)
			else if(mob_boj[2]&&hpbar_mob.getValue()==0){endingBoju(loc_lis4_vepr, mob_hps[2], true, 4); loc_lis_int=7; mob_boj[2]=false;}
			//отримує мильн. паличк..: далі виході до позамістя (1)
			else if(mob_boj[3]&&hpbar_mob.getValue()==0){endingBoju(loc_lis5_grobol, mob_hps[3], true, 5); loc_lis_int=9; mob_boj[3]=false; addJournal(journal2);} } }

	public void pawza(int time) {
		try {Thread.sleep(time);}
		catch (InterruptedException e){} }

	//Приймає текст, яки буде виведено опісля перемоги, кількість ОЗ моба (модифікатор для нарахування ОД), чи буде виданий приз, і якщо так: то який. Якщо приза не буде, інт приза ігнорується
	//Тут також регулюються (вручну) елексіри, дія яких спливає за певну кількість боїв, наприклад: коли активно еклексір univer_z, гравець отримує за перемогу х4 ОД, і х2 без елексіру.
	public void endingBoju(String finalText, int hpsMob, boolean prize, int prizeNum){
		btn1.setActionCommand("btn1");
		btn2.setActionCommand("btn2");
		btn3.setActionCommand("btn3");
		
		//щоб отруйний укус не переходив до наступного бою
		if(otrujnyj_ukus_boo){otrujnyj_ukus=0; otrujnyj_ukus_boo=false;}
		peremoga++;
		bij=false;
		hpbar_panel_mob.remove(hpbar_mob); remove(hpbar_panel_mob); wide_field.setText(finalText);
		
		for(int i=0; i<km_nazvy.length; i++){km_nazvy[i].setEnabled(false);}
		
		radioGroup.clearSelection();
		vybranyjItem=0;
		revalidate();
		
		if(univer_z){plusXP((hpsMob*4)); univer_z_c++; if(univer_z_c>4){univer_z=false; univer_z_c=0;}} else{plusXP((hpsMob*2));}
		
		//for(int i=1; i<btns_arr.length; i++){btns_arr[i].setEnabled(false);}
			
		if(prize){dodachaDoInv(items[prizeNum], prizeNum); if(zagalbnakorystb){LisowaKazka(false); dodachaDoInv(items[lisowyj_pryz], lisowyj_pryz); zagalbnakorystb_c++; if(zagalbnakorystb_c>4){zagalbnakorystb=false; litalbnyj_c=0;}}} }

	//Простий метод що видає ОД та (або) дроп. Нумер дропу вказується згідно його індексу в масиві ітемів
	public void endingQuestu(boolean xp, int xpSum, boolean prize, int prizeNum){if(xp){plusXP(xpSum);} if(prize){dodachaDoInv(items[prizeNum], prizeNum);} }
	
	//Метод нарахування ОД та контролю за рівнем ГГ, в залежности від рівня, ГГ отримує ріжні бонуси
	//стандартний бонус: +1-2 пошкоди; +10 % прибуток. Опісля 5 рів.: +20 % прибуток; опісля 10 рів.: +50 % приб.
	public void plusXP(int kilbkistbXP){
		if(baseLvlXp<(lvlbar.getValue()+kilbkistbXP)){rivenb++; 
			//System.out.println("riwni lenght: "+riwni.length);
			//кожен рівень є вірогідність 50 % отримати бонусом +2 або +5 (після 10 рів.) % прибутків
			if((int)(100*Math.random())>=50){if(rivenb>=10){prybutok+=5; poshkoda+=2;} else{prybutok+=2; poshkoda+=1;} }
			for(int i=0; i>-1; i++){oz_gg_tmp=(int)(15*Math.random()); if(oz_gg_tmp>5){oz_gg+=oz_gg_tmp; hpbar.setMaximum(oz_gg); hpbar.setValue(hpbar.getValue()+oz_gg_tmp); hpbar.setToolTipText(hpbar.getValue()+" ОЗ | ГГ"); break;}}
			poshkoda++; if(rivenb<5){prybutok+=10; JOptionPane.showMessageDialog(this,rivenb+"-й рівень! Досвід полегшує життя:\n+1-2 пошкоди\n+10-12 % прибутки\n+5-15 ОЗ");} else{if(rivenb>=10){prybutok+=50; JOptionPane.showMessageDialog(this,rivenb+"-й рівень! Досвід полегшує життя:\n+1-2 пошкоди\n+50-55 % прибутки\n+5-15 ОЗ");} else{prybutok+=20; JOptionPane.showMessageDialog(this,rivenb+"-й рівень! Досвід полегшує життя:\n+1-2 пошкоди\n+20-22 % прибутки\n+5-15 ОЗ");} }
			addJournal("+ Скидається на те, що моя філософічність підвищилася до "+rivenb+" рівня! Принагідно згадується: '"+riwni[rivenb-1]+"'.\n>>> +"+poshkoda+"-"+(poshkoda+1)+" пошкоди.\n>>> +"+prybutok+"-"+(prybutok+2)+" % прибутки.\n>>> +"+oz_gg_tmp+" ОЗ.");
			if(rivenb>=10){if(rivenb>=15){baseLvlXp+=(3250+(int)(3850*Math.random())); lvlbar.setMaximum(baseLvlXp);} else{baseLvlXp+=(1250+(int)(1850*Math.random())); lvlbar.setMaximum(baseLvlXp);} } else{baseLvlXp+=(250+(int)(850*Math.random())); lvlbar.setMaximum(baseLvlXp);} } //lvlup check
		lvlbar.setValue(lvlbar.getValue()+kilbkistbXP);
		lvlbar.setString(lvlbar.getValue()+" ОД");
		lvlbar.setToolTipText(lvlbar.getValue()+">"+baseLvlXp+" ОД");
		
		if(univer_z){String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> +"+kilbkistbXP+" (x4!) ОД\n\n1."));} else{String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> +"+kilbkistbXP+" ОД\n\n1."));}}
	
	//Простий метод для перевірки: чи є в інвентарі певний предмет, якщо він є, метод поверне true, якщо нема false.
	public boolean PerewirkaItemiw(int item){
		if(invlistmodel.size()!=0){
			if(inv_fieldlist.getNextMatch(items[item], 0, javax.swing.text.Position.Bias.Forward)==-1){return false;}
			else{return true;} }
		else{return false;} }
	
	//Метод вносить до інвентаря предмет, для цього потрібно передати назву предмета (наприклад з масиву назв предметів), та його реальний індекс, приміром: dodachaDoInv(items[10], 10]);
	//Метод вносить за раз тільки 1 предмет, цей предмет може бути звичайним або бонусним, в залежности од zagalbnakorystb та лічильника zagalbnakorystb_c_tmp -- у прикладі це дія елексіру
	public void dodachaDoInv(String item, int realIndx){
		if(inv_zer0){inv_zer0=false;}
		inv_fieldlist.clearSelection();
		invlistmodel.addElement(item);

		//після додавання ітему перевіряється чи він не один вже є в інвентарі
		//для цього йде 3-рівнева перевірка в іф: якщо знаходить попереду і позаду два ітеми з різними індексами, значить є як мінімум 2 однакові ітеми в інв.
		//тоді їхні індекси з інвентаря заносять в масив перевірки послідовно
		//для цього спочатку заноситься ітем на нульовий індекс, це важливо зробити до циклу, тому що цей індекс стане маркером в циклі
		//тоді вже в циклі шукається другий ітем починаючи з наступного індексу після того, який вже доданий і так до кінця інвентаря
		//щоб не було екзепшену перед додачею перевіряється, чи індекс, який планується перевірити в інвентарі: менший за розмір інвентаря, тому що розмір інвентаря завжди більше останнього індекса
		//коли всі ітеми з інв. додані, цикл офф. і запускається наступний цикл в елз вже по розміру масиву перевірки
		//індекси з масиву перевірки (які відповідають індексам інвентаря) визначають індекси службових масивів для запису логіки
		perevirka_kilbkosty.clear();
		if(inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)!=-1&&inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Backward)!=-1&&inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)!=inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Backward)){
			perevirka_kilbkosty.add(inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward));
			for(int i=1; i<invlistmodel.size(); i++){if(perevirka_kilbkosty.get(0)+i<invlistmodel.size()){perevirka_kilbkosty.add(inv_fieldlist.getNextMatch(item, perevirka_kilbkosty.get(0)+i, javax.swing.text.Position.Bias.Forward));}} }
		for(int i=0; i<perevirka_kilbkosty.size(); i++){//System.out.println("\nperevirka_kilbkosty: ("+i+") "+perevirka_kilbkosty.get(i)+"\nsize(): "+perevirka_kilbkosty.size());
			}
		
		if(perevirka_kilbkosty.size()<2){items_boo[inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)]=true;
			items_eter[inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)]=realIndx;}
		else{for(int i=0; i<perevirka_kilbkosty.size(); i++){items_boo[perevirka_kilbkosty.get(i)]=true; items_eter[perevirka_kilbkosty.get(i)]=realIndx;} }
		
		//System.out.println("item: "+item+"\nrealIndx: "+realIndx+"\ncomplexIndx: "+inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)+
		//"\nitems_eter["+inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)+"]= "+items_eter[inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward)]); 
		
		if(zagalbnakorystb){zagalbnakorystb_c_tmp++;}
		if(zagalbnakorystb_c_tmp>1){zagalbnakorystb_c_tmp=0; String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("1.", ">>> +"+item+" (бонус!)\n\n1."));}
		else{String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("1.", ">>> +"+item+"\n\n1."));}
		
		/*for(int i=0; i<items_boo.length; i++){
			//System.out.println("items_boo: ["+i+"] = "+items_boo[i]);}*/ }

	//На відміну від додавання, видобування з інвентаря можебне масове. Назва ітему має бути точною, з масиву ітемів
	public void vydobuvanniaZInv(String item, int kilbko){
		inv_fieldlist.clearSelection();
		for(int i=0; i<kilbko; i++){
			int x=1; int indxItem=inv_fieldlist.getNextMatch(item, 0, javax.swing.text.Position.Bias.Forward);
			invlistmodel.remove(indxItem);
			//через х додається завжди 1 окрім останньої ітерації, коли додавати 1 не треба, але треба відробити по справжньому індексу, тому що додавання 1 призведе до екзепшену
			for(int y=0; y<items_eter.length; y++){if(indxItem==items_eter.length){break;} if(indxItem+1==items_eter.length){x=0;} items_eter[indxItem]=items_eter[indxItem+x]; indxItem++;}

			//System.out.println("invlistmodel.size(): "+invlistmodel.size()+"\nindxItem: "+indxItem+"\nitems_eter.length: "+items_eter.length+"\nitems_boo["+invlistmodel.size()+"] "+items_boo[invlistmodel.size()]);

			items_boo[invlistmodel.size()]=false;}
			
			if(item!="Мідяки"|item!="Лизарди"|item!="Фьйорди"){String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> -"+item+"\n\n1."));} }

	//Простий метод для автоматичного тиску кнопки, щоб форсувати перехід на цільову локацію.
	//Це дуже корисно в поточній схемі квесту, оскільки дозволяє не копіпастити локації по різним кнопкам, і перенаправляти гравця з усіх кнопок на одну, де зазначено локацію.
	public void perenapravlenniaKnpky(int naJaku){naJaku--; btns_arr[naJaku].setEnabled(true); btns_arr[naJaku].doClick();}
	
	//Метод вмикає зазначену кількість кнопок: послідовно.	
	public void knopky(int sumKnpk){
		for(int i=0; i<sumKnpk; i++){btns_arr[i].setEnabled(true);}
		for(int i=sumKnpk; i<btns_arr.length; i++){btns_arr[i].setEnabled(false);}}
		
	//сюди передається логічний масив, що відповідає якомусь ланцюжкові квестів, ті квести, що виконані, позначаються true і відповідні кнопки вимикаються
	public void minusKnopky(boolean[] gotoviKvesty){for(int i=0; i<gotoviKvesty.length; i++){if(gotoviKvesty[i]){btns_arr[i].setEnabled(false);}} }

	//Додається запис у Журнал гравця, на окрему вкладку гри. Нові записи поміщуються зверху.
	public void addJournal(String journalPost){String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> Журнал оновлено.\n\n1.")); journalTmp=journal_field.getText(); journal_field.setText(journalPost+"\n\n"+journalTmp); globalbnyj_journal=journal_field.getText();}

	//Додається квест у відповідну вкладку гри. Нові квести поміщуються знизу.
	public void addQuest(int qNum){quest_field.setText(quest_field.getText()+quests[qNum]); quests_boo[qNum]=true;}

	//Виконаний квест маркується завершеним, його опис змінюється відповідно до запису в масиві виконаних квестів.
	public void questMarkx(int qNum){questsX_boo[qNum]=true;
		
		for(int i=0; i<quests_boo.length; i++){
			if(quests_boo[i]&&questsX_boo[i]){
				if(i!=0){quest_field.append(questsx[i]);}
				else{quest_field.setText(questsx[0]);}}
			else if(quests_boo[i]^questsX_boo[i]){
				if(i!=0){quest_field.append(quests[i]);}
				else{quest_field.setText(quests[0]);} } } }

	//Автоматичний метод, який відображає титул з назвою поточної локації.
	public void zminaMiscia(int locNum){loter.setText("Поточна локація: "+locs[locNum]); jaTut=locNum;}
	
	//фінансовий блок > > >
	//Ряд методів, які додають або віднімають гроші, у прикладі три види грошей: мідяки, лизарди та фьйорди.
	//На додачу грошей впливає модифікатор рівня, чим більше рівень ГГ, тим більше грошей він отримує.
	//Якщо ГГ у грі "Сон джокера" (sonjokera) -- модифікатори не впливають на прибуток.
	public void minusMidb(int midb){midiaky-=midb; if(midiaky<=0){vydobuvanniaZInv(items[6], 1); midiaky=0;} String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> -"+midb+" мідяків.\n\n1.")); if(sonjokera){sonjokera=false; midb_jokera_minus+=midb;}}
	
	public void plusMidb(int midb){
		if(sonjokera){sonjokera=false; midb_jokera+=midb;}
		//System.out.println("prybutok: "+prybutok+", midb: "+midb+", midiaky: "+midiaky);
		if(prybutok>0){midb_tmp=(midb*prybutok)/100; if(midb_tmp>0){midb+=midb_tmp;} //System.out.println("midb: "+midb);
			} midiaky+=midb; 
		if(invlistmodel.size()!=0){
			if(inv_fieldlist.getNextMatch(items[6], 0, javax.swing.text.Position.Bias.Forward)==-1){dodachaDoInv(items[6], 6);}}
		 else{dodachaDoInv(items[6], 6);}
		 
		String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("1.", ">>> +"+midb+" мідяків.\n\n1."));}
		 
	public void minusLysardy(int lyzard){lyzardy-=lyzard; if(lyzardy<=0){vydobuvanniaZInv(items[16], 1); lyzardy=0;} String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> -"+lyzard+" лизардів.\n\n1.")); if(sonjokera){sonjokera=false; lyzardy_jokera+=lyzard;}}
 
	public void plusLyzardy(int lyzard){
		//System.out.println("prybutok: "+prybutok+", lyzard: "+lyzard+", midiaky: "+lyzardy);
		if(prybutok>0){lyzardy_tmp=(lyzard*prybutok)/100; if(lyzardy_tmp>0){lyzard+=lyzardy_tmp;} //System.out.println("lyzard: "+lyzard);
			} lyzardy+=lyzard; 
		if(invlistmodel.size()!=0){
			if(inv_fieldlist.getNextMatch(items[16], 0, javax.swing.text.Position.Bias.Forward)==-1){dodachaDoInv(items[16], 16);} }
		 else{dodachaDoInv(items[16], 16);}
		 
		String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> +"+lyzard+" лизардів.\n\n1."));}
		 
	public void minusFbjordy(int fbjord){fbjordy-=fbjord; if(fbjordy<=0){vydobuvanniaZInv(items[17], 1); fbjordy=0;} String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> -"+fbjord+" фьйордів.\n\n1."));}
	
	public void plusFbjordy(int fbjord){
		//System.out.println("prybutok: "+prybutok+", fbjord: "+fbjord+", midiaky: "+fbjordy);
		if(prybutok>0){fbjordy_tmp=(fbjord*prybutok)/100; if(fbjordy_tmp>0){fbjord+=fbjordy_tmp;} //System.out.println("fbjord: "+fbjord);
			} fbjordy+=fbjord; 
		if(invlistmodel.size()!=0){
			if(inv_fieldlist.getNextMatch(items[17], 0, javax.swing.text.Position.Bias.Forward)==-1){dodachaDoInv(items[17], 17);}}
		 else{dodachaDoInv(items[17], 17);} 
		 
		String tmp_wideTxt=wide_field.getText(); wide_field.setText(tmp_wideTxt.replace("\n\n1.", "\n\n>>> +"+fbjord+" фьйордів.\n\n1."));}
	//фінансовий блок < < <
	
	//Далі ряд різних павзів, які можуть бути корисними в ріжних ситуаціях.
	//Щоб запустити таку павзу, потрібно: ініціялізувати її в потрібному місці BojowaPawza imiaPawza=new BojowaPawza("Dynamyka imeni");
	//Назва павзи ("Dynamyka imeni") може бути довільною.
	//Затим запустити потік imiaPawza.start(); -- це простий спосіб, точніше спосіб для простої павзи, но є складніші.
	//Приклад складної павзи: KosmichnaPawza
	//Спочаткутак само ініціялізується обжект павзи: KosmichnaPawza waitAmoment=new KosmichnaPawza("Dynamyka chasu");
	//Тоді вказується час павзи kosmichnyj_chas=5000;
	//Опісля вказується текст (опис локації) що буде відображено коли час павзи вичерпається: kosmichnyj_text="Час на базарі, як і за улюбленим заняттям, минає непомітно, щойно, здавалося, сонце сходило з-за небокрая, а вже клониться до заходу і базарники збирають речі, поволі закривають ятки, прибирають товари з полиць, столів і прилавків, димник загортає килими та зараз буде підмітати, квасник поскидав кружки до ящика, овочник прикрив відкриті коробки віхтем, хтось з торговців гучно сказав якомусь покупцеві: 'Приходь завтра, може появиться'.\n\n1. Йти на знайому вулицю";
	//Затим вказується кількість активних кнопок, потрібних цій локації: kosmichni_knopky=1;
	//І насамкінець запускається трід: waitAmoment.start();
	public class BojowaPawza extends Thread {
		private String name;
		public BojowaPawza(String name) {this.name=name;}

		public void run() {
			pawza(2000);
			if(name.equals("Dynamyka imeni")){perenapravlenniaKnpky(1);}} }
			
	public class InventarnaPawza extends Thread {
		private String name;
		public InventarnaPawza(String name) {this.name=name;}

		public void run() {
			pawza(10000);
			inv_fieldlist.clearSelection();}}
					
	//Потоковий метод картярської гри "Сон джокера".
	//sonjokera=true; -- потрібен для нарахування грошей без модифікаторів.
	//pawza((int)(2000*Math.random())); -- визначається павза перед тим, як буде показана карта.
	//З вірогідністю 1:99 випадає джокер
	//З вірогідністю 10:90 випадає туз
	//Якщо не випав джокер або туз, випадає будь-яка инча карта
	//Якщо випав джокер (13): опис формується особливо.
	//Гра дозволяє грати не тільки на гроші (мідяки, лизарди, фьйорди), а також речі (окрім тих, що внесено до списку виключень)
	//Список виключень формується в третій кнопкці прикладу, блок loc_misto_int==73, приміром, там виключаються усі 3 монети, та деякі предмети, а також окремо маркується сміття, бо гра на сміття в прикладі має особливу реакцію Азартника.
	//Коли результат відомий, ГГ нараховуються ОД за програш або виграш.
	//Наприкінці, в залежності од предметних чи грошових залишків ГГ формується наступна можлива дія, наприклад: зробити нову ставку, або припинити гру, якщо ставити більше нема що.
	//У прикладі використовується доволі складна схема гри з 3 різними монетами, на практиці це може спричиняти якісь трабли, тому в будь-якій незрозумілій ситуації: краще буде спростити модель, видалити з нього лизарди та фьйорди, лишити гру на речі і на гроші (мідяки), оскільки наявна логіка конче заплутана.
	public class SonJokera extends Thread {
		private String name;
			public SonJokera(String name) {this.name=name;}

				public void run() {
					
					sonjokera=true;
					
					btn1.setEnabled(false);
					
					pawza((int)(2000*Math.random()));
					
					int karta=(int)(100*Math.random());
					int karta_znak=(int)(100*Math.random());
					
					if(karta>=99){karta=13;}
					else if(karta>=90){karta=12;}
					else{karta=(int)(11*Math.random());}
					
					karta_znak=(int)(3*Math.random());
					
					if(karta!=13){wide_field.append("\n\nЦе: "+koloda[karta]+" "+koloda_znaky[karta_znak]);}
					else{
						if(karta_znak==1|karta_znak==3){wide_field.append("\n\nЦе: Красний "+koloda[karta]);}
						else{wide_field.append("\n\nЦе: Чорний "+koloda[karta]);} }
					
					//System.out.println("КАРТА: "+karta+" | | | знак: "+karta_znak);
					
					if(!graemo_na_shtany){
						if(!graemo_na_rechi){
							if(!graemo_na_lyzardy){
								if(!vaBank){
									if(karta_znak==1|karta_znak==3){wide_field.append("\n\nДивовижно, але ти виграв!\n");
										if(karta!=13&&karta!=12){wide_field.append(">>> +200 мідяків"); plusMidb(200);} 
										else if(karta==13){wide_field.append(">>> +400 мідяків"); plusMidb(400);}
										else if(karta==12){wide_field.append(">>> +300 мідяків"); plusMidb(300);} }
									else{wide_field.append("\n\nНа-таке! Ти програв...\n");
										if(karta!=13&&karta!=12){wide_field.append(">>> -200 мідяків"); minusMidb(200);} 
										else if(karta==13){
											if(midiaky<400){wide_field.append(">>> -"+midiaky+" мідяків"); minusMidb(midiaky);}
											else{wide_field.append(">>> -400 мідяків"); minusMidb(400);}}
										else if(karta==12){
											if(midiaky<300){wide_field.append(">>> -"+midiaky+" мідяків"); minusMidb(midiaky);}
											else{wide_field.append(">>> -300 мідяків"); minusMidb(300);}} } }
								else{
									if(karta_znak==1|karta_znak==3){wide_field.append("\n\nДивовижно, але ти виграв!\n");
										if(karta!=13&&karta!=12){wide_field.append(">>> +200 мідяків"); plusMidb(200);} 
										else if(karta==13){wide_field.append(">>> +400 мідяків"); plusMidb(400);}
										else if(karta==12){wide_field.append(">>> +300 мідяків"); plusMidb(300);} }
									else{wide_field.append("\n\nНа-таке! Ти програв...\n>>> -"+midiaky+" мідяків"); minusMidb(midiaky);}} }
							else{
								if(karta_znak==1|karta_znak==3){wide_field.append("\n\nДивовижно, але ти виграв!\n>>> +10,000 мідяків"); plusMidb(10000);}
								else{wide_field.append("\n\nНа-таке! Ти програв...\n>>> -10 лизардів"); minusLysardy(10);}
								graemo_na_lyzardy=false;} }
						else{
							if(karta_znak==1|karta_znak==3){wide_field.append("\n\nДивовижно, але ти виграв!\n");
								if(karta!=13&&karta!=12){wide_field.append(">>> +200 мідяків"); plusMidb(200);} 
								else if(karta==13){wide_field.append(">>> +400 мідяків"); plusMidb(400);}
								else if(karta==12){wide_field.append(">>> +300 мідяків"); plusMidb(300);} }
							else{wide_field.append("\n\nНа-таке! Ти програв...\n>>> -"+items[rndRich]); vydobuvanniaZInv(items[rndRich], 1);
								if(rndRich==47){med=0;}
								else if(rndRich==49){pirja=0;}
								else if(rndRich==50){chorni_dijamanty=0;}
								else if(rndRich==51){rozhevi_perly=0;}
								else if(rndRich==52){perepel_jaicja=0;} } } }
					else{
						if(karta_znak==1|karta_znak==3){wide_field.append("\n\nДивовижно, але ти виграв!\n"); prograw_shtany=false;
							if(karta!=13&&karta!=12){wide_field.append(">>> +200 мідяків"); plusMidb(200);} 
							else if(karta==13){wide_field.append(">>> +400 мідяків"); plusMidb(400);}
							else if(karta==12){wide_field.append(">>> +300 мідяків"); plusMidb(300);} }
						else{wide_field.append("\n\nНа-таке! Ти програв...\n>>> -Штани"); wide_field.setForeground(new Color(70,70,70)); /*NoweyjKolir(true,70,70,70);*/ prograw_shtany=true; ObslugaOdiagu(0);} }
					
					if(karta_znak==1|karta_znak==3){endingQuestu(true, (int)(10*Math.random()), false, 0);}
					else{endingQuestu(true, (int)(15*Math.random()), false, 0);}
					
					loc_misto_int=70; knopky(2); rndRich=-1; graemo_na_fbjordy=false; graemo_na_lyzardy=false; graemo_na_rechi=false; graemo_na_shtany=false; vaBank=false;
					
					if(midiaky<200&&midiaky>0&&!perma_gra_na_rechi){wide_field.append("\n\n1. Грати вабанк ("+midiaky+" мідяків)\n2. Годі"); vaBank=true;}
					else if(midiaky>=200&&!perma_gra_na_rechi){wide_field.append("\n\n1. Робити ставку (100 мідяків)\n2. Годі");}
					else if(lyzardy>0&&!minusLyzardy&&!perma_gra_na_rechi){wide_field.append("\n\n1. Грати на лизарди\n2. Годі"); graemo_na_lyzardy=true;}
					else if(fbjordy>0&&!minusFbjourdy&&!perma_gra_na_rechi){wide_field.append("\n\n1. Грати на фьйорди\n2. Годі"); graemo_na_fbjordy=true;}
					else if(midiaky==0&&lyzardy==0|minusLyzardy&&fbjordy==0|minusFbjourdy&&invlistmodel.size()>0||perma_gra_na_rechi){wide_field.append("\n\n1. Грати на речі\n2. Годі"); graemo_na_rechi=true;}
					else if(fbjordy==0&&lyzardy==0&&midiaky==0&&invlistmodel.size()==0&&!prograw_shtany||
							fbjordy>0&&minusFbjourdy&&lyzardy>0&&minusLyzardy&&midiaky==0&&invlistmodel.size()==2&&!prograw_shtany||
							fbjordy>0&&minusFbjourdy&&lyzardy==0&&midiaky==0&&invlistmodel.size()==1&&!prograw_shtany||
							fbjordy==0&&lyzardy>0&&minusLyzardy&&midiaky==0&&invlistmodel.size()==1&&!prograw_shtany){wide_field.append("\n\n1. Знімати штани і грати на них\n2. Годі"); graemo_na_shtany=true;}
					else if(fbjordy==0&&lyzardy==0&&midiaky==0&&invlistmodel.size()==0&&prograw_shtany||
					fbjordy>0&&minusFbjourdy&&lyzardy>0&&minusLyzardy&&midiaky==0&&invlistmodel.size()==2&&prograw_shtany||
					fbjordy>0&&minusFbjourdy&&lyzardy==0&&midiaky==0&&invlistmodel.size()==1&&prograw_shtany||
					fbjordy==0&&lyzardy>0&&minusLyzardy&&midiaky==0&&invlistmodel.size()==1&&prograw_shtany){wide_field.append("\n\n1. 'Без штанів, без мідяків, з порожніми кишенями... Тепер вже точно годі'"); naWyhod=true; btn2.setEnabled(false);} } }
			
	//поки що так, якщо буде ще потрібно, краще завернути цей стрім в метод, який би приймав статіки і запускати це просто через метод,а не стріми + статіки
	public class KosmichnaPawza extends Thread {
		private String name;
		public KosmichnaPawza(String name) {this.name=name;}

		public void run() {
			pawza(kosmichnyj_chas);
			wide_field.setText(kosmichnyj_text);
			knopky(kosmichni_knopky);
			kosmichni_knopky=0;
			kosmichnyj_text="";
			kosmichnyj_chas=0;}}
			
	//В цій павзі до опису локації додається інтерактив: Склотаренко міркує якийсь час, затим, в залежности від удачі пропонує гравцеві продати цінний товар (якщо він автентичний), або озвучує невтішний висновок про неавтентичність товару.
	public class SklotarnaPawza extends Thread {
		private String name;
		public SklotarnaPawza(String name) {this.name=name;}

		public void run() {
			for(int i=0; i<10; i++){
			if(i==0){wide_field.append("\n\n.");}
			else if(i==1){wide_field.append(" .");}
			else if(i==2){wide_field.append(" .");}
			else if(i==3){wide_field.append(" .");}
			else if(i==4){wide_field.append(" .");}
			else if(i==5){wide_field.append(" !"); break;}
			pawza(1250);}
			
			if((int)(100*Math.random())>=15){wide_field.append("\n\nСклотаренко зважив усі за-противи та виснував, що це справжнє скло, що се є автентична пляшка видатного майстра! Отже, вона відправляється до ящику під стійкою, а ти отримуєш умовлені гроші. По всьому Склотаренко спитав, чи не бажає бува пан продавати щось іще?\n\n1. 'Ні, годі. На все добре!'\n2. 'Пан бажає'");
				plusFbjordy(905);}
			else{wide_field.append("\n\nСклотаренко хотів було схопитися за голову руками, але вчасно спохватився, инакше б потрощив і пляшку і собі голову, хоча щодо першої шкоди жаліти не довелося б, адже, як виснував досвідчений пляшник, це скло, на жаль, несправжнє, ця пляшка — підробка! і не вартує не те що фьйордів, а й зламаного мідяка. Склотаренко повернув порожню пляшку, та спитавсі, чи не бажає пан чогось іще?\n\n1. 'Ні, я пішов звідси!'\n2. 'Так, є дещо' ");}
			
			vydobuvanniaZInv(items[46], 1);
			
			knopky(2);} }
			
	//Простий метод раптового завершення гри, виводить діалог з повідомленням, коли кнопка натиснута: гра закривається.
	public void GgDljaGG(){if(!fintheendandgg){JOptionPane.showMessageDialog(this,"Хай не стачило сил, та похвали гідне й старання!");} System.exit(0); return;}
			
	//Павза додає до опису рядки через певний час, коли усі рядки додано, активує 2 кнопки. Це приклад "імітації думання".
	public class ObertGalaktyky extends Thread {
		private String name;
		public ObertGalaktyky(String name) {this.name=name;}

		public void run() {
			int x=0;

			for(int i=0; i<20; i++){
			if(i==0){wide_field.append("\n\n.");}
			else if(i==1){wide_field.append(" .");}
			else if(i==2){wide_field.append(" .");}
			else if(i==3&&x==0){wide_field.append(" Положення не просте, рішення вимагає часу."); i=-1; x=1;}
			else if(i==3&&x==1){wide_field.append(" З'явилося декілька раційних зауважень, скоро все буде."); i=-1; x=2;}
			else if(i==3&&x==2){wide_field.append(" Смертоплясець пропонує залучити до бесіди місцевого альхеміка Панацео."); i=-1; x=3;}
			else if(i==3&&x==3){wide_field.append(" Ведмедязжер відкидає пропозицію Смертоплясеця, каже тре' діяти і вирішувати тут і зараз."); i=-1; x=4;}
			else if(i==3&&x==4){wide_field.append(" Вишибайло пропонує спинити плин думок та просто дивитися на Хропуна."); i=-1; x=5;}
			else if(i==3&&x==5){wide_field.append(" Кувалдина освітлює геніальна думка, але він не встигає її схопити."); i=-1; x=6;}
			else if(i==3&&x==6){wide_field.append(" Безпорадна тиша навіяла тобі деяке тлумачення цієї містерії."); i=-1; x=7;}
			else if(i==3&&x==7){wide_field.append(" Ще раз склавши всі 'за' та 'проти', ти вирішуєш:\n\n1. Думати ще\n2. Викласти здобуте тлумачення"); x=8; break;} //loc_misto_int=116;
			
			pawza(2345);}
			if(x==8){knopky(2);} }}

	//тут Панацео проводить дослід на ГГ, плескає йому в обличчя "пекельну мішанку" та й по всьому
	public class ObertAlbhemiji extends Thread {
		private String name;
		public ObertAlbhemiji(String name) {this.name=name;}

		public void run() {
			int x=0;
			String[] powidomlennia={"\n\n.", ".", ".", "П", "е", "к", "е", "л", "ь", "н", "и", "й ", "р", "о", "з", "ч", "и", "н ", "л", "е", "т", "и", "т", "ь ", "п", "р", "я", "м", "о ", "в ", "о", "б", "л", "и", "ч", "ч", "я", ".", "\n\n1. 'Навука мене не забуде!'"};
			pawza(40000);
			
			for(int y=0; y<powidomlennia.length; y++){wide_field.append(powidomlennia[y]); pawza(1145); x++;}
			
			if(x>=powidomlennia.length){knopky(1); plusMidb(3000); endingQuestu(true, 1, false, 0);} }}
			
	//Павза формує 250 рандомних назв зірок та додає їх до опису локації. Наприкінці усі назви вносяться у масив, з якого вони беруться для результатного файлу.
	public class ZirkovyjStrym extends Thread {
		private String name;

		public ZirkovyjStrym(String name) {this.name=name;}

		public void run() {
			int dovzhyna=0; String zirkova_bukva=""; String zirkove_slovo=""; boolean strym_off=false;
			
			for(int i=0; i<250; i++){
				//шукаємо слово довжиною більше 3 знаків
				for(int j=0; j>-1; j++){
				dovzhyna=(int)(12*Math.random());
				if(dovzhyna>=3){break;}}

					//згідно довжини запускається цикл, пріоритет в ньому для голосних 2:1
					//якщо випадає приголосна, вона додається в змінну, якщо ні, додається голосна
					//якщо додана буква не "ь" вона додається до формувального слова, інакше повтор
					//коли додається до слова перша буква вона повищується до тітульної
					//є вірогідність 10 % для нарощення "цифри" грецького альфабету
					for(int z=0; z<dovzhyna; z++){
						if((int)(2*Math.random())==0){zirkova_bukva=bvg[(int)((bvg.length-1)*Math.random())];}
						else{zirkova_bukva=aeje[(int)((aeje.length-1)*Math.random())];}
						
						if(zirkova_bukva.equals("ь")){z--;}
						else{
							if(z==0){zirkove_slovo+=zirkova_bukva; zirkove_slovo=zirkove_slovo.toUpperCase();}
							else{zirkove_slovo+=zirkova_bukva;}
							
							if(z==dovzhyna-1&&(int)(100*Math.random())>90){zirkove_slovo+=" "+zirNums[(int)(30*Math.random())];} } }
			
			if(i!=249){wide_field.append(zirkove_slovo+", "); znaje_zirky_m[i]=zirkove_slovo+", ";}
			else{wide_field.append(zirkove_slovo+"'."); znaje_zirky_m[i]=zirkove_slovo+".";}
			
			zirkove_slovo="";
			
			pawza(145);
			if(i==249){strym_off=true; break;}}
			if(strym_off){wide_field.append("\n\n1. Дякувати за цінну астрономію"); knopky(1); gavy5[0]=true; addJournal(journal16);} } }
		
//************************************MAIN
	public static void main(String[] args) {new TaZaradySpravedlyvoshty();}
}
